from PySide6.QtGui import QTextCursor
import re
from hangul import repair_dict

def repair(self, tc, event):
        
        tc.movePosition(QTextCursor.PreviousCharacter, QTextCursor.KeepAnchor, 1)
        t = tc.selectedText()
        if t in ("바", "버", "뱌", "벼", "부", "뷰", "보", "뵤", "비", "브", "배", "뱨", "베", "볘"):
            tc.insertText("ㅂ")
            return True
        elif t in ("자", "저", "쟈", "져", "주", "쥬", "조", "죠", "지", "즈", "재", "쟤", "제", "졔"):
            tc.insertText("ㅈ")
            return True
        elif t in ("다", "더", "댜", "뎌", "두", "듀", "도", "됴", "디", "드", "대", "댸", "데", "뎨"):
            tc.insertText("ㄷ")
            return True
        elif t in ("가", "거", "갸", "겨", "구", "규", "고", "교", "기", "그", "개", "걔", "게", "계"):
            tc.insertText("ㄱ")
            return True

        elif t in ("사", "서", "샤", "셔", "수", "슈", "소", "쇼", "시", "스", "새", "섀", "세", "셰"):
            tc.insertText("ㅅ")
            return True     
        elif t in ("마", "머", "먀", "며", "무", "뮤", "모", "묘", "미", "므", "매", "먜", "메", "몌"):
            tc.insertText("ㅁ")
            return True
        elif t in ("나", "너", "냐", "녀", "누", "뉴", "노", "뇨", "니", "느", "내", "냬", "네", "녜"):
            tc.insertText("ㄴ")
            return True

        elif t in ("아", "어", "야", "여", "우", "유", "오", "요", "이", "으", "애", "얘", "에", "예"):
            tc.insertText("ㅇ")
            return True
        elif t in ("라", "러", "랴", "려", "루", "류", "로", "료", "리", "르", "래", "럐", "레", "례"):
            tc.insertText("ㄹ")
            return True
        elif t in ("하", "허", "햐", "혀", "후", "휴", "호", "효", "히", "흐", "해", "햬", "헤", "혜"):
            tc.insertText("ㅎ")
            return True
        elif t in ("카", "커", "캬", "켜", "쿠", "큐", "코", "쿄", "키", "크", "캐", "컈", "케", "켸"):
            tc.insertText("ㅋ")
            return True
        elif t in ("타", "터", "탸", "텨", "투", "튜", "토", "툐", "티", "트", "태", "턔", "테", "톄"):
            tc.insertText("ㅌ")
            return True
        elif t in ("차", "처", "챠", "쳐", "추", "츄", "초", "쵸", "치", "츠", "채", "챼", "체", "쳬"):
            tc.insertText("ㅊ")
            return True
        elif t in ("파", "퍼", "퍄", "펴", "푸", "퓨", "포", "표", "피", "프", "패", "퍠", "페", "폐"):
            tc.insertText("ㅍ")
            return True
        elif t in ("빠", "뻐", "뺘", "뼈", "뿌", "쀼", "뽀", "뾰", "삐", "쁘", "빼", "뺴", "뻬", "뼤"):
            tc.insertText("ㅃ")
            return True
        elif t in ("짜", "쩌", "쨔", "쪄", "쭈", "쮸", "쪼", "쬬", "찌", "쯔", "째", "쨰", "쩨", "쪠"):
            tc.insertText("ㅉ")
            return True
        elif t in ("따", "떠", "땨", "뗘", "뚜", "뜌", "또", "뚀", "띠", "뜨", "때", "떄", "떼", "뗴"):
            tc.insertText("ㄸ")
            return True
        elif t in ("까", "꺼", "꺄", "껴", "꾸", "뀨", "꼬", "꾜", "끼", "끄", "깨", "꺠", "께", "꼐"):
            tc.insertText("ㄲ")
            return True
        elif t in ("싸", "써", "쌰", "쎠", "쑤", "쓔", "쏘", "쑈", "씨", "쓰", "쌔", "썌", "쎄", "쎼"):
            tc.insertText("ㅆ")
            return True
        
        elif t in ("밥", "밪", "받", "박", "밧", "밤", "반", "방", "발", "밯", "밬", "밭", "밫", "밮", "밖", "밨"):
            tc.insertText("바")
            return True
        elif t in ("법", "벚", "벋", "벅", "벗", "범", "번", "벙", "벌", "벟", "벜", "벝", "벚", "벞", "벆", "벘"):
            tc.insertText("버")
            return True

        elif t in ("뱝", "뱢", "뱓", "뱍", "뱟", "뱜", "뱐", "뱡", "뱔", "뱧", "뱤", "뱥", "뱣", "뱦", "뱎", "뱠"):
            tc.insertText("뱌")
            return True
        elif t in ("볍", "볒", "볃", "벽", "볏", "볌", "변", "병", "별", "볗", "볔", "볕", "볓", "볖", "벾", "볐"):
            tc.insertText("벼")
            return True
        elif t in ("붑", "붖", "붇", "북", "붓", "붐", "분", "붕", "불", "붛", "붘", "붙", "붗", "붚", "붂", "붔"):
            tc.insertText("부")
            return True
        elif t in ("븁", "븆", "뷷", "뷱", "븃", "븀", "뷴", "븅", "뷸", "븋", "븈", "븉", "븇", "븊", "뷲", "븄"):
            tc.insertText("뷰")
            return True
        elif t in ("봅", "봊", "볻", "복", "봇", "봄", "본", "봉", "볼", "봏", "봌", "봍", "봋", "봎", "볶", "봈"):
            tc.insertText("보")
            return True
        elif t in ("뵵", "뵺", "뵫", "뵥", "뵷", "뵴", "뵨", "뵹", "뵬", "뵿", "뵼", "뵽", "뵻", "뵾", "뵦", "뵸"):
            tc.insertText("뵤")
            return True
        
        elif t in ("빕", "빚", "빋", "빅", "빗", "빔", "빈", "빙", "빌", "빟", "빜", "빝", "빛", "빞", "빆", "빘"):
            tc.insertText("비")
            return True
        
        elif t in ("븝", "븢", "븓", "븍", "븟", "븜", "븐", "븡", "블", "븧", "븤", "븥", "븣", "븦", "븎", "븠"):
            tc.insertText("브")
            return True
        
        elif t in ("뱁", "뱆", "밷", "백", "뱃", "뱀", "밴", "뱅", "밸", "뱋", "뱈", "뱉", "뱇", "뱊", "밲", "뱄"):
            tc.insertText("배")
            return True
        elif t in ("뱹", "뱾", "뱯", "뱩", "뱻", "뱸", "뱬", "뱽", "뱰", "벃", "벀", "벁", "뱿", "벂", "뱪", "뱼"):
            tc.insertText("뱨")
            return True
        elif t in ("벱", "벶", "벧", "벡", "벳", "벰", "벤", "벵", "벨", "벻", "벸", "벹", "벷", "벺", "벢", "벴"):
            tc.insertText("베")
            return True
        elif t in ("볩", "볮", "볟", "볙", "볫", "볨", "볜", "볭", "볠", "볳", "볰", "볱", "볯", "볲", "볚", "볬"):
            tc.insertText("볘")
            return True

        

        elif t in ("잡", "잦", "잗", "작", "잣", "잠", "잔", "장", "잘", "잫", "잨", "잩", "잧", "잪", "잒", "잤"):
            tc.insertText("자")
            return True
        elif t in ("접", "젖", "젇", "적", "젓", "점", "전", "정", "절", "젛", "젘", "젙", "젗", "젚", "젂", "젔"):
            tc.insertText("저")
            return True

        elif t in ("쟙", "쟞", "쟏", "쟉", "쟛", "쟘", "쟌", "쟝", "쟐", "쟣", "쟠", "쟡", "쟟", "쟢", "쟊", "쟜"):
            tc.insertText("쟈")
            return True
        elif t in ("졉", "졎", "젿", "젹", "졋", "졈", "젼", "졍", "졀", "졓", "졐", "졑", "졏", "졒", "젺", "졌"):
            tc.insertText("져")
            return True
        elif t in ("줍", "줒", "줃", "죽", "줏", "줌", "준", "중", "줄", "줗", "줔", "줕", "줓", "줖", "죾", "줐"):
            tc.insertText("주")
            return True
        elif t in ("쥽", "즂", "쥳", "쥭", "쥿", "쥼", "쥰", "즁", "쥴", "즇", "즄", "즅", "즃", "즆", "쥮", "즀"):
            tc.insertText("쥬")
            return True
        elif t in ("좁", "좆", "졷", "족", "좃", "좀", "존", "종", "졸", "좋", "좈", "좉", "좇", "좊", "졲", "좄"):
            tc.insertText("조")
            return True
        elif t in ("죱", "죶", "죧", "죡", "죳", "죰", "죤", "죵", "죨", "죻", "죸", "죹", "죷", "죺", "죢", "죴"):
            tc.insertText("죠")
            return True
  
        elif t in ("집", "짖", "짇", "직", "짓", "짐", "진", "징", "질", "짛", "짘", "짙", "짗", "짚", "짂", "짔"):
            tc.insertText("지")
            return True

        elif t in ("즙", "즞", "즏", "즉", "즛", "즘", "즌", "증", "즐", "즣", "즠", "즡", "즟", "즢", "즊", "즜"):
            tc.insertText("즈")
            return True
        
        elif t in ("잽", "쟂", "잳", "잭", "잿", "잼", "잰", "쟁", "잴", "쟇", "쟄", "쟅", "쟃", "쟆", "잮", "쟀"):
            tc.insertText("재")
            return True
        elif t in ("쟵", "쟺", "쟫", "쟥", "쟷", "쟴", "쟨", "쟹", "쟬", "쟿", "쟼", "쟽", "쟻", "쟾", "쟦", "쟸"):
            tc.insertText("쟤")
            return True
        elif t in ("젭", "젲", "젣", "젝", "젯", "젬", "젠", "젱", "젤", "젷", "젴", "젵", "젳", "젶", "젞", "젰"):
            tc.insertText("제")
            return True
        elif t in ("졥", "졪", "졛", "졕", "졧", "졤", "졘", "졩", "졜", "졯", "졬", "졭", "졫", "졮", "졖", "졨"):
            tc.insertText("졔")
            return True


        elif t in ("답", "닺", "닫", "닥", "닷", "담", "단", "당", "달", "닿", "닼", "닽", "닺", "닾", "닦", "닸"):
            tc.insertText("다")
            return True
        elif t in ("덥", "덪", "덛", "덕", "덧", "덤", "던", "덩", "덜", "덯", "덬", "덭", "덫", "덮", "덖", "덨"):
            tc.insertText("더")
            return True

        elif t in ("댭", "댲", "댣", "댝", "댯", "댬", "댠", "댱", "댤", "댷", "댴", "댵", "댳", "댶", "댞", "댰"):
            tc.insertText("댜")
            return True
        elif t in ("뎝", "뎢", "뎓", "뎍", "뎟", "뎜", "뎐", "뎡", "뎔", "뎧", "뎤", "뎥", "뎣", "뎦", "뎎", "뎠"):
            tc.insertText("뎌")
            return True
        elif t in ("둡", "둦", "둗", "둑", "둣", "둠", "둔", "둥", "둘", "둫", "둨", "둩", "둧", "둪", "둒", "둤"):
            tc.insertText("두")
            return True
        elif t in ("듑", "듖", "듇", "듁", "듓", "듐", "듄", "듕", "듈", "듛", "듘", "듙", "듗", "듚", "듂", "듔"):
            tc.insertText("듀")
            return True
        elif t in ("돕", "돚", "돋", "독", "돗", "돔", "돈", "동", "돌", "돟", "돜", "돝", "돛", "돞", "돆", "돘"):
            tc.insertText("도")
            return True
        elif t in ("둅", "둊", "됻", "됵", "둇", "둄", "됸", "둉", "됼", "둏", "둌", "둍", "둋", "둎", "됶", "둈"):
            tc.insertText("됴")
            return True
  
        elif t in ("딥", "딪", "딛", "딕", "딧", "딤", "딘", "딩", "딜", "딯", "딬", "딭", "딫", "딮", "딖", "딨"):
            tc.insertText("디")
            return True

        elif t in ("듭", "듲", "듣", "득", "듯", "듬", "든", "등", "들", "듷", "듴", "듵", "듳", "듶", "듞", "듰"):
            tc.insertText("드")
            return True
        
        elif t in ("댑", "댖", "댇", "댁", "댓", "댐", "댄", "댕", "댈", "댛", "댘", "댙", "댗", "댚", "댂", "댔"):
            tc.insertText("대")
            return True
        elif t in ("덉", "덎", "댿", "댹", "덋", "덈", "댼", "덍", "덀", "덓", "덐", "덑", "덏", "덒", "댺", "덌"):
            tc.insertText("댸")
            return True
        elif t in ("뎁", "뎆", "덷", "덱", "뎃", "뎀", "덴", "뎅", "델", "뎋", "뎈", "뎉", "뎇", "뎊", "덲", "뎄"):
            tc.insertText("데")
            return True
        elif t in ("뎹", "뎾", "뎯", "뎩", "뎻", "뎸", "뎬", "뎽", "뎰", "돃", "돀", "돁", "뎿", "돂", "뎪", "뎼"):
            tc.insertText("뎨")
            return True
        
        elif t in ("갑", "갖", "갇", "각", "갓", "감", "간", "강", "갈", "갛", "갘", "갈", "갗", "갚", "갂", "갔"):
            tc.insertText("가")
            return True
        elif t in ("겁", "겆", "걷", "걱", "것", "검", "건", "겅", "걸", "겋", "겈", "걸", "겇", "겊", "걲", "겄"):
            tc.insertText("거")
            return True

        elif t in ("걉", "걎", "갿", "갹", "걋", "걈", "갼", "걍", "걀", "걓", "걐", "걑", "걏", "걒", "갺", "걌"):
            tc.insertText("갸")
            return True
        elif t in ("겹", "겾", "겯", "격", "겻", "겸", "견", "경", "결", "곃", "곀", "곁", "겿", "곂", "겪", "겼"):
            tc.insertText("겨")
            return True
        elif t in ("굽", "궂", "굳", "국", "굿", "굼", "군", "궁", "굴", "궇", "궄", "궅", "궃", "궆", "굮", "궀"):
            tc.insertText("구")
            return True
        elif t in ("귭", "귲", "귣", "귝", "귯", "귬", "균", "귱", "귤", "귷", "귴", "귵", "귳", "귶", "귞", "귰"):
            tc.insertText("규")
            return True
        elif t in ("곱", "곶", "곧", "곡", "곳", "곰", "곤", "공", "골", "곻", "곸", "곹", "곷", "곺", "곢", "곴"):
            tc.insertText("고")
            return True
        elif t in ("굡", "굦", "굗", "굑", "굣", "굠", "굔", "굥", "굘", "굫", "굨", "굩", "굧", "굪", "굒", "굤"):
            tc.insertText("교")
            return True
  
        elif t in ("깁", "깆", "긷", "긱", "깃", "김", "긴", "깅", "길", "깋", "깈", "깉", "깇", "깊", "긲", "깄"):
            tc.insertText("기")
            return True

        elif t in ("급", "긎", "귿", "극", "긋", "금", "근", "긍", "글", "긓", "긐", "긑", "긏", "긒", "귺", "긌"):
            tc.insertText("그")
            return True
        
        elif t in ("갭", "갲", "갣", "객", "갯", "갬", "갠", "갱", "갤", "갷", "갴", "갵", "갳", "갶", "갞", "갰"):
            tc.insertText("개")
            return True
        elif t in ("걥", "걪", "걛", "걕", "걧", "걤", "걘", "걩", "걜", "걯", "걬", "걭", "걫", "걮", "걖", "걨"):
            tc.insertText("걔")
            return True
        elif t in ("겝", "겢", "겓", "겍", "겟", "겜", "겐", "겡", "겔", "겧", "겤", "겥", "겣", "겦", "겎", "겠"):
            tc.insertText("게")
            return True
        elif t in ("곕", "곚", "곋", "곅", "곗", "곔", "곈", "곙", "곌", "곟", "곜", "곝", "곛", "곞", "곆", "곘"):
            tc.insertText("계")
            return True

        elif t in ("삽", "샂", "삳", "삭", "삿", "삼", "산", "상", "살", "샇", "샄", "샅", "샃", "샆", "삮", "샀"):
            tc.insertText("사")
            return True
        elif t in ("섭", "섲", "섣", "석", "섯", "섬", "선", "성", "설", "섷", "섴", "섵", "섳", "섶", "섞", "섰"):
            tc.insertText("서")
            return True

        elif t in ("샵", "샺", "샫", "샥", "샷", "샴", "샨", "샹", "샬", "샿", "샼", "샽", "샻", "샾", "샦", "샸"):
            tc.insertText("샤")
            return True
        elif t in ("셥", "셪", "셛", "셕", "셧", "셤", "션", "셩", "셜", "셯", "셬", "셭", "셫", "셮", "셖", "셨"):
            tc.insertText("셔")
            return True
        elif t in ("숩", "숮", "숟", "숙", "숫", "숨", "순", "숭", "술", "숳", "숰", "숱", "숯", "숲", "숚", "숬"):
            tc.insertText("수")
            return True
        elif t in ("슙", "슞", "슏", "슉", "슛", "슘", "슌", "슝", "슐", "슣", "슠", "슡", "슟", "슢", "슊", "슜"):
            tc.insertText("슈")
            return True
        elif t in ("솝", "솢", "솓", "속", "솟", "솜", "손", "송", "솔", "솧", "솤", "솥", "솣", "솦", "솎", "솠"):
            tc.insertText("소")
            return True
        elif t in ("숍", "숒", "숃", "쇽", "숏", "숌", "숀", "숑", "숄", "숗", "숔", "숕", "숓", "숖", "쇾", "숐"):
            tc.insertText("쇼")
            return True
  
        elif t in ("십", "싲", "싣", "식", "싯", "심", "신", "싱", "실", "싷", "싴", "싵", "싳", "싶", "싞", "싰"):
            tc.insertText("시")
            return True

        elif t in ("습", "슺", "슫", "슥", "슷", "슴", "슨", "승", "슬", "슿", "슼", "슽", "슻", "슾", "슦", "슸"):
            tc.insertText("스")
            return True
        
        elif t in ("샙", "샞", "샏", "색", "샛", "샘", "샌", "생", "샐", "샣", "샠", "샡", "샟", "샢", "샊", "샜"):
            tc.insertText("새")
            return True
        elif t in ("섑", "섖", "섇", "섁", "섓", "섐", "섄", "섕", "섈", "섛", "섘", "섙", "섗", "섚", "섂", "섔"):
            tc.insertText("섀")
            return True
        elif t in ("셉", "셎", "섿", "섹", "셋", "셈", "센", "셍", "셀", "셓", "셐", "셑", "셏", "셒", "섺", "셌"):
            tc.insertText("세")
            return True
        elif t in ("솁", "솆", "셷", "셱", "솃", "솀", "셴", "솅", "셸", "솋", "솈", "솉", "솇", "솊", "셲", "솄"):
            tc.insertText("셰")
            return True

        elif t in ("맙", "맞", "맏", "막", "맛", "맘", "만", "망", "말", "맣", "맠", "맡", "맟", "맢", "맊", "맜"):
            tc.insertText("마")
            return True
        elif t in ("멉", "멎", "먿", "먹", "멋", "멈", "먼", "멍", "멀", "멓", "멐", "멑", "멏", "멒", "먺", "멌"):
            tc.insertText("머")
            return True

        
            
        elif t in ("먑", "먖", "먇", "먁", "먓", "먐", "먄", "먕", "먈", "먛", "먘", "먙", "먗", "먚", "먂", "먔"):
            tc.insertText("먀")
            return True
        elif t in ("몁", "몆", "멷", "멱", "몃", "몀", "면", "명", "멸", "몋", "몈", "몉", "몇", "몊", "멲", "몄"):
            tc.insertText("며")
            return True
        elif t in ("뭅", "뭊", "묻", "묵", "뭇", "뭄", "문", "뭉", "물", "뭏", "뭌", "뭍", "뭋", "뭎", "묶", "뭈"):
            tc.insertText("무")
            return True
        elif t in ("뮵", "뮺", "뮫", "뮥", "뮷", "뮴", "뮨", "뮹", "뮬", "뮿", "뮼", "뮽", "뮻", "뮾", "뮦", "뮸"):
            tc.insertText("뮤")
            return True
        elif t in ("몹", "몾", "몯", "목", "못", "몸", "몬", "몽", "몰", "뫃", "뫀", "뫁", "몿", "뫂", "몪", "몼"):
            tc.insertText("모")
            return True
        elif t in ("묩", "묮", "묟", "묙", "묫", "묨", "묜", "묭", "묠", "묳", "묰", "묱", "묯", "묲", "묚", "묬"):
            tc.insertText("묘")
            return True
  
        elif t in ("밉", "밎", "믿", "믹", "밋", "밈", "민", "밍", "밀", "밓", "밐", "밑", "및", "밒", "믺", "밌"):
            tc.insertText("미")
            return True

        elif t in ("믑", "믖", "믇", "믁", "믓", "믐", "믄", "믕", "믈", "믛", "믘", "믙", "믗", "믚", "믂", "믔"):
            tc.insertText("므")
            return True
        
        elif t in ("맵", "맺", "맫", "맥", "맷", "맴", "맨", "맹", "맬", "맿", "맼", "맽", "맻", "맾", "맦", "맸"):
            tc.insertText("매")
            return True
        elif t in ("먭", "먲", "먣", "먝", "먯", "먬", "먠", "먱", "먤", "먷", "먴", "먵", "먳", "먶", "먞", "먰"):
            tc.insertText("먜")
            return True
        elif t in ("멥", "멪", "멛", "멕", "멧", "멤", "멘", "멩", "멜", "멯", "멬", "멭", "멫", "멮", "멖", "멨"):
            tc.insertText("메")
            return True
        elif t in ("몝", "몢", "몓", "몍", "몟", "몜", "몐", "몡", "몔", "몧", "몤", "몔", "몣", "몦", "몎", "몠"):
            tc.insertText("몌")
            return True

        elif t in ("납", "낮", "낟", "낙", "낫", "남", "난", "낭", "날", "낳", "낰", "낱", "낯", "낲", "낚", "났"):
            tc.insertText("나")
            return True
        elif t in ("넙", "넞", "넏", "넉", "넛", "넘", "넌", "넝", "널", "넣", "넠", "넡", "넟", "넢", "넊", "넜"):
            tc.insertText("너")
            return True       
            
        elif t in ("냡", "냦", "냗", "냑", "냣", "냠", "냔", "냥", "냘", "냫", "냨", "냩", "냧", "냪", "냒", "냤"):
            tc.insertText("냐")
            return True
        elif t in ("녑", "녖", "녇", "녁", "녓", "념", "년", "녕", "녈", "녛", "녘", "녙", "녗", "녚", "녂", "녔"):
            tc.insertText("녀")
            return True
        elif t in ("눕", "눚", "눋", "눅", "눗", "눔", "눈", "눙", "눌", "눟", "눜", "눝", "눛", "눞", "눆", "눘"):
            tc.insertText("누")
            return True
        elif t in ("늅", "늊", "뉻", "뉵", "늇", "늄", "뉸", "늉", "뉼", "늏", "늌", "늍", "늋", "늎", "뉶", "늈"):
            tc.insertText("뉴")
            return True
        elif t in ("놉", "놎", "녿", "녹", "놋", "놈", "논", "농", "놀", "놓", "놐", "놑", "놏", "높", "녺", "놌"):
            tc.insertText("노")
            return True
        elif t in ("뇹", "뇾", "뇯", "뇩", "뇻", "뇸", "뇬", "뇽", "뇰", "눃", "눀", "눁", "뇿", "눂", "뇪", "뇼"):
            tc.insertText("뇨")
            return True
  
        elif t in ("닙", "닞", "닏", "닉", "닛", "님", "닌", "닝", "닐", "닣", "닠", "닡", "닟", "닢", "닊", "닜"):
            tc.insertText("니")
            return True

        elif t in ("늡", "늦", "늗", "늑", "늣", "늠", "는", "능", "늘", "늫", "늨", "늩", "눛", "늪", "늒", "늤"):
            tc.insertText("느")
            return True
        
        elif t in ("냅", "냊", "낻", "낵", "냇", "냄", "낸", "냉", "낼", "냏", "냌", "냍", "냋", "냎", "낶", "냈"):
            tc.insertText("내")
            return True
        elif t in ("냽", "넂", "냳", "냭", "냿", "냼", "냰", "넁", "냴", "넇", "넄", "넅", "넃", "넆", "냮", "넀"):
            tc.insertText("냬")
            return True
        elif t in ("넵", "넺", "넫", "넥", "넷", "넴", "넨", "넹", "넬", "넿", "넼", "넽", "넻", "넾", "넦", "넸"):
            tc.insertText("네")
            return True
        elif t in ("녭", "녲", "녣", "녝", "녯", "녬", "녠", "녱", "녤", "녷", "녴", "녵", "녳", "녶", "녞", "녰"):
            tc.insertText("녜")
            return True


        elif t in ("압", "앚", "앋", "악", "앗", "암", "안", "앙", "알", "앟", "앜", "앝", "앛", "앞", "앆", "았"):
            tc.insertText("아")
            return True
        elif t in ("업", "엊", "얻", "억", "엇", "엄", "언", "엉", "얼", "엏", "엌", "엍", "엋", "엎", "얶", "었"):
            tc.insertText("어")
            return True       
            
        elif t in ("얍", "얒", "얃", "약", "얏", "얌", "얀", "양", "얄", "얗", "얔", "얕", "얓", "얖", "앾", "얐"):
            tc.insertText("야")
            return True
        elif t in ("엽", "옂", "엳", "역", "엿", "염", "연", "영", "열", "옇", "옄", "옅", "옃", "옆", "엮", "였"):
            tc.insertText("여")
            return True
        elif t in ("웁", "웆", "욷", "욱", "웃", "움", "운", "웅", "울", "웋", "웈", "웉", "웇", "웊", "욲", "웄"):
            tc.insertText("우")
            return True
        elif t in ("윱", "윶", "윧", "육", "윳", "윰", "윤", "융", "율", "윻", "윸", "윹", "윷", "윺", "윢", "윴"):
            tc.insertText("유")
            return True
        elif t in ("옵", "옺", "옫", "옥", "옷", "옴", "온", "옹", "올", "옿", "옼", "옽", "옻", "옾", "옦", "옸"):
            tc.insertText("오")
            return True
        elif t in ("욥", "욪", "욛", "욕", "욧", "욤", "욘", "용", "욜", "욯", "욬", "욭", "욫", "욮", "욖", "욨"):
            tc.insertText("요")
            return True
  
        elif t in ("입", "잊", "읻", "익", "잇", "임", "인", "잉", "일", "잏", "잌", "잍", "잋", "잎", "읶", "있"):
            tc.insertText("이")
            return True

        elif t in ("읍", "읒", "읃", "윽", "읏", "음", "은", "응", "을", "읗", "읔", "읕", "읓", "읖", "윾", "읐"):
            tc.insertText("으")
            return True
        
        elif t in ("앱", "앶", "앧", "액", "앳", "앰", "앤", "앵", "앨", "앻", "앸", "앹", "앷", "앺", "앢", "앴"):
            tc.insertText("애")
            return True
        elif t in ("얩", "얮", "얟", "얙", "얫", "얨", "얜", "얭", "얠", "얳", "얰", "얱", "얯", "얲", "얚", "얬"):
            tc.insertText("얘")
            return True
        elif t in ("엡", "엦", "엗", "엑", "엣", "엠", "엔", "엥", "엘", "엫", "엨", "엩", "엧", "엪", "엒", "엤"):
            tc.insertText("에")
            return True
        elif t in ("옙", "옞", "옏", "옉", "옛", "옘", "옌", "옝", "옐", "옣", "옠", "옡", "옟", "옢", "옊", "옜"):
            tc.insertText("예")
            return True



        elif t in ("랍", "랒", "랃", "락", "랏", "람", "란", "랑", "랄", "랗", "랔", "랕", "랓", "랖", "띾", "랐"):
            tc.insertText("라")
            return True
        elif t in ("럽", "렂", "럳", "럭", "럿", "럼", "런", "렁", "럴", "렇", "렄", "렅", "렃", "렆", "럮", "렀"):
            tc.insertText("러")
            return True       
            
        elif t in ("럅", "럊", "랻", "략", "럇", "럄", "랸", "량", "랼", "럏", "럌", "럍", "럋", "럎", "랶", "럈"):
            tc.insertText("랴")
            return True
        elif t in ("렵", "렺", "렫", "력", "렷", "렴", "련", "령", "렬", "렿", "렼", "렽", "렻", "렾", "렦", "렸"):
            tc.insertText("려")
            return True
        elif t in ("룹", "룾", "룯", "룩", "룻", "룸", "룬", "룽", "룰", "뤃", "뤀", "뤁", "룿", "뤂", "룪", "룼"):
            tc.insertText("루")
            return True
        elif t in ("륩", "륮", "륟", "륙", "륫", "륭", "륜", "륭", "률", "륳", "륰", "륱", "륯", "륲", "륚", "륬"):
            tc.insertText("류")
            return True
        elif t in ("롭", "롲", "롣", "록", "롯", "롬", "론", "롱", "롤", "롷", "롴", "롵", "롳", "롶", "롞", "롰"):
            tc.insertText("로")
            return True
        elif t in ("룝", "룢", "룓", "룍", "룟", "룜", "룐", "룡", "룔", "룧", "룤", "룥", "룣", "룦", "룎", "룠"):
            tc.insertText("료")
            return True
  
        elif t in ("립", "맂", "릳", "릭", "릿", "림", "린", "링", "릴", "맇", "맄", "맅", "맃", "맆", "릮", "맀"):
            tc.insertText("리")
            return True

        elif t in ("릅", "릊", "륻", "륵", "릇", "름", "른", "릉", "를", "릏", "릌", "릍", "릋", "릎", "륶", "릈"):
            tc.insertText("르")
            return True
        
        elif t in ("랩", "랮", "랟", "랙", "랫", "램", "랜", "랭", "랠", "랳", "랰", "랱", "랯", "랲", "랚", "랬"):
            tc.insertText("래")
            return True
        elif t in ("럡", "럦", "럗", "럑", "럣", "럠", "럔", "럥", "럘", "럫", "럨", "럩", "럧", "럪", "럒", "럤"):
            tc.insertText("럐")
            return True
        elif t in ("렙", "렞", "렏", "렉", "렛", "렘", "렌", "렝", "렐", "렣", "렠", "렡", "렟", "렢", "렊", "렜"):
            tc.insertText("레")
            return True
        elif t in ("롑", "롖", "롇", "롁", "롓", "롐", "롄", "롕", "롈", "롛", "롘", "롙", "롗", "롚", "롂", "롔"):
            tc.insertText("례")
            return True


        elif t in ("합", "핮", "핟", "학", "핫", "함", "한", "항", "할", "핳", "핰", "핱", "핯", "핲", "핚", "핬"):
            tc.insertText("하")
            return True
        elif t in ("헙", "헞", "헏", "헉", "헛", "험", "헌", "헝", "헐", "헣", "헠", "헡", "헟", "헢", "헊", "헜"):
            tc.insertText("허")
            return True       
            
        elif t in ("햡", "햦", "햗", "햑", "햣", "햠", "햔", "향", "햘", "햫", "햨", "햩", "햧", "햪", "햒", "햤"):
            tc.insertText("햐")
            return True
        elif t in ("협", "혖", "혇", "혁", "혓", "혐", "현", "형", "혈", "혛", "혘", "혙", "혗", "혚", "혂", "혔"):
            tc.insertText("혀")
            return True
        elif t in ("훕", "훚", "훋", "훅", "훗", "훔", "훈", "훙", "훌", "훟", "훜", "훝", "훛", "훞", "훆", "훘"):
            tc.insertText("루")
            return True
        elif t in ("흅", "흊", "휻", "휵", "흇", "흉", "휸", "흉", "휼", "흏", "흌", "흍", "흋", "흎", "휶", "흈"):
            tc.insertText("휴")
            return True
        elif t in ("홉", "홎", "혿", "혹", "홋", "홈", "혼", "홍", "홀", "홓", "홐", "홑", "홏", "홒", "혺", "홌"):
            tc.insertText("호")
            return True
        elif t in ("횹", "횾", "횯", "횩", "횻", "횸", "횬", "횽", "횰", "훃", "훀", "훁", "횿", "훂", "횪", "횼"):
            tc.insertText("효")
            return True
  
        elif t in ("힙", "힞", "힏", "힉", "힛", "힘", "힌", "힝", "힐", "힣", "힠", "힡", "힟", "힢", "힊", "힜"):
            tc.insertText("히")
            return True

        elif t in ("흡", "흦", "흗", "흑", "흣", "흠", "흔", "흥", "흘", "흫", "흨", "흩", "흧", "흪", "흒", "흤"):
            tc.insertText("흐")
            return True
        
        elif t in ("햅", "햊", "핻", "핵", "햇", "햄", "핸", "행", "핼", "햏", "햌", "햍", "햋", "햎", "핶", "했"):
            tc.insertText("해")
            return True
        elif t in ("햽", "헂", "햳", "햭", "햿", "햼", "햰", "헁", "햴", "헇", "헄", "헅", "헃", "헆", "햮", "헀"):
            tc.insertText("햬")
            return True
        elif t in ("헵", "헺", "헫", "헥", "헷", "헴", "헨", "헹", "헬", "헿", "헼", "헽", "헻", "헾", "헦", "헸"):
            tc.insertText("헤")
            return True
        elif t in ("혭", "혲", "혣", "혝", "혯", "혬", "혠", "혱", "혤", "혷", "혴", "혤", "혳", "혶", "혞", "혰"):
            tc.insertText("혜")
            return True


        elif t in ("캅", "캊", "칻", "칵", "캇", "캄", "칸", "캉", "칼", "캏", "캌", "캍", "캊", "캎", "칶", "캈"):
            tc.insertText("카")
            return True
        elif t in ("컵", "컺", "컫", "컥", "컷", "컴", "컨", "컹", "컬", "컿", "컼", "컽", "컻", "컾", "컦", "컸"):
            tc.insertText("커")
            return True       
            
        elif t in ("캽", "컂", "캳", "캭", "캿", "캼", "캰", "컁", "캴", "컇", "컄", "컅", "컃", "컆", "캮", "컀"):
            tc.insertText("캬")
            return True
        elif t in ("켭", "켲", "켣", "켝", "켯", "켬", "켠", "켱", "켤", "켷", "켴", "켵", "켳", "켶", "켞", "켰"):
            tc.insertText("켜")
            return True
        elif t in ("쿱", "쿶", "쿧", "쿡", "쿳", "쿰", "쿤", "쿵", "쿨", "쿻", "쿸", "쿹", "쿷", "쿺", "쿢", "쿴"):
            tc.insertText("쿠")
            return True
        elif t in ("큡", "큦", "큗", "큑", "큣", "큠", "큔", "큥", "큘", "큫", "큨", "큩", "큧", "큪", "큒", "큤"):
            tc.insertText("큐")
            return True
        elif t in ("콥", "콪", "콛", "콕", "콧", "콤", "콘", "콩", "콜", "콯", "콬", "콭", "콫", "콮", "콖", "콨"):
            tc.insertText("코")
            return True
        elif t in ("쿕", "쿚", "쿋", "쿅", "쿗", "쿔", "쿈", "쿙", "쿌", "쿟", "쿜", "쿝", "쿛", "쿞", "쿆", "쿘"):
            tc.insertText("쿄")
            return True
  
        elif t in ("킵", "킺", "킫", "킥", "킷", "킴", "킨", "킹", "킬", "킿", "킼", "킽", "킻", "킾", "킦", "킸"):
            tc.insertText("키")
            return True

        elif t in ("큽", "킂", "큳", "큭", "큿", "큼", "큰", "킁", "클", "킇", "킄", "킅", "킃", "킆", "큮", "킀"):
            tc.insertText("크")
            return True
        
        elif t in ("캡", "캦", "캗", "캑", "캣", "캠", "캔", "캥", "캘", "캫", "캨", "캩", "캧", "캪", "캒", "캤"):
            tc.insertText("캐")
            return True
        elif t in ("컙", "컞", "컏", "컉", "컛", "컘", "컌", "컝", "컐", "컣", "컠", "컡", "컟", "컢", "컊", "컜"):
            tc.insertText("컈")
            return True
        elif t in ("켑", "켖", "켇", "켁", "켓", "켐", "켄", "켕", "켈", "켛", "켘", "켙", "켗", "켚", "켂", "켔"):
            tc.insertText("케")
            return True
        elif t in ("콉", "콎", "켿", "켹", "콋", "콈", "켼", "콍", "콀", "콓", "콐", "콑", "콏", "콒", "켺", "콌"):
            tc.insertText("케")
            return True
        
        elif t in ("탑", "탖", "탇", "탁", "탓", "탐", "탄", "탕", "탈", "탛", "탘", "탙", "탖", "탚", "탂", "탔"):
            tc.insertText("타")
            return True
        elif t in ("텁", "텆", "턷", "턱", "텃", "텀", "턴", "텅", "털", "텋", "텈", "텉", "텇", "텊", "턲", "텄"):
            tc.insertText("터")
            return True       
            
        elif t in ("턉", "턎", "탿", "탹", "턋", "턈", "탼", "턍", "턀", "턓", "턐", "턑", "턏", "턒", "탺", "턌"):
            tc.insertText("탸")
            return True
        elif t in ("켭", "켲", "켣", "켝", "켯", "켬", "켠", "켱", "켤", "켷", "켴", "켵", "켳", "켶", "켞", "켰"):
            tc.insertText("텨")
            return True
        elif t in ("툽", "퉂", "툳", "툭", "툿", "툼", "툰", "퉁", "툴", "퉇", "퉄", "퉅", "퉃", "퉆", "툮", "퉀"):
            tc.insertText("투")
            return True
        elif t in ("튭", "튲", "튣", "튝", "튯", "튬", "튠", "튱", "튤", "튷", "퉄", "튵", "튳", "튶", "튞", "튰"):
            tc.insertText("튜")
            return True
        elif t in ("톱", "톶", "톧", "톡", "톳", "톰", "톤", "통", "톨", "톻", "톸", "톹", "톷", "톺", "톢", "톴"):
            tc.insertText("토")
            return True
        elif t in ("툡", "툦", "툗", "툑", "툣", "툠", "툔", "툥", "툘", "툫", "툨", "툩", "툧", "툪", "툒", "툤"):
            tc.insertText("툐")
            return True
  
        elif t in ("팁", "팆", "틷", "틱", "팃", "팀", "틴", "팅", "틸", "팋", "팈", "팉", "팇", "팊", "틲", "팄"):
            tc.insertText("티")
            return True

        elif t in ("틉", "틎", "튿", "특", "틋", "틈", "튼", "틍", "틀", "틓", "틐", "틑", "틏", "틒", "튺", "틌"):
            tc.insertText("트")
            return True
        
        elif t in ("탭", "탲", "태", "택", "탯", "탬", "탠", "탱", "탤", "탷", "탴", "탵", "탳", "탶", "탞", "탰"):
            tc.insertText("태")
            return True
        elif t in ("턥", "턪", "턛", "턕", "턧", "턤", "턘", "턩", "턜", "턯", "턬", "턭", "턫", "턮", "턖", "턨"):
            tc.insertText("턔")
            return True
        elif t in ("텝", "텢", "텓", "텍", "텟", "템", "텐", "텡", "텔", "텧", "텤", "텥", "텣", "텦", "텎", "텠"):
            tc.insertText("테")
            return True
        elif t in ("톕", "톚", "톋", "톅", "톗", "톔", "톈", "톙", "톌", "톟", "톜", "톝", "톛", "톞", "톆", "톘"):
            tc.insertText("톄")
            return True

        elif t in ("찹", "찾", "찯", "착", "찻", "참", "찬", "창", "찰", "챃", "챀", "챁", "찿", "챺", "찪", "찼"):
            tc.insertText("차")
            return True
        elif t in ("첩", "첮", "첟", "척", "첫", "첨", "천", "청", "철", "첳", "첰", "첱", "첯", "첲", "첚", "첬"):
            tc.insertText("처")
            return True       
            
        elif t in ("챱", "챶", "챧", "챡", "챳", "챰", "챤", "챵", "챨", "챻", "챸", "챹", "챷", "챺", "챢", "챴"):
            tc.insertText("챠")
            return True
        elif t in ("쳡", "쳦", "쳗", "쳑", "쳣", "쳠", "쳔", "쳥", "쳘", "쳫", "쳨", "쳩", "쳧", "쳪", "쳒", "쳤"):
            tc.insertText("쳐")
            return True
        elif t in ("춥", "춪", "춛", "축", "춧", "춤", "춘", "충", "출", "춯", "춬", "춭", "춫", "춮", "춖", "춨"):
            tc.insertText("추")
            return True
        elif t in ("츕", "츚", "츋", "츅", "츗", "츔", "츈", "츙", "츌", "츟", "츜", "츝", "츛", "츞", "츆", "츘"):
            tc.insertText("츄")
            return True
        elif t in ("촙", "촞", "촏", "촉", "촛", "촘", "촌", "총", "촐", "촣", "촠", "촡", "촟", "촢", "촊", "촜"):
            tc.insertText("토")
            return True
        elif t in ("춉", "춎", "쵿", "쵹", "춋", "춈", "쵼", "춍", "춀", "춓", "춐", "춑", "춏", "춒", "쵺", "춌"):
            tc.insertText("툐")
            return True
  
        elif t in ("칩", "칮", "칟", "칙", "칫", "침", "친", "칭", "칠", "칳", "칰", "칱", "칯", "칲", "칚", "칬"):
            tc.insertText("치")
            return True

        elif t in ("츱", "츶", "츧", "측", "츳", "츰", "츤", "층", "츨", "츻", "츸", "츹", "츷", "츺", "츢", "츴"):
            tc.insertText("츠")
            return True
        
        elif t in ("챕", "챚", "챋", "책", "챗", "챔", "챈", "챙", "챌", "챟", "챜", "챝", "챛", "챞", "챆", "챘"):
            tc.insertText("채")
            return True
        elif t in ("첍", "첒", "첃", "챽", "첏", "첌", "첀", "첑", "첄", "첗", "첔", "첕", "첓", "첖", "챾", "첐"):
            tc.insertText("챼")
            return True
        elif t in ("쳅", "쳊", "첻", "첵", "쳇", "쳄", "첸", "쳉", "첼", "쳏", "쳌", "쳍", "쳋", "쳎", "첶", "쳈"):
            tc.insertText("체")
            return True
        elif t in ("쳽", "촂", "쳳", "첵", "쳿", "쳼", "쳰", "촁", "쳴", "촇", "촄", "촅", "촃", "촆", "쳮", "촀"):
            tc.insertText("쳬")
            return True

        elif t in ("팝", "팢", "팓", "팍", "팟", "팜", "판", "팡", "팔", "팧", "팤", "팥", "팣", "팦", "팎", "팠"):
            tc.insertText("파")
            return True
        elif t in ("펍", "펒", "펃", "퍽", "펏", "펌", "펀", "펑", "펄", "펗", "펔", "펕", "펓", "펖", "퍾", "펐"):
            tc.insertText("퍼")
            return True       
            
        elif t in ("퍕", "퍚", "퍋", "퍅", "퍗", "퍔", "퍈", "퍙", "퍌", "퍟", "퍜", "퍝", "퍛", "퍞", "퍆", "퍘"):
            tc.insertText("퍄")
            return True
        elif t in ("폅", "폊", "펻", "펵", "폇", "폄", "편", "평", "펼", "폏", "폌", "폍", "폋", "폎", "펶", "폈"):
            tc.insertText("펴")
            return True
        elif t in ("풉", "풎", "푿", "푹", "풋", "품", "푼", "풍", "풀", "풓", "풐", "풑", "풏", "풒", "푺", "풌"):
            tc.insertText("푸")
            return True
        elif t in ("퓹", "퓾", "퓯", "퓩", "퓻", "퓸", "퓬", "퓽", "퓰", "픃", "픀", "픁", "퓿", "픂", "퓪", "퓼"):
            tc.insertText("퓨")
            return True
        elif t in ("폽", "퐂", "폳", "폭", "폿", "폼", "폰", "퐁", "폴", "퐇", "퐄", "퐅", "퐃", "퐆", "폮", "퐀"):
            tc.insertText("포")
            return True
        elif t in ("푭", "푲", "푣", "푝", "푯", "푬", "푠", "푱", "푤", "푷", "푴", "푵", "푳", "푶", "푞", "푰"):
            tc.insertText("표")
            return True
  
        elif t in ("핍", "핒", "핃", "픽", "핏", "핌", "핀", "핑", "필", "핗", "핔", "핕", "핓", "핖", "픾", "핐"):
            tc.insertText("피")
            return True

        elif t in ("픕", "픚", "픋", "픅", "픗", "픔", "픈", "픙", "플", "픟", "픜", "픝", "픛", "픞", "픆", "픘"):
            tc.insertText("프")
            return True
        
        elif t in ("팹", "팾", "팯", "팩", "팻", "팸", "팬", "팽", "팰", "퍃", "퍀", "퍁", "팿", "퍂", "팪", "팼"):
            tc.insertText("패")
            return True
        elif t in ("퍱", "퍶", "퍧", "퍡", "퍳", "퍰", "퍤", "퍵", "퍨", "퍻", "퍸", "퍹", "퍷", "퍺", "퍢", "퍴"):
            tc.insertText("퍠")
            return True
        elif t in ("펩", "펮", "펟", "펙", "펫", "펨", "펜", "펭", "펠", "펳", "펰", "펱", "펯", "펲", "펚", "펬"):
            tc.insertText("페")
            return True
        elif t in ("폡", "폦", "폗", "폑", "폣", "폠", "폔", "폥", "폘", "폫", "폨", "폩", "폧", "폪", "폒", "폤"):
            tc.insertText("폐")
            return True
        

        elif t in ("빱", "빶", "빧", "빡", "빳", "빰", "빤", "빵", "빨", "빻", "빸", "빹", "빶", "빺", "빢", "빴"):
            tc.insertText("빠")
            return True
        elif t in ("뻡", "뻦", "뻗", "뻑", "뻣", "뻠", "뻔", "뻥", "뻘", "뻫", "뻨", "뻩", "뻧", "뻪", "뻒", "뻤"):
            tc.insertText("뻐")
            return True       
            
        elif t in ("뺩", "뺮", "뺟", "뺙", "뺫", "뺨", "뺜", "뺭", "뺠", "뺳", "뺰", "뺱", "뺮", "뺲", "뺚", "뺬"):
            tc.insertText("뺘")
            return True
        elif t in ("뼙", "뼞", "뼏", "뼉", "뼛", "뼘", "뼌", "뼝", "뼐", "뼣", "뼠", "뼡", "뼟", "뼢", "뼊", "뼜"):
            tc.insertText("뼈")
            return True
        elif t in ("뿝", "뿢", "뿓", "뿍", "뿟", "뿜", "뿐", "뿡", "뿔", "뿧", "뿤", "뿥", "뿣", "뿦", "뿎", "뿠"):
            tc.insertText("뿌")
            return True
        elif t in ("쁍", "쁒", "쁀", "쀽", "쁏", "쁌", "쁀", "쁑", "쁄", "쁗", "쁔", "쁕", "쁓", "쁖", "쀾", "쁐"):
            tc.insertText("쀼")
            return True
        elif t in ("뽑", "뽖", "뽇", "뽁", "뽓", "뽐", "뽄", "뽕", "뽈", "뽛", "뽘", "뽙", "뽗", "뽚", "뽂", "뽔"):
            tc.insertText("뽀")
            return True
        elif t in ("뿁", "뿆", "뾷", "뾱", "뿃", "뿀", "뾴", "뿅", "뾸", "뿋", "뿈", "뿉", "뿇", "뿊", "뾲", "뿄"):
            tc.insertText("뾰")
            return True
  
        elif t in ("삡", "삦", "삗", "삑", "삣", "삠", "삔", "삥", "삘", "삫", "삨", "삩", "삧", "삪", "삒", "삤"):
            tc.insertText("삐")
            return True

        elif t in ("쁩", "쁮", "쁟", "쁙", "쁫", "쁨", "쁜", "쁭", "쁠", "쁳", "쁰", "쁱", "쁯", "쁲", "쁚", "쁬"):
            tc.insertText("쁘")
            return True
        
        elif t in ("뺍", "뺒", "뺃", "빽", "뺏", "뺌", "뺀", "뺑", "뺄", "뺗", "뺔", "뺕", "뺓", "뺖", "빾", "뺐"):
            tc.insertText("빼")
            return True
        elif t in ("뻅", "뻊", "뺻", "뺵", "뻇", "뻄", "뺸", "뻉", "뺼", "뻏", "뻌", "뻍", "뻋", "뻎", "뺶", "뻈"):
            tc.insertText("뺴")
            return True
        elif t in ("뻽", "뼂", "뻳", "뻭", "뻿", "뻼", "뻰", "뼁", "뻴", "뼇", "뼄", "뼅", "뼃", "뼆", "뻮", "뼀"):
            tc.insertText("뻬")
            return True
        elif t in ("뼵", "뼺", "뼫", "뼥", "뼷", "뼴", "뼨", "뼹", "뼬", "뼿", "뼼", "뼽", "뼻", "뼾", "뼦", "뼸"):
            tc.insertText("뼤")
            return True
        
        
        
        elif t in ("짭", "짲", "짣", "짝", "짯", "짬", "짠", "짱", "짤", "짷", "짴", "짵", "짳", "짶", "짞", "짰"):
            tc.insertText("짜")
            return True
        elif t in ("쩝", "쩢", "쩓", "쩍", "쩟", "쩜", "쩐", "쩡", "쩔", "쩧", "쩤", "쩥", "쩣", "쩦", "쩎", "쩠"):
            tc.insertText("쩌")
            return True       
            
        elif t in ("쨥", "쨪", "쨛", "쨕", "쨧", "쨤", "쨘", "쨩", "쨜", "쨯", "쨬", "쨭", "쨫", "쨮", "쨖", "쨨"):
            tc.insertText("쨔")
            return True
        elif t in ("쪕", "쪚", "쪋", "쪅", "쪗", "쪔", "쪈", "쪙", "쪌", "쪟", "쪜", "쪝", "쪛", "쪞", "쪆", "쪘"):
            tc.insertText("쪄")
            return True
        elif t in ("쭙", "쭞", "쭏", "쭉", "쭛", "쭘", "쭌", "쭝", "쭐", "쭣", "쭠", "쭡", "쭟", "쭢", "쭊", "쭜"):
            tc.insertText("쭈")
            return True
        elif t in ("쯉", "쯎", "쮼", "쮹", "쯋", "쯈", "쮼", "쯍", "쯀", "쯓", "쯐", "쯑", "쯏", "쯒", "쮺", "쯌"):
            tc.insertText("쀼")
            return True
        elif t in ("쫍", "쫒", "쫀", "쪽", "쫏", "쫌", "쫀", "쫑", "쫄", "쫗", "쫔", "쫕", "쫓", "쫖", "쪾", "쫐"):
            tc.insertText("쪼")
            return True
        elif t in ("쬽", "쭂", "쬳", "쬭", "쬿", "쬼", "쬰", "쭁", "쬴", "쭇", "쭄", "쭅", "쭃", "쭆", "쬮", "쭀"):
            tc.insertText("쬬")
            return True
  
        elif t in ("찝", "찢", "찓", "찍", "찟", "찜", "찐", "찡", "찔", "찧", "찤", "찥", "찣", "찦", "찎", "찠"):
            tc.insertText("찌")
            return True

        elif t in ("쯥", "쯪", "쯛", "쯕", "쯧", "쯤", "쯘", "쯩", "쯜", "쯯", "쯬", "쯭", "쯫", "쯮", "쯖", "쯨"):
            tc.insertText("쯔")
            return True
        
        elif t in ("쨉", "쨎", "짿", "짹", "쨋", "쨈", "짼", "쨍", "쨀", "쨓", "쨐", "쨑", "쨏", "쨒", "짺", "쨌"):
            tc.insertText("째")
            return True
        elif t in ("쩁", "쩆", "쨷", "쨱", "쩃", "쩀", "쨴", "쩅", "쨸", "쩋", "쩈", "쩉", "쩇", "쩊", "쨲", "쩄"):
            tc.insertText("쨰")
            return True
        elif t in ("쩹", "쩾", "쩯", "쩩", "쩻", "쩸", "쩬", "쩽", "쩰", "쪃", "쪀", "쩰", "쩿", "쪂", "쩪", "쩼"):
            tc.insertText("쩨")
            return True
        elif t in ("쪱", "쪶", "쪧", "쪡", "쪳", "쪰", "쪤", "쪵", "쪨", "쪻", "쪸", "쪹", "쪷", "쪺", "쪢", "쪴"):
            tc.insertText("쪠")
            return True


        elif t in ("땁", "땆", "딷", "딱", "땃", "땀", "딴", "땅", "딸", "땋", "땈", "땉", "땇", "땊", "딲", "땄"):
            tc.insertText("따")
            return True
        elif t in ("떱", "떶", "떧", "떡", "떳", "떰", "떤", "떵", "떨", "떻", "떸", "떹", "떷", "떺", "떢", "떴"):
            tc.insertText("떠")
            return True       
            
        elif t in ("땹", "땾", "땯", "땩", "땻", "땸", "땬", "땽", "땰", "떃", "떀", "떁", "땿", "떂", "땪", "땼"):
            tc.insertText("땨")
            return True
        elif t in ("뗩", "뗮", "뗟", "뗙", "뗫", "뗨", "뗜", "뗭", "뗠", "뗳", "뗰", "뗱", "뗯", "뗲", "뗚", "뗬"):
            tc.insertText("뗘")
            return True
        elif t in ("뚭", "뚲", "뚣", "뚝", "뚯", "뚬", "뚠", "뚱", "뚤", "뚷", "뚴", "뚵", "뚳", "뚶", "뚞", "뚰"):
            tc.insertText("뚜")
            return True
        elif t in ("뜝", "뜢", "뜐", "뜍", "뜟", "뜜", "뜐", "뜡", "뜔", "뜧", "뜤", "뜥", "뜣", "뜦", "뜎", "뜠"):
            tc.insertText("뜌")
            return True
        elif t in ("똡", "똦", "똔", "똑", "똣", "똠", "똔", "똥", "똘", "똫", "똨", "똩", "똧", "똪", "똒", "똤"):
            tc.insertText("또")
            return True
        elif t in ("뚑", "뚖", "뚇", "뚁", "뚓", "뚐", "뚄", "뚕", "뚈", "뚛", "뚘", "뚙", "뚗", "뚚", "뚂", "뚔"):
            tc.insertText("뚀")
            return True
  
        elif t in ("띱", "띶", "띧", "띡", "띳", "띰", "띤", "띵", "띨", "띻", "띸", "띹", "띷", "띺", "띢", "띴"):
            tc.insertText("띠")
            return True

        elif t in ("뜹", "뜾", "뜯", "뜩", "뜻", "뜸", "뜬", "뜽", "뜰", "띃", "띀", "띁", "뜿", "띂", "뜪", "뜼"):
            tc.insertText("뜨")
            return True
        
        elif t in ("땝", "땢", "땓", "땍", "땟", "땜", "땐", "땡", "땔", "땧", "땤", "땥", "땣", "땦", "땎", "땠"):
            tc.insertText("때")
            return True
        elif t in ("떕", "떚", "떋", "떅", "떗", "떔", "떈", "떙", "떌", "떟", "떜", "떝", "떛", "떞", "떆", "떘"):
            tc.insertText("떄")
            return True
        elif t in ("뗍", "뗒", "뗃", "떽", "뗏", "뗌", "뗀", "뗑", "뗄", "뗗", "뗔", "뗕", "뗓", "뗖", "떾", "뗐"):
            tc.insertText("떼")
            return True
        elif t in ("똅", "똊", "뗻", "뗵", "똇", "똄", "뗸", "똉", "뗼", "똏", "똌", "똍", "똋", "똎", "뗶", "똈"):
            tc.insertText("뗴")
            return True


        elif t in ("깝", "깢", "깓", "깍", "깟", "깜", "깐", "깡", "깔", "깧", "깤", "깥", "깣", "깦", "깎", "깠"):
            tc.insertText("까")
            return True
        elif t in ("껍", "껒", "껃", "꺽", "껏", "껌", "껀", "껑", "껄", "껗", "껔", "껕", "껓", "껖", "꺾", "껐"):
            tc.insertText("꺼")
            return True       
            
        elif t in ("꺕", "꺚", "꺋", "꺅", "꺗", "꺔", "꺈", "꺙", "꺌", "꺟", "꺜", "꺝", "꺛", "꺞", "꺆", "꺘"):
            tc.insertText("꺄")
            return True
        elif t in ("꼅", "꼊", "껻", "껵", "꼇", "꼄", "껸", "꼉", "껼", "꼏", "꼌", "꼍", "꼋", "꼎", "껶", "꼈"):
            tc.insertText("껴")
            return True
        elif t in ("꿉", "꿎", "꾿", "꾹", "꿋", "꿈", "꾼", "꿍", "꿀", "꿓", "꿐", "꿑", "꿏", "꿒", "꾺", "꿌"):
            tc.insertText("꾸")
            return True
        elif t in ("뀹", "뀾", "뀯", "뀩", "뀻", "뀸", "뀬", "뀽", "뀰", "끃", "끀", "끁", "뀿", "끂", "뀪", "뀼"):
            tc.insertText("뀨")
            return True
        elif t in ("꼽", "꽂", "꼳", "꼭", "꼿", "꼼", "꼰", "꽁", "꼴", "꽇", "꽄", "꽅", "꽃", "꽆", "꼮", "꽀"):
            tc.insertText("꼬")
            return True
        elif t in ("꾭", "꾲", "꾣", "꾝", "꾯", "꾬", "꾠", "꾱", "꾤", "꾷", "꾴", "꾵", "꾳", "꾶", "꾞", "꾰"):
            tc.insertText("꾜")
            return True
  
        elif t in ("낍", "낒", "낃", "끽", "낏", "낌", "낀", "낑", "낄", "낗", "낔", "낕", "낓", "낖", "끾", "낐"):
            tc.insertText("끼")
            return True

        elif t in ("끕", "끚", "끈", "끅", "끗", "끔", "끈", "끙", "끌", "끟", "끜", "끝", "끛", "끞", "끆", "끘"):
            tc.insertText("끄")
            return True
        
        elif t in ("깹", "깾", "깯", "깩", "깻", "깸", "깬", "깽", "깰", "꺃", "꺀", "꺁", "깿", "꺂", "깪", "깼"):
            tc.insertText("깨")
            return True
        elif t in ("꺱", "꺶", "꺧", "꺡", "꺳", "꺰", "꺤", "꺵", "꺨", "꺻", "꺸", "꺹", "꺷", "꺺", "꺢", "꺴"):
            tc.insertText("꺠")
            return True
        elif t in ("껩", "껮", "껟", "껙", "껫", "껨", "껜", "껭", "껠", "껳", "껰", "껱", "껯", "껲", "껚", "껬"):
            tc.insertText("께")
            return True
        elif t in ("꼡", "꼦", "꼗", "꼑", "꼣", "꼠", "꼔", "꼥", "꼘", "꼫", "꼨", "꼩", "꼧", "꼪", "꼒", "꼤"):
            tc.insertText("꼐")
            return True

        elif t in ("쌉", "쌎", "싿", "싹", "쌋", "쌈", "싼", "쌍", "쌀", "쌓", "쌐", "쌑", "쌏", "쌒", "싺", "쌌"):
            tc.insertText("싸")
            return True
        elif t in ("썹", "썾", "썯", "썩", "썻", "썸", "썬", "썽", "썰", "쎃", "쎀", "쎁", "썿", "쎂", "썪", "썼"):
            tc.insertText("꺼")
            return True       
            
        elif t in ("썁", "썆", "쌷", "쌱", "썃", "썀", "쌴", "썅", "쌸", "썋", "썈", "썉", "썇", "썊", "쌲", "썄"):
            tc.insertText("쌰")
            return True
        elif t in ("쎱", "쎶", "쎧", "쎡", "쎳", "쎰", "쎤", "쎵", "쎨", "쎻", "쎸", "쎹", "쎷", "쎺", "쎢", "쎴"):
            tc.insertText("쎠")
            return True
        elif t in ("쑵", "쑺", "쑫", "쑥", "쑷", "쑴", "쑨", "쑹", "쑬", "쑿", "쑼", "쑽", "쑻", "쑾", "쑦", "쑸"):
            tc.insertText("꾸")
            return True
        elif t in ("쓥", "쓪", "쓛", "쓕", "쓧", "쓤", "쓘", "쓩", "쓜", "쓯", "쓬", "쓭", "쓫", "쓮", "쓖", "쓨"):
            tc.insertText("쓔")
            return True
        elif t in ("쏩", "쏮", "쏟", "쏙", "쏫", "쏨", "쏜", "쏭", "쏠", "쏳", "쏰", "쏱", "쏯", "쏲", "쏚", "쏬"):
            tc.insertText("쏘")
            return True
        elif t in ("쑙", "쑞", "쑏", "쑉", "쑛", "쑘", "쑌", "쑝", "쑐", "쑣", "쑠", "쑡", "쑟", "쑢", "쑊", "쑜"):
            tc.insertText("쑈")
            return True
  
        elif t in ("씹", "씾", "씯", "씩", "씻", "씸", "씬", "씽", "씰", "앃", "앀", "앁", "씿", "앂", "씪", "씼"):
            tc.insertText("씨")
            return True

        elif t in ("씁", "씆", "쓴", "쓱", "씃", "씀", "쓴", "씅", "쓸", "씋", "씈", "씉", "씇", "씊", "쓲", "씄"):
            tc.insertText("쓰")
            return True
        
        elif t in ("쌥", "쌪", "쌛", "쌕", "쌧", "쌤", "쌘", "쌩", "쌜", "쌯", "쌬", "쌭", "쌫", "쌮", "쌖", "쌨"):
            tc.insertText("쌔")
            return True
        elif t in ("썝", "썢", "썓", "썍", "썟", "썜", "썐", "썡", "썔", "썧", "썤", "썥", "썣", "썦", "썎", "썠"):
            tc.insertText("썌")
            return True
        elif t in ("쎕", "쎚", "쎋", "쎅", "쎗", "쎔", "쎈", "쎙", "쎌", "쎟", "쎜", "쎝", "쎛", "쎞", "쎆", "쎘"):
            tc.insertText("쎄")
            return True
        elif t in ("쏍", "쏒", "쏃", "쎽", "쏏", "쏌", "쏀", "쏑", "쏄", "쏗", "쏔", "쏕", "쏓", "쏖", "쎾", "쏐"):
            tc.insertText("쎼")
            return True


        elif t in ("봡", "봦", "봗", "봑", "봣", "봠", "봔", "봥", "봘", "봫", "봨", "봩", "봧", "봪", "봒", "봤"):
            tc.insertText("봐")
            return True
        elif t in ("좝", "좢", "좓", "좍", "좟", "좜", "좐", "좡", "좔", "좧", "좤", "좥", "좣", "좦", "좎", "좠"):
            tc.insertText("좌")
            return True

        elif t in ("돱", "돶", "돧", "돡", "돳", "돰", "돤", "돵", "돨", "돻", "돸", "돹", "돷", "돺", "돢", "돴"):
            tc.insertText("돠")
            return True
        elif t in ("괍", "괒", "괃", "곽", "괏", "괌", "관", "광", "괄", "괗", "괔", "괕", "괓", "괖", "곾", "괐"):
            tc.insertText("과")
            return True
        elif t in ("솹", "솾", "솯", "솩", "솻", "솸", "솬", "솽", "솰", "쇃", "쇀", "쇁", "솿", "쇂", "솪", "솼"):
            tc.insertText("솨")
            return True
        elif t in ("뫕", "뫚", "뫋", "뫅", "뫗", "뫔", "뫈", "뫙", "뫌", "뫟", "뫜", "뫝", "뫛", "뫞", "뫆", "뫘"):
            tc.insertText("뫄")
            return True
        elif t in ("놥", "놪", "놛", "놕", "놧", "놤", "놘", "놩", "놜", "놯", "놬", "놭", "놫", "놮", "놖", "놨"):
            tc.insertText("놔")
            return True
        elif t in ("왑", "왖", "왇", "왁", "왓", "왐", "완", "왕", "왈", "왛", "왘", "왙", "왗", "왚", "왂", "왔"):
            tc.insertText("와")
            return True
        
        elif t in ("뢉", "뢎", "롿", "롹", "뢋", "뢈", "롼", "뢍", "뢀", "뢓", "뢐", "뢑", "뢏", "뢒", "롺", "뢌"):
            tc.insertText("롸")
            return True
        
        elif t in ("홥", "홪", "홛", "확", "홧", "홤", "환", "황", "활", "홯", "홬", "홭", "홫", "홮", "홖", "홨"):
            tc.insertText("화")
            return True
        
        elif t in ("쾁", "쾆", "콷", "콱", "쾃", "쾀", "콴", "쾅", "콸", "쾋", "쾈", "쾉", "쾇", "쾊", "콲", "쾄"):
            tc.insertText("콰")
            return True
        elif t in ("퇍", "퇒", "퇃", "톽", "퇏", "퇌", "퇀", "퇑", "퇄", "퇗", "퇔", "퇕", "퇓", "퇖", "톾", "퇐"):
            tc.insertText("톼")
            return True
        elif t in ("촵", "촺", "촫", "촥", "촷", "촴", "촨", "촹", "촬", "촿", "촼", "촽", "촻", "촾", "촦", "촸"):
            tc.insertText("촤")
            return True
        elif t in ("퐙", "퐞", "퐏", "퐉", "퐛", "퐘", "퐌", "퐝", "퐐", "퐣", "퐠", "퐐", "퐟", "퐢", "퐊", "퐜"):
            tc.insertText("퐈")
            return True

        elif t in ("뽭", "뽲", "뽣", "뽝", "뽯", "뽬", "뽠", "뽱", "뽤", "뽷", "뽴", "뽵", "뽳", "뽶", "뽞", "뽰"):
            tc.insertText("뽜")
            return True
        elif t in ("쫩", "쫮", "쫟", "쫙", "쫫", "쫨", "쫜", "쫭", "쫠", "쫳", "쫰", "쫱", "쫯", "쫲", "쫚", "쫬"):
            tc.insertText("쫘")
            return True

        elif t in ("똽", "뙂", "똳", "똭", "똿", "똼", "똰", "뙁", "똴", "뙇", "뙄", "뙅", "뙃", "뙆", "똮", "뙀"):
            tc.insertText("똬")
            return True
        
        elif t in ("꽙", "꽞", "꽏", "꽉", "꽛", "꽘", "꽌", "꽝", "꽐", "꽣", "꽠", "꽡", "꽟", "꽢", "꽊", "꽜"):
            tc.insertText("꽈")
            return True

        elif t in ("쐅", "쐊", "쏻", "쏵", "쐇", "쐄", "쏸", "쐉", "쏼", "쐏", "쐌", "쐍", "쐋", "쐎", "쏶", "쐈"):
            tc.insertText("쏴")
            return True


        elif t in ("봽", "뵂", "봳", "봭", "봿", "봼", "봰", "뵁", "봴", "뵇", "뵄", "뵅", "뵃", "뵆", "봮", "뵀"):
            tc.insertText("봬")
            return True
        elif t in ("좹", "좾", "좯", "좩", "좻", "좸", "좬", "좽", "좰", "죃", "죀", "죁", "좿", "죂", "좪", "좼"):
            tc.insertText("좨")
            return True

        elif t in ("됍", "됒", "됃", "돽", "됏", "됌", "됀", "됑", "됄", "됗", "됔", "됕", "됓", "됖", "돾", "됐"):
            tc.insertText("돼")
            return True
        elif t in ("괩", "괮", "괟", "괙", "괫", "괨", "괜", "괭", "괠", "괳", "괰", "괱", "괯", "괲", "괚", "괬"):
            tc.insertText("괘")
            return True
        elif t in ("쇕", "쇚", "쇋", "쇅", "쇗", "쇔", "쇈", "쇙", "쇌", "쇟", "쇜", "쇝", "쇛", "쇞", "쇆", "쇘"):
            tc.insertText("쇄")
            return True
        elif t in ("뫱", "뫶", "뫧", "뫡", "뫳", "뫰", "뫤", "뫵", "뫨", "뫻", "뫸", "뫹", "뫷", "뫺", "뫢", "뫴"):
            tc.insertText("뫠")
            return True
        elif t in ("뇁", "뇆", "놷", "놱", "뇃", "뇀", "놴", "뇅", "놸", "뇋", "뇈", "뇉", "뇇", "뇊", "놲", "뇄"):
            tc.insertText("놰")
            return True
        elif t in ("왭", "왲", "왣", "왝", "왯", "왬", "왠", "왱", "왤", "왷", "왴", "왵", "왳", "왶", "왞", "왰"):
            tc.insertText("왜")
            return True
        
        elif t in ("뢥", "뢪", "뢛", "뢕", "뢧", "뢤", "뢘", "뢩", "뢜", "뢯", "뢬", "뢭", "뢫", "뢮", "뢖", "뢨"):
            tc.insertText("뢔")
            return True
        
        elif t in ("횁", "횆", "홷", "홱", "횃", "횀", "홴", "횅", "홸", "횋", "횈", "횉", "횇", "횊", "홲", "횄"):
            tc.insertText("홰")
            return True
        
        elif t in ("쾝", "쾢", "쾓", "쾍", "쾟", "쾜", "쾐", "쾡", "쾔", "쾧", "쾤", "쾥", "쾣", "쾦", "쾎", "쾠"):
            tc.insertText("쾌")
            return True
        elif t in ("퇩", "퇮", "퇟", "퇙", "퇫", "퇨", "퇜", "퇭", "퇠", "퇳", "퇰", "퇱", "퇯", "퇲", "퇚", "퇬"):
            tc.insertText("퇘")
            return True
        elif t in ("쵑", "쵖", "쵇", "쵁", "쵓", "쵐", "쵄", "쵕", "쵈", "쵛", "쵘", "쵙", "쵗", "쵚", "쵂", "쵔"):
            tc.insertText("쵀")
            return True
        elif t in ("퐵", "퐺", "퐫", "퐥", "퐷", "퐴", "퐨", "퐹", "퐬", "퐿", "퐼", "쾥", "퐻", "퐾", "퐦", "퐸"):
            tc.insertText("퐈")
            return True

        elif t in ("뾉", "뾎", "뽿", "뽹", "뾋", "뾈", "뽼", "뾍", "뾀", "뾓", "뾐", "뾑", "뾏", "뾒", "뽺", "뾌"):
            tc.insertText("뽸")
            return True
        elif t in ("쬅", "쬊", "쫻", "쫵", "쬇", "쬄", "쫸", "쬉", "쫼", "쬏", "쬌", "쬍", "쬋", "쬎", "쫶", "쬈"):
            tc.insertText("쫴")
            return True

        elif t in ("뙙", "뙞", "뙏", "뙉", "뙛", "뙘", "뙌", "뙝", "뙐", "뙣", "뙠", "뙡", "뙟", "뙢", "뙊", "뙜"):
            tc.insertText("뙈")
            return True
        
        elif t in ("꽵", "꽺", "꽫", "꽥", "꽷", "꽴", "꽨", "꽹", "꽬", "꽿", "꽼", "꽽", "꽻", "꽾", "꽦", "꽸"):
            tc.insertText("꽤")
            return True

        elif t in ("쐡", "쐦", "쐗", "쐑", "쐣", "쐠", "쐔", "쐥", "쐘", "쐫", "쐨", "쐩", "쐧", "쐪", "쐒", "쐤"):
            tc.insertText("쐐")
            return True


        elif t in ("뵙", "뵞", "뵏", "뵉", "뵛", "뵘", "뵌", "뵝", "뵐", "뵣", "뵠", "뵡", "뵟", "뵢", "뵊", "뵜"):
            tc.insertText("뵈")
            return True
        elif t in ("죕", "죚", "죋", "죅", "죗", "죔", "죈", "죙", "죌", "죟", "죜", "죝", "죛", "죞", "죆", "죘"):
            tc.insertText("죄")
            return True

        elif t in ("됩", "됮", "됟", "됙", "됫", "됨", "된", "됭", "될", "됳", "됰", "됱", "됯", "됲", "됚", "됬"):
            tc.insertText("되")
            return True
        elif t in ("굅", "굊", "괻", "괵", "굇", "굄", "괸", "굉", "괼", "굏", "굌", "굍", "굋", "굎", "괶", "굈"):
            tc.insertText("괘")
            return True
        elif t in ("쇱", "쇶", "쇧", "쇡", "쇳", "쇰", "쇤", "쇵", "쇨", "쇻", "쇸", "쇹", "쇷", "쇺", "쇢", "쇴"):
            tc.insertText("쇠")
            return True
        elif t in ("묍", "묒", "묃", "뫽", "묏", "묌", "묀", "묑", "묄", "묗", "묔", "묕", "묓", "묖", "뫾", "묐"):
            tc.insertText("뫼")
            return True
        elif t in ("뇝", "뇢", "뇓", "뇍", "뇟", "뇜", "뇐", "뇡", "뇔", "뇧", "뇤", "뇥", "뇣", "뇦", "뇎", "뇠"):
            tc.insertText("뇌")
            return True
        elif t in ("욉", "욎", "왿", "왹", "욋", "욈", "왼", "욍", "욀", "욓", "욐", "욑", "욏", "욒", "왺", "욌"):
            tc.insertText("외")
            return True
        
        elif t in ("룁", "룆", "뢷", "뢱", "룃", "룀", "뢴", "룅", "뢸", "룋", "룈", "룉", "룇", "룊", "뢲", "룄"):
            tc.insertText("뢰")
            return True
        
        elif t in ("횝", "횢", "횓", "획", "횟", "횜", "횐", "횡", "횔", "횧", "횤", "횥", "횣", "횦", "횎", "횠"):
            tc.insertText("회")
            return True
        
        elif t in ("쾹", "쾾", "쾯", "쾩", "쾻", "쾸", "쾬", "쾽", "쾰", "쿃", "쿀", "쿁", "쾿", "쿂", "쾪", "쾼"):
            tc.insertText("쾨")
            return True
        elif t in ("툅", "툊", "퇻", "퇵", "툇", "툄", "퇸", "툉", "퇼", "툏", "툌", "툍", "툋", "툎", "퇶", "툈"):
            tc.insertText("퇴")
            return True
        elif t in ("쵭", "쵲", "쵣", "쵝", "쵯", "쵬", "쵠", "쵱", "쵤", "쵷", "쵴", "쵵", "쵳", "쵶", "쵞", "쵰"):
            tc.insertText("최")
            return True
        elif t in ("꾑", "꾖", "꾇", "꾁", "꾓", "꾐", "꾄", "꾕", "꾈", "꾛", "꾘", "꾙", "꾗", "꾚", "꾂", "꾔"):
            tc.insertText("꾀")
            return True

        elif t in ("쐽", "쑂", "쐳", "쐭", "쐿", "쐼", "쐰", "쑁", "쐴", "쑇", "쑄", "쑅", "쑃", "쑆", "쐮", "쑀"):
            tc.insertText("쐬")
            return True
        elif t in ("쬅", "쬊", "쫻", "쫵", "쬇", "쬄", "쫸", "쬉", "쫼", "쬏", "쬌", "쬍", "쬋", "쬎", "쫶", "쬈"):
            tc.insertText("쫴")
            return True

        elif t in ("뙙", "뙞", "뙏", "뙉", "뙛", "뙘", "뙌", "뙝", "뙐", "뙣", "뙠", "뙡", "뙟", "뙢", "뙊", "뙜"):
            tc.insertText("뙈")
            return True
        
        elif t in ("꽵", "꽺", "꽫", "꽥", "꽷", "꽴", "꽨", "꽹", "꽬", "꽿", "꽼", "꽽", "꽻", "꽾", "꽦", "꽸"):
            tc.insertText("꽤")
            return True

        elif t in ("쐡", "쐦", "쐗", "쐑", "쐣", "쐠", "쐔", "쐥", "쐘", "쐫", "쐨", "쐩", "쐧", "쐪", "쐒", "쐤"):
            tc.insertText("쐐")
            return True
        
        elif t in ("붭", "붲", "붣", "붝", "붯", "붬", "붠", "붱", "붤", "붷", "붴", "붵", "붳", "붶", "붞", "붰"):
            tc.insertText("붜")
            return True
        
        elif t in ("줩", "줮", "줟", "줙", "줫", "줨", "줜", "줭", "줠", "줳", "줰", "줱", "줯", "줲", "줚", "줬"):
            tc.insertText("줘")
            return True

        elif t in ("둽", "뒂", "둳", "둭", "둿", "둼", "둰", "뒁", "둴", "뒇", "뒄", "뒅", "뒃", "뒆", "둮", "뒀"):
            tc.insertText("둬")
            return True
        
        elif t in ("궙", "궞", "궏", "궉", "궛", "궘", "권", "궝", "궐", "궣", "궠", "궡", "궟", "궢", "궊", "궜"):
            tc.insertText("궈")
            return True
        
        elif t in ("쉅", "쉊", "숻", "숵", "쉇", "쉄", "숸", "쉉", "숼", "쉏", "쉌", "쉍", "쉋", "쉎", "숶", "쉈"):
            tc.insertText("숴")
            return True
        
        elif t in ("뭡", "뭦", "뭗", "뭑", "뭣", "뭠", "뭔", "뭥", "뭘", "뭫", "뭨", "뭩", "뭧", "뭪", "뭒", "뭤"):
            tc.insertText("뭐")
            return True
        
        elif t in ("눱", "눶", "눧", "눡", "눳", "눰", "눤", "눵", "눨", "눻", "눸", "눹", "눷", "눺", "눢", "눴"):
            tc.insertText("눠")
            return True
        
        elif t in ("웝", "웢", "웓", "웍", "웟", "웜", "원", "웡", "월", "웧", "웤", "웥", "웣", "웦", "웎", "웠"):
            tc.insertText("워")
            return True
        
        elif t in ("뤕", "뤚", "뤋", "뤅", "뤗", "뤔", "뤈", "뤙", "뤌", "뤟", "뤜", "뤝", "뤛", "뤞", "뤆", "뤘"):
            tc.insertText("뤄")
            return True
        
        elif t in ("훱", "훶", "훧", "훡", "훳", "훰", "훤", "훵", "훨", "훻", "훸", "훹", "훷", "훺", "훢", "훴"):
            tc.insertText("훠")
            return True
        
        elif t in ("퀍", "퀒", "퀃", "쿽", "퀏", "퀌", "퀀", "퀑", "퀄", "퀗", "퀔", "퀕", "퀓", "퀖", "쿾", "퀐"):
            tc.insertText("쿼")
            return True
        
        elif t in ("퉙", "퉞", "퉏", "퉉", "퉛", "퉘", "퉌", "퉝", "퉐", "퉣", "퉠", "퉡", "퉟", "퉢", "퉊", "퉜"):
            tc.insertText("퉈")
            return True
        elif t in ("췁", "췆", "춷", "춱", "췃", "췀", "춴", "췅", "춸", "췋", "췈", "췉", "췇", "췊", "춲", "췄"):
            tc.insertText("최")
            return True
        
        elif t in ("풥", "풪", "풛", "풕", "풧", "풤", "풘", "풩", "풜", "풯", "풬", "풭", "풫", "풮", "풖", "풨"):
            tc.insertText("풔")
            return True

        elif t in ("뿹", "뿾", "뿯", "뿩", "뿻", "뿸", "뿬", "뿽", "뿰", "쀃", "쀀", "쀁", "뿿", "쀂", "뿪", "뿼"):
            tc.insertText("뿨")
            return True
        elif t in ("쭵", "쭺", "쭫", "쭥", "쭷", "쬄", "쫸", "쬉", "쫼", "쬏", "쬌", "쬍", "쬋", "쬎", "쫶", "쬈"):
            tc.insertText("쫴")
            return True

        elif t in ("뛉", "뛎", "뚿", "뚹", "뛋", "뛈", "뚼", "뛍", "뛀", "뛓", "뛐", "뛑", "뛏", "뛒", "뚺", "뛌"):
            tc.insertText("뚸")
            return True
        
        elif t in ("꿥", "꿪", "꿛", "꿕", "꿧", "꿤", "꿘", "꿩", "꿜", "꿯", "꿬", "꿭", "꿫", "꿮", "꿖", "꿨"):
            tc.insertText("꿔")
            return True

        elif t in ("쒑", "쒖", "쒇", "쒁", "쒓", "쒐", "쒄", "쒕", "쒈", "쒛", "쒘", "쒙", "쒗", "쒚", "쒂", "쒔"):
            tc.insertText("쒀")
            return True

        

        elif t in ("뷉", "뷎", "붿", "붹", "뷋", "뷈", "붼", "뷍", "뷀", "뷓", "뷐", "뷑", "뷏", "뷒", "붺", "뷌"):
            tc.insertText("붸")
            return True
        
        elif t in ("쥅", "쥊", "붿", "줵", "쥇", "쥄", "줸", "쥉", "줼", "쥏", "쥌", "쥍", "쥋", "쥎", "줶", "쥈"):
            tc.insertText("줴")
            return True

        elif t in ("뒙", "뒞", "뒏", "뒉", "뒛", "뒘", "뒌", "뒝", "뒐", "뒣", "뒠", "뒡", "뒟", "뒢", "뒊", "뒜"):
            tc.insertText("뒈")
            return True
        
        elif t in ("궵", "궺", "궫", "궥", "궷", "궴", "궨", "궹", "궬", "궿", "궼", "궽", "궻", "궾", "궦", "궸"):
            tc.insertText("궤")
            return True
        
        elif t in ("쉡", "쉦", "쉗", "쉑", "쉣", "쉠", "쉔", "쉥", "쉘", "쉫", "쉨", "쉩", "쉧", "쉪", "쉒", "쉤"):
            tc.insertText("쉐")
            return True
        
        elif t in ("뭽", "뮂", "뭳", "뭭", "뭿", "뭼", "뭰", "뮁", "뭴", "뮇", "뮄", "뮅", "뮃", "뮆", "뭮", "뮀"):
            tc.insertText("뭬")
            return True
        
        elif t in ("뉍", "뉒", "뉃", "눽", "뉏", "뉌", "뉀", "뉑", "뉄", "뉗", "뉔", "뉕", "뉓", "뉖", "눾", "뉐"):
            tc.insertText("눼")
            return True
        
        elif t in ("웹", "웾", "웯", "웩", "웻", "웸", "웬", "웽", "웰", "윃", "윀", "윁", "웿", "윂", "웪", "웼"):
            tc.insertText("웨")
            return True
        
        elif t in ("뤱", "뤶", "뤧", "뤡", "뤳", "뤰", "뤤", "뤵", "뤨", "뤻", "뤸", "뤹", "뤷", "뤺", "뤢", "뤴"):
            tc.insertText("뤠")
            return True
        
        elif t in ("휍", "휒", "휃", "훽", "휏", "휌", "휀", "휑", "휄", "휗", "휔", "휕", "휓", "휖", "훾", "휐"):
            tc.insertText("훼")
            return True
        
        elif t in ("퀩", "퀮", "퀟", "퀙", "퀫", "퀨", "퀜", "퀭", "퀠", "퀳", "퀰", "퀱", "퀯", "퀲", "퀚", "퀬"):
            tc.insertText("퀘")
            return True
        
        elif t in ("퉵", "퉺", "퉫", "퉥", "퉷", "퉴", "퉨", "퉹", "퉬", "퉿", "퉼", "퉽", "퉻", "퉾", "퉦", "퉸"):
            tc.insertText("퉤")
            return True
        elif t in ("췝", "췢", "췓", "췍", "췟", "췜", "췐", "췡", "췔", "췧", "췤", "췥", "췣", "췦", "췎", "췠"):
            tc.insertText("췌")
            return True
        
        elif t in ("퓁", "퓆", "퓆", "풱", "퓃", "퓀", "풴", "퓅", "풸", "퓋", "퓈", "퓉", "퓇", "퓊", "풲", "퓄"):
            tc.insertText("풰")
            return True

        elif t in ("쀕", "쀚", "쀋", "쀅", "쀗", "쀔", "쀈", "쀙", "쀌", "쀟", "쀜", "쀝", "쀛", "쀞", "쀆", "쀘"):
            tc.insertText("쀄")
            return True
        elif t in ("쮑", "쮖", "쮇", "쮁", "쮓", "쮐", "쮄", "쮕", "쮈", "쮛", "쮘", "쮙", "쮗", "쮚", "쮂", "쮔"):
            tc.insertText("쮀")
            return True

        elif t in ("뛥", "뛪", "뛛", "뛕", "뛧", "뛤", "뛘", "뛩", "뛜", "뛯", "뛬", "뛭", "뛫", "뛮", "뛖", "뛨"):
            tc.insertText("뛔")
            return True
        
        elif t in ("뀁", "뀆", "꿷", "꿱", "뀃", "뀀", "꿴", "뀅", "꿸", "뀋", "뀈", "뀉", "뀇", "뀊", "꿲", "뀄"):
            tc.insertText("꿰")
            return True

        elif t in ("쒑", "쒖", "쒇", "쒁", "쒓", "쒐", "쒄", "쒕", "쒈", "쒛", "쒘", "쒙", "쒗", "쒚", "쒂", "쒔"):
            tc.insertText("쒀")
            return True


        elif t in ("뷥", "뷪", "뷛", "뷕", "뷧", "뷤", "뷘", "뷩", "뷜", "뷯", "뷬", "뷭", "뷫", "뷮", "뷖", "뷨"):
            tc.insertText("뷔")
            return True
        
        elif t in ("쥡", "쥦", "쥗", "쥑", "쥣", "쥠", "쥔", "쥥", "쥘", "쥫", "쥨", "쥩", "쥧", "쥪", "쥒", "쥤"):
            tc.insertText("쥐")
            return True

        elif t in ("뒵", "뒺", "뒫", "뒥", "뒷", "뒴", "뒨", "뒹", "뒬", "뒿", "뒼", "뒽", "뒻", "뒾", "뒦", "뒸"):
            tc.insertText("뒤")
            return True
        
        elif t in ("귑", "귖", "귇", "귁", "귓", "귐", "귄", "귕", "귈", "귛", "귘", "귙", "귗", "귚", "귂", "귔"):
            tc.insertText("귀")
            return True
        
        elif t in ("쉽", "슂", "쉳", "쉭", "쉿", "쉼", "쉰", "슁", "쉴", "슇", "슄", "슅", "슃", "슆", "쉮", "슀"):
            tc.insertText("쉬")
            return True
        
        elif t in ("뮙", "뮞", "뮏", "뮉", "뮛", "뮘", "뮌", "뮝", "뮐", "뮣", "뮠", "뮡", "뮟", "뮢", "뮊", "뮜"):
            tc.insertText("뮈")
            return True
        
        elif t in ("뉩", "뉮", "뉟", "뉙", "뉫", "뉨", "뉜", "뉭", "뉠", "뉳", "뉰", "뉱", "뉯", "뉲", "뉚", "뉚"):
            tc.insertText("뉘")
            return True
        
        elif t in ("윕", "윚", "윋", "윅", "윗", "윔", "윈", "윙", "윌", "윟", "윜", "윝", "윛", "윞", "윆", "윘"):
            tc.insertText("위")
            return True
        
        elif t in ("륍", "륒", "륃", "뤽", "륏", "륌", "륀", "륑", "륄", "륗", "륔", "륕", "륓", "륖", "뤾", "륐"):
            tc.insertText("뤼")
            return True
        
        elif t in ("휩", "휮", "휟", "휙", "휫", "휨", "휜", "휭", "휠", "휳", "휰", "휱", "휯", "휲", "휚", "휬"):
            tc.insertText("휘")
            return True
        
        elif t in ("큅", "큊", "퀻", "퀵", "큇", "큄", "퀸", "큉", "퀼", "큏", "큌", "큍", "큋", "큎", "퀶", "큈"):
            tc.insertText("퀴")
            return True
        
        elif t in ("튑", "튖", "튇", "튁", "튓", "튐", "튄", "튕", "튈", "튛", "튘", "튙", "튗", "튚", "튂", "튔"):
            tc.insertText("튀")
            return True
        elif t in ("췹", "췾", "췯", "췩", "췻", "췸", "췬", "췽", "췰", "츃", "츀", "츁", "췿", "츂", "췪", "췼"):
            tc.insertText("취")
            return True
        
        elif t in ("퓝", "퓢", "퓓", "퓍", "퓟", "퓜", "퓐", "퓡", "퓔", "퓧", "퓤", "퓥", "퓣", "퓦", "퓎", "퓠"):
            tc.insertText("퓌")
            return True

        elif t in ("쀱", "쀶", "쀧", "쀡", "쀳", "쀰", "쀤", "쀵", "쀨", "쀻", "쀸", "쀹", "쀷", "쀺", "쀢", "쀴"):
            tc.insertText("쀠")
            return True
        elif t in ("쮭", "쮲", "쮣", "쮝", "쮯", "쮬", "쮠", "쮱", "쮤", "쮷", "쮴", "쮵", "쮳", "쮶", "쮞", "쮰"):
            tc.insertText("쮜")
            return True

        elif t in ("뜁", "뜆", "뛷", "뛱", "뜃", "뜀", "뛴", "뜅", "뛸", "뜋", "뜈", "뜉", "뜇", "뜊", "뛲", "뜄"):
            tc.insertText("뛰")
            return True
        
        elif t in ("뀝", "뀢", "뀓", "뀍", "뀟", "뀜", "뀐", "뀡", "뀔", "뀧", "뀤", "뀥", "뀣", "뀦", "뀎", "뀠"):
            tc.insertText("뀌")
            return True

        elif t in ("쓉", "쓎", "쒿", "쒹", "쓋", "쓈", "쒼", "쓍", "쓀", "쓓", "쓐", "쓑", "쓏", "쓒", "쒺", "쓌"):
            tc.insertText("쒸")
            return True


        elif t in ("븹", "븾", "븯", "븩", "븻", "븸", "븬", "븽", "븰", "빃", "빀", "빁", "븿", "빂", "븪", "븼"):
            tc.insertText("븨")
            return True
        
        elif t in ("즵", "즺", "즫", "즥", "즷", "즴", "즨", "즹", "즬", "즿", "즼", "즽", "즻", "즾", "즦", "즸"):
            tc.insertText("즤")
            return True

        elif t in ("딉", "딎", "듿", "듹", "딋", "딈", "듼", "딍", "딀", "딓", "딐", "딑", "딏", "딒", "듺", "딌"):
            tc.insertText("듸")
            return True
        
        elif t in ("긥", "긪", "긛", "긕", "긧", "긤", "긘", "긩", "긜", "긯", "긬", "긭", "긫", "긮", "긖", "긨"):
            tc.insertText("긔")
            return True
        
        elif t in ("싑", "싖", "싇", "싁", "싓", "싐", "싄", "싕", "싈", "싛", "싘", "싙", "싗", "싚", "싂", "싔"):
            tc.insertText("싀")
            return True
        
        elif t in ("믭", "믲", "믣", "믝", "믯", "믬", "믠", "믱", "믤", "믷", "믴", "믵", "믳", "믶", "믞", "믰"):
            tc.insertText("믜")
            return True
        
        elif t in ("늽", "닂", "늳", "늭", "늿", "늼", "늰", "닁", "늴", "닇", "닄", "닅", "닃", "닆", "늮", "닀"):
            tc.insertText("늬")
            return True
        
        elif t in ("읩", "읮", "읟", "읙", "읫", "읨", "읜", "읭", "읠", "읳", "읰", "읱", "읯", "읲", "읚", "읬"):
            tc.insertText("의")
            return True
        
        elif t in ("릡", "릦", "릗", "릑", "릣", "릠", "릔", "릥", "릘", "릫", "릨", "릩", "릧", "릪", "릒", "릤"):
            tc.insertText("릐")
            return True
        
        elif t in ("흽", "힂", "흳", "흭", "흿", "흼", "흰", "힁", "흴", "힇", "힄", "힅", "힃", "힆", "흮", "힀"):
            tc.insertText("희")
            return True
        
        elif t in ("킙", "킞", "킏", "킉", "킛", "킘", "킌", "킝", "킐", "킣", "킠", "킡", "킟", "킢", "킊", "킜"):
            tc.insertText("킈")
            return True
        
        elif t in ("틥", "틪", "틛", "틕", "틧", "틤", "틘", "틩", "틜", "틯", "틬", "틭", "틫", "틮", "틖", "틨"):
            tc.insertText("틔")
            return True
        elif t in ("칍", "칒", "칃", "츽", "칏", "칌", "칀", "칑", "칄", "칗", "칔", "칕", "칓", "칖", "츾", "칐"):
            tc.insertText("츼")
            return True
        
        elif t in ("픱", "픶", "픧", "픡", "픳", "픰", "픤", "픵", "픨", "픻", "픸", "픹", "픷", "픺", "픢", "픴"):
            tc.insertText("픠")
            return True

        elif t in ("삅", "삊", "쁻", "쁵", "삇", "삄", "쁸", "삉", "쁼", "삏", "삌", "삍", "삋", "삎", "쁶", "삈"):
            tc.insertText("쁴")
            return True
        elif t in ("찁", "찆", "쯷", "쯱", "찃", "찀", "쯴", "찅", "쯸", "찋", "찈", "찉", "찇", "찊", "쯲", "찄"):
            tc.insertText("쯰")
            return True

        elif t in ("띕", "띚", "띋", "띅", "띗", "띔", "띈", "띙", "띌", "띟", "띜", "띝", "띛", "띞", "띆", "띘"):
            tc.insertText("띄")
            return True
        
        elif t in ("끱", "끶", "끧", "끡", "끳", "끰", "끤", "끵", "끨", "끻", "끸", "끹", "끷", "끺", "끢", "끴"):
            tc.insertText("끠")
            return True

        elif t in ("씝", "씢", "씓", "씍", "씟", "씜", "씐", "씡", "씔", "씧", "씤", "씥", "씣", "씦", "씎", "씠"):
            tc.insertText("씌")
            return True

        elif t == "뷔":
            tc.insertText("부")
            return True

        elif t == "쥐":
            tc.insertText("주")
            return True

        elif t == "뒤":
            tc.insertText("두")
            return True

        elif t == "귀":
            tc.insertText("구")
            return True

        elif t == "쉬":
            tc.insertText("수")
            return True

        elif t == "뮈":
            tc.insertText("무")
            return True

        elif t == "뉘":
            tc.insertText("누")
            return True
        elif t == "위":
            tc.insertText("우")
            return True
        elif t == "뤼":
            tc.insertText("루")
            return True

        elif t == "휘":
            tc.insertText("후")
            return True
        elif t == "퀴":
            tc.insertText("쿠")
            return True

        elif t == "튀":
            tc.insertText("투")
            return True

        elif t == "취":
            tc.insertText("추")
            return True

        elif t == "퓌":
            tc.insertText("푸")
            return True

        elif t == "쀠":
            tc.insertText("뿌")
            return True
        elif t == "쮜":
            tc.insertText("쭈")
            return True

        elif t == "뛰":
            tc.insertText("뚜")
            return True

        elif t == "뀌":
            tc.insertText("꾸")
            return True

        elif t == "쒸":
            tc.insertText("쑤")
            return True


        elif t == "붜":
            tc.insertText("부")
            return True

        elif t == "줘":
            tc.insertText("주")
            return True

        elif t == "둬":
            tc.insertText("두")
            return True

        elif t == "궈":
            tc.insertText("구")
            return True

        elif t == "숴":
            tc.insertText("수")
            return True

        elif t == "뭐":
            tc.insertText("무")
            return True

        elif t == "눠":
            tc.insertText("누")
            return True
        elif t == "워":
            tc.insertText("우")
            return True
        elif t == "뤄":
            tc.insertText("루")
            return True

        elif t == "훠":
            tc.insertText("후")
            return True
        elif t == "쿼":
            tc.insertText("쿠")
            return True

        elif t == "퉈":
            tc.insertText("투")
            return True

        elif t == "취":
            tc.insertText("추")
            return True

        elif t == "퓌":
            tc.insertText("푸")
            return True

        elif t == "뿨":
            tc.insertText("뿌")
            return True
        elif t == "쭤":
            tc.insertText("쭈")
            return True

        elif t == "뚸":
            tc.insertText("뚜")
            return True

        elif t == "꿔":
            tc.insertText("꾸")
            return True

        elif t == "쒀":
            tc.insertText("쑤")
            return True


        elif t == "봐":
            tc.insertText("보")
            return True

        elif t == "좌":
            tc.insertText("조")
            return True

        elif t == "돠":
            tc.insertText("도")
            return True

        elif t == "과":
            tc.insertText("고")
            return True

        elif t == "솨":
            tc.insertText("소")
            return True

        elif t == "뫄":
            tc.insertText("모")
            return True

        elif t == "놔":
            tc.insertText("노")
            return True
        elif t == "와":
            tc.insertText("오")
            return True
        elif t == "롸":
            tc.insertText("로")
            return True

        elif t == "화":
            tc.insertText("호")
            return True
        elif t == "콰":
            tc.insertText("코")
            return True

        elif t == "톼":
            tc.insertText("토")
            return True

        elif t == "촤":
            tc.insertText("초")
            return True

        elif t == "퐈":
            tc.insertText("포")
            return True

        elif t == "뽜":
            tc.insertText("뽀")
            return True
        elif t == "쫘":
            tc.insertText("쪼")
            return True

        elif t == "똬":
            tc.insertText("또")
            return True

        elif t == "꽈":
            tc.insertText("꼬")
            return True

        elif t == "쏴":
            tc.insertText("쏘")
            return True


        elif t == "봬":
            tc.insertText("보")
            return True

        elif t == "좨":
            tc.insertText("조")
            return True

        elif t == "돼":
            tc.insertText("도")
            return True

        elif t == "괘":
            tc.insertText("고")
            return True

        elif t == "쇄":
            tc.insertText("소")
            return True

        elif t == "뫠":
            tc.insertText("모")
            return True

        elif t == "놰":
            tc.insertText("노")
            return True
        elif t == "왜":
            tc.insertText("오")
            return True
        elif t == "뢔":
            tc.insertText("로")
            return True

        elif t == "홰":
            tc.insertText("호")
            return True
        elif t == "쾌":
            tc.insertText("코")
            return True

        elif t == "퇘":
            tc.insertText("토")
            return True

        elif t == "쵀":
            tc.insertText("초")
            return True

        elif t == "퐤":
            tc.insertText("포")
            return True

        elif t == "뽸":
            tc.insertText("뽀")
            return True
        elif t == "쫴":
            tc.insertText("쪼")
            return True

        elif t == "뙈":
            tc.insertText("또")
            return True

        elif t == "꽤":
            tc.insertText("꼬")
            return True

        elif t == "쐐":
            tc.insertText("쏘")
            return True


        elif t == "붸":
            tc.insertText("부")
            return True

        elif t == "줴":
            tc.insertText("주")
            return True

        elif t == "뒈":
            tc.insertText("두")
            return True

        elif t == "궤":
            tc.insertText("구")
            return True

        elif t == "쉐":
            tc.insertText("수")
            return True

        elif t == "뭬":
            tc.insertText("무")
            return True

        elif t == "눼":
            tc.insertText("누")
            return True
        elif t == "웨":
            tc.insertText("우")
            return True
        elif t == "뤠":
            tc.insertText("루")
            return True

        elif t == "훼":
            tc.insertText("후")
            return True
        elif t == "퀘":
            tc.insertText("쿠")
            return True

        elif t == "퉤":
            tc.insertText("투")
            return True

        elif t == "췌":
            tc.insertText("추")
            return True

        elif t == "풰":
            tc.insertText("푸")
            return True

        elif t == "쀄":
            tc.insertText("뿌")
            return True
        elif t == "쮀":
            tc.insertText("쭈")
            return True

        elif t == "뛔":
            tc.insertText("뚜")
            return True

        elif t == "꿰":
            tc.insertText("꾸")
            return True

        elif t == "쒜":
            tc.insertText("쑤")
            return True


        elif t == "븨":
            tc.insertText("브")
            return True

        elif t == "즤":
            tc.insertText("즈")
            return True

        elif t == "듸":
            tc.insertText("드")
            return True

        elif t == "긔":
            tc.insertText("그")
            return True

        elif t == "싀":
            tc.insertText("스")
            return True

        elif t == "믜":
            tc.insertText("므")
            return True

        elif t == "늬":
            tc.insertText("느")
            return True
        elif t == "의":
            tc.insertText("으")
            return True
        elif t == "릐":
            tc.insertText("르")
            return True

        elif t == "희":
            tc.insertText("흐")
            return True
        elif t == "킈":
            tc.insertText("크")
            return True

        elif t == "틔":
            tc.insertText("트")
            return True

        elif t == "츼":
            tc.insertText("츠")
            return True

        elif t == "픠":
            tc.insertText("프")
            return True

        elif t == "쁴":
            tc.insertText("쁘")
            return True
        elif t == "쯰":
            tc.insertText("쯔")
            return True

        elif t == "띄":
            tc.insertText("뜨")
            return True

        elif t == "끠":
            tc.insertText("끄")
            return True

        elif t == "씌":
            tc.insertText("쓰")
            return True


        elif t == "뵈":
            tc.insertText("보")
            return True

        elif t == "죄":
            tc.insertText("조")
            return True

        elif t == "되":
            tc.insertText("도")
            return True

        elif t == "괴":
            tc.insertText("고")
            return True

        elif t == "쇠":
            tc.insertText("소")
            return True

        elif t == "뫼":
            tc.insertText("모")
            return True

        elif t == "뇌":
            tc.insertText("노")
            return True
        elif t == "외":
            tc.insertText("오")
            return True
        elif t == "뢰":
            tc.insertText("로")
            return True

        elif t == "회":
            tc.insertText("호")
            return True
        elif t == "쾨":
            tc.insertText("코")
            return True

        elif t == "퇴":
            tc.insertText("토")
            return True

        elif t == "최":
            tc.insertText("초")
            return True

        elif t == "푀":
            tc.insertText("포")
            return True

        elif t == "뾔":
            tc.insertText("뽀")
            return True
        elif t == "쬐":
            tc.insertText("쪼")
            return True

        elif t == "뙤":
            tc.insertText("또")
            return True

        elif t == "꾀":
            tc.insertText("꼬")
            return True

        elif t == "쐬":
            tc.insertText("쏘")
            return True


        elif repair_dict.dic[t] != -1:
                tc.insertText(repair_dict.dic[t])
                return True
        

        

        
  
