# -*- coding: utf-8 -*-
dic = {
    "꽥ㅏ":
   "꽤가",
"꽥ㅓ":
   "꽤거",
"꽥ㅑ":
   "꽤갸",
"꽥ㅕ":
   "꽤겨",

"꽥ㅜ":
   "꽤구",
"꽥ㅠ":
   "꽤규",
"꽥ㅗ":
   "꽤고",
"꽥ㅛ":
   "꽤교",

"꽥ㅣ":
   "꽤기",
"꽥ㅡ":
   "꽤그",
"꽥ㅐ":
   "꽤개",
"꽥ㅒ":
   "꽤걔",
"꽥ㅔ":
   "꽤게",
"꽥ㅖ":
   "꽤계",
"꽦ㅏ":
   "꽤까",
"꽦ㅓ":
   "꽤꺼",
"꽦ㅑ":
   "꽤꺄",
"꽦ㅕ":
   "꽤껴",

"꽦ㅜ":
   "꽤꾸",
"꽦ㅠ":
   "꽤뀨",
"꽦ㅗ":
   "꽤꼬",
"꽦ㅛ":
   "꽤꾜",

"꽦ㅣ":
   "꽤끼",
"꽦ㅡ":
   "꽤끄",
"꽦ㅐ":
   "꽤깨",
"꽦ㅒ":
   "꽤꺠",
"꽦ㅔ":
   "꽤께",
"꽦ㅖ":
   "꽤꼐",

"꽨ㅏ":
   "꽤나",
"꽨ㅓ":
   "꽤너",
"꽨ㅑ":
   "꽤냐",
"꽨ㅕ":
   "꽤녀",

"꽨ㅜ":
   "꽤누",
"꽨ㅠ":
   "꽤뉴",
"꽨ㅗ":
   "꽤노",
"꽨ㅛ":
   "꽤뇨",

"꽨ㅣ":
   "꽤니",
"꽨ㅡ":
   "꽤느",
"꽨ㅐ":
   "꽤내",
"꽨ㅒ":
   "꽤냬",
"꽨ㅔ":
   "꽤네",
"꽨ㅖ":
   "꽤녜",

"꽫ㅏ":
   "꽤다",
"꽫ㅓ":
   "꽤더",
"꽫ㅑ":
   "꽤댜",
"꽫ㅕ":
   "꽤뎌",

"꽫ㅜ":
   "꽤두",
"꽫ㅠ":
   "꽤듀",
"꽫ㅗ":
   "꽤도",
"꽫ㅛ":
   "꽤됴",

"꽫ㅣ":
   "꽤디",
"꽫ㅡ":
   "꽤드",
"꽫ㅐ":
   "꽤대",
"꽫ㅒ":
   "꽤댸",
"꽫ㅔ":
   "꽤데",
"꽫ㅖ":
   "꽤뎨",

"꽬ㅏ":
   "꽤라",
"꽬ㅓ":
   "꽤러",
"꽬ㅑ":
   "꽤랴",
"꽬ㅕ":
   "꽤려",

"꽬ㅜ":
   "꽤루",
"꽬ㅠ":
   "꽤류",
"꽬ㅗ":
   "꽤로",
"꽬ㅛ":
   "꽤료",

"꽬ㅣ":
   "꽤리",
"꽬ㅡ":
   "꽤르",
"꽬ㅐ":
   "꽤래",
"꽬ㅒ":
   "꽤럐",
"꽬ㅔ":
   "꽤레",
"꽬ㅖ":
   "꽤례",

"꽴ㅏ":
   "꽤마",
"꽴ㅓ":
   "꽤머",
"꽴ㅑ":
   "꽤먀",
"꽴ㅕ":
   "꽤며",

"꽴ㅜ":
   "꽤무",
"꽴ㅠ":
   "꽤뮤",
"꽴ㅗ":
   "꽤모",
"꽴ㅛ":
   "꽤묘",

"꽴ㅣ":
   "꽤미",
"꽴ㅡ":
   "꽤므",
"꽴ㅐ":
   "꽤매",
"꽴ㅒ":
   "꽤먜",
"꽴ㅔ":
   "꽤메",
"꽴ㅖ":
   "꽤몌",

"꽵ㅏ":
   "꽤바",
"꽵ㅓ":
   "꽤버",
"꽵ㅑ":
   "꽤뱌",
"꽵ㅕ":
   "꽤벼",

"꽵ㅜ":
   "꽤부",
"꽵ㅠ":
   "꽤뷰",
"꽵ㅗ":
   "꽤보",
"꽵ㅛ":
   "꽤뵤",

"꽵ㅣ":
   "꽤비",
"꽵ㅡ":
   "꽤브",
"꽵ㅐ":
   "꽤배",
"꽵ㅒ":
   "꽤뱨",
"꽵ㅔ":
   "꽤베",
"꽵ㅖ":
   "꽤볘",

"꽷ㅏ":
   "꽤사",
"꽷ㅓ":
   "꽤서",
"꽷ㅑ":
   "꽤샤",
"꽷ㅕ":
   "꽤셔",

"꽷ㅜ":
   "꽤수",
"꽷ㅠ":
   "꽤슈",
"꽷ㅗ":
   "꽤소",
"꽷ㅛ":
   "꽤쇼",

"꽷ㅣ":
   "꽤시",
"꽷ㅡ":
   "꽤스",
"꽷ㅐ":
   "꽤새",
"꽷ㅒ":
   "꽤섀",
"꽷ㅔ":
   "꽤세",
"꽷ㅖ":
   "꽤셰",
"꽸ㅏ":
   "꽤싸",
"꽸ㅓ":
   "꽤써",
"꽸ㅑ":
   "꽤쌰",
"꽸ㅕ":
   "꽤쎠",

"꽸ㅜ":
   "꽤쑤",
"꽸ㅠ":
   "꽤쓔",
"꽸ㅗ":
   "꽤쏘",
"꽸ㅛ":
   "꽤쑈",

"꽸ㅣ":
   "꽤씨",
"꽸ㅡ":
   "꽤쓰",
"꽸ㅐ":
   "꽤쌔",
"꽸ㅒ":
   "꽤썌",
"꽸ㅔ":
   "꽤쎄",
"꽸ㅖ":
   "꽤쎼",

"꽹ㅏ":
   "꽤아",
"꽹ㅓ":
   "꽤어",
"꽹ㅑ":
   "꽤야",
"꽹ㅕ":
   "꽤여",

"꽹ㅜ":
   "꽤우",
"꽹ㅠ":
   "꽤유",
"꽹ㅗ":
   "꽤오",
"꽹ㅛ":
   "꽤요",

"꽹ㅣ":
   "꽤이",
"꽹ㅡ":
   "꽤으",
"꽹ㅐ":
   "꽤애",
"꽹ㅒ":
   "꽤얘",
"꽹ㅔ":
   "꽤에",
"꽹ㅖ":
   "꽤예",

"꽺ㅏ":
   "꽤자",
"꽺ㅓ":
   "꽤저",
"꽺ㅑ":
   "꽤쟈",
"꽺ㅕ":
   "꽤져",

"꽺ㅜ":
   "꽤주",
"꽺ㅠ":
   "꽤쥬",
"꽺ㅗ":
   "꽤조",
"꽺ㅛ":
   "꽤죠",

"꽺ㅣ":
   "꽤지",
"꽺ㅡ":
   "꽤즈",
"꽺ㅐ":
   "꽤재",
"꽺ㅒ":
   "꽤쟤",
"꽺ㅔ":
   "꽤제",
"꽺ㅖ":
   "꽤졔",


"꽻ㅏ":
   "꽤차",
"꽻ㅓ":
   "꽤처",
"꽻ㅑ":
   "꽤챠",
"꽻ㅕ":
   "꽤쳐",

"꽻ㅜ":
   "꽤추",
"꽻ㅠ":
   "꽤츄",
"꽻ㅗ":
   "꽤초",
"꽻ㅛ":
   "꽤쵸",

"꽻ㅣ":
   "꽤치",
"꽻ㅡ":
   "꽤츠",
"꽻ㅐ":
   "꽤채",
"꽻ㅒ":
   "꽤챼",
"꽻ㅔ":
   "꽤체",
"꽻ㅖ":
   "꽤쳬",

"꽼ㅏ":
   "꽤카",
"꽼ㅓ":
   "꽤커",
"꽼ㅑ":
   "꽤캬",
"꽼ㅕ":
   "꽤켜",

"꽼ㅜ":
   "꽤쿠",
"꽼ㅠ":
   "꽤큐",
"꽼ㅗ":
   "꽤코",
"꽼ㅛ":
   "꽤쿄",

"꽼ㅣ":
   "꽤키",
"꽼ㅡ":
   "꽤크",
"꽼ㅐ":
   "꽤캐",
"꽼ㅒ":
   "꽤컈",
"꽼ㅔ":
   "꽤케",
"꽼ㅖ":
   "꽤켸",


"꽽ㅏ":
   "꽤타",
"꽽ㅓ":
   "꽤터",
"꽽ㅑ":
   "꽤탸",
"꽽ㅕ":
   "꽤텨",

"꽽ㅜ":
   "꽤투",
"꽽ㅠ":
   "꽤튜",
"꽽ㅗ":
   "꽤토",
"꽽ㅛ":
   "꽤툐",

"꽽ㅣ":
   "꽤티",
"꽽ㅡ":
   "꽤트",
"꽽ㅐ":
   "꽤태",
"꽽ㅒ":
   "꽤턔",
"꽽ㅔ":
   "꽤테",
"꽽ㅖ":
   "꽤톄",

"꽾ㅏ":
   "꽤파",
"꽾ㅓ":
   "꽤퍼",
"꽾ㅑ":
   "꽤퍄",
"꽾ㅕ":
   "꽤펴",

"꽾ㅜ":
   "꽤푸",
"꽾ㅠ":
   "꽤퓨",
"꽾ㅗ":
   "꽤포",
"꽾ㅛ":
   "꽤표",

"꽾ㅣ":
   "꽤피",
"꽾ㅡ":
   "꽤프",
"꽾ㅐ":
   "꽤패",
"꽾ㅒ":
   "꽤퍠",
"꽾ㅔ":
   "꽤페",
"꽾ㅖ":
   "꽤폐",

"꽿ㅏ":
   "꽤하",
"꽿ㅓ":
   "꽤허",
"꽿ㅑ":
   "꽤햐",
"꽿ㅕ":
   "꽤혀",

"꽿ㅜ":
   "꽤후",
"꽿ㅠ":
   "꽤휴",
"꽿ㅗ":
   "꽤호",
"꽿ㅛ":
   "꽤효",

"꽿ㅣ":
   "꽤히",
"꽿ㅡ":
   "꽤흐",
"꽿ㅐ":
   "꽤해",
"꽿ㅒ":
   "꽤햬",
"꽿ㅔ":
   "꽤헤",
"꽿ㅖ":
   "꽤혜",

"꽿ㅏ":
   "꽤하",
"꽿ㅓ":
   "꽤허",
"꽿ㅑ":
   "꽤햐",
"꽿ㅕ":
   "꽤혀",

"꽿ㅜ":
   "꽤후",
"꽿ㅠ":
   "꽤휴",
"꽿ㅗ":
   "꽤호",
"꽿ㅛ":
   "꽤효",

"꽿ㅣ":
   "꽤히",
"꽿ㅡ":
   "꽤흐",
"꽿ㅐ":
   "꽤해",
"꽿ㅒ":
   "꽤햬",
"꽿ㅔ":
   "꽤헤",
"꽿ㅖ":
   "꽤혜",

"뙉ㅏ":
   "뙈가",
"뙉ㅓ":
   "뙈거",
"뙉ㅑ":
   "뙈갸",
"뙉ㅕ":
   "뙈겨",

"뙉ㅜ":
   "뙈구",
"뙉ㅠ":
   "뙈규",
"뙉ㅗ":
   "뙈고",
"뙉ㅛ":
   "뙈교",

"뙉ㅣ":
   "뙈기",
"뙉ㅡ":
   "뙈그",
"뙉ㅐ":
   "뙈개",
"뙉ㅒ":
   "뙈걔",
"뙉ㅔ":
   "뙈게",
"뙉ㅖ":
   "뙈계",

    "뙊ㅏ":
   "뙈까",
"뙊ㅓ":
   "뙈꺼",
"뙊ㅑ":
   "뙈꺄",
"뙊ㅕ":
   "뙈껴",

"뙊ㅜ":
   "뙈꾸",
"뙊ㅠ":
   "뙈뀨",
"뙊ㅗ":
   "뙈꼬",
"뙊ㅛ":
   "뙈꾜",

"뙊ㅣ":
   "뙈끼",
"뙊ㅡ":
   "뙈끄",
"뙊ㅐ":
   "뙈깨",
"뙊ㅒ":
   "뙈꺠",
"뙊ㅔ":
   "뙈께",
"뙊ㅖ":
   "뙈꼐",

"뙌ㅏ":
   "뙈나",
"뙌ㅓ":
   "뙈너",
"뙌ㅑ":
   "뙈냐",
"뙌ㅕ":
   "뙈녀",

"뙌ㅜ":
   "뙈누",
"뙌ㅠ":
   "뙈뉴",
"뙌ㅗ":
   "뙈노",
"뙌ㅛ":
   "뙈뇨",

"뙌ㅣ":
   "뙈니",
"뙌ㅡ":
   "뙈느",
"뙌ㅐ":
   "뙈내",
"뙌ㅒ":
   "뙈냬",
"뙌ㅔ":
   "뙈네",
"뙌ㅖ":
   "뙈녜",

"뙏ㅏ":
   "뙈다",
"뙏ㅓ":
   "뙈더",
"뙏ㅑ":
   "뙈댜",
"뙏ㅕ":
   "뙈뎌",

"뙏ㅜ":
   "뙈두",
"뙏ㅠ":
   "뙈듀",
"뙏ㅗ":
   "뙈도",
"뙏ㅛ":
   "뙈됴",

"뙏ㅣ":
   "뙈디",
"뙏ㅡ":
   "뙈드",
"뙏ㅐ":
   "뙈대",
"뙏ㅒ":
   "뙈댸",
"뙏ㅔ":
   "뙈데",
"뙏ㅖ":
   "뙈뎨",


"뙐ㅏ":
   "뙈라",
"뙐ㅓ":
   "뙈러",
"뙐ㅑ":
   "뙈랴",
"뙐ㅕ":
   "뙈려",

"뙐ㅜ":
   "뙈루",
"뙐ㅠ":
   "뙈류",
"뙐ㅗ":
   "뙈로",
"뙐ㅛ":
   "뙈료",

"뙐ㅣ":
   "뙈리",
"뙐ㅡ":
   "뙈르",
"뙐ㅐ":
   "뙈래",
"뙐ㅒ":
   "뙈럐",
"뙐ㅔ":
   "뙈레",
"뙐ㅖ":
   "뙈례",

"뙘ㅏ":
   "뙈마",
"뙘ㅓ":
   "뙈머",
"뙘ㅑ":
   "뙈먀",
"뙘ㅕ":
   "뙈며",

"뙘ㅜ":
   "뙈무",
"뙘ㅠ":
   "뙈뮤",
"뙘ㅗ":
   "뙈모",
"뙘ㅛ":
   "뙈묘",

"뙘ㅣ":
   "뙈미",
"뙘ㅡ":
   "뙈므",
"뙘ㅐ":
   "뙈매",
"뙘ㅒ":
   "뙈먜",
"뙘ㅔ":
   "뙈메",
"뙘ㅖ":
   "뙈몌",


    
"뙙ㅏ":
   "뙈바",
"뙙ㅓ":
   "뙈버",
"뙙ㅑ":
   "뙈뱌",
"뙙ㅕ":
   "뙈벼",

"뙙ㅜ":
   "뙈부",
"뙙ㅠ":
   "뙈뷰",
"뙙ㅗ":
   "뙈보",
"뙙ㅛ":
   "뙈뵤",

"뙙ㅣ":
   "뙈비",
"뙙ㅡ":
   "뙈브",
"뙙ㅐ":
   "뙈배",
"뙙ㅒ":
   "뙈뱨",
"뙙ㅔ":
   "뙈베",
"뙙ㅖ":
   "뙈볘",

"뙛ㅏ":
   "뙈사",
"뙛ㅓ":
   "뙈서",
"뙛ㅑ":
   "뙈샤",
"뙛ㅕ":
   "뙈셔",

"뙛ㅜ":
   "뙈수",
"뙛ㅠ":
   "뙈슈",
"뙛ㅗ":
   "뙈소",
"뙛ㅛ":
   "뙈쇼",

"뙛ㅣ":
   "뙈시",
"뙛ㅡ":
   "뙈스",
"뙛ㅐ":
   "뙈새",
"뙛ㅒ":
   "뙈섀",
"뙛ㅔ":
   "뙈세",
"뙛ㅖ":
   "뙈셰",

"뙜ㅏ":
   "뙈싸",
"뙜ㅓ":
   "뙈써",
"뙜ㅑ":
   "뙈쌰",
"뙜ㅕ":
   "뙈쎠",

"뙜ㅜ":
   "뙈쑤",
"뙜ㅠ":
   "뙈쓔",
"뙜ㅗ":
   "뙈쏘",
"뙜ㅛ":
   "뙈쑈",

"뙜ㅣ":
   "뙈씨",
"뙜ㅡ":
   "뙈쓰",
"뙜ㅐ":
   "뙈쌔",
"뙜ㅒ":
   "뙈썌",
"뙜ㅔ":
   "뙈쎄",
"뙜ㅖ":
   "뙈쎼",
"뙝ㅏ":
   "뙈아",
"뙝ㅓ":
   "뙈어",
"뙝ㅑ":
   "뙈야",
"뙝ㅕ":
   "뙈여",

"뙝ㅜ":
   "뙈우",
"뙝ㅠ":
   "뙈유",
"뙝ㅗ":
   "뙈오",
"뙝ㅛ":
   "뙈요",

"뙝ㅣ":
   "뙈이",
"뙝ㅡ":
   "뙈으",
"뙝ㅐ":
   "뙈애",
"뙝ㅒ":
   "뙈얘",
"뙝ㅔ":
   "뙈에",
"뙝ㅖ":
   "뙈예",

"뙞ㅏ":
   "뙈자",
"뙞ㅓ":
   "뙈저",
"뙞ㅑ":
   "뙈쟈",
"뙞ㅕ":
   "뙈져",

"뙞ㅜ":
   "뙈주",
"뙞ㅠ":
   "뙈쥬",
"뙞ㅗ":
   "뙈조",
"뙞ㅛ":
   "뙈죠",

"뙞ㅣ":
   "뙈지",
"뙞ㅡ":
   "뙈즈",
"뙞ㅐ":
   "뙈재",
"뙞ㅒ":
   "뙈쟤",
"뙞ㅔ":
   "뙈제",
"뙞ㅖ":
   "뙈졔",

"뙟ㅏ":
   "뙈차",
"뙟ㅓ":
   "뙈처",
"뙟ㅑ":
   "뙈챠",
"뙟ㅕ":
   "뙈쳐",

"뙟ㅜ":
   "뙈추",
"뙟ㅠ":
   "뙈츄",
"뙟ㅗ":
   "뙈초",
"뙟ㅛ":
   "뙈쵸",

"뙟ㅣ":
   "뙈치",
"뙟ㅡ":
   "뙈츠",
"뙟ㅐ":
   "뙈채",
"뙟ㅒ":
   "뙈챼",
"뙟ㅔ":
   "뙈체",
"뙟ㅖ":
   "뙈쳬",

"뙠ㅏ":
   "뙈카",
"뙠ㅓ":
   "뙈커",
"뙠ㅑ":
   "뙈캬",
"뙠ㅕ":
   "뙈켜",

"뙠ㅜ":
   "뙈쿠",
"뙠ㅠ":
   "뙈큐",
"뙠ㅗ":
   "뙈코",
"뙠ㅛ":
   "뙈쿄",

"뙠ㅣ":
   "뙈키",
"뙠ㅡ":
   "뙈크",
"뙠ㅐ":
   "뙈캐",
"뙠ㅒ":
   "뙈컈",
"뙠ㅔ":
   "뙈케",
"뙠ㅖ":
   "뙈켸",

    "뙡ㅏ":
   "뙈타",
"뙡ㅓ":
   "뙈터",
"뙡ㅑ":
   "뙈탸",
"뙡ㅕ":
   "뙈텨",

"뙡ㅜ":
   "뙈투",
"뙡ㅠ":
   "뙈튜",
"뙡ㅗ":
   "뙈토",
"뙡ㅛ":
   "뙈툐",

"뙡ㅣ":
   "뙈티",
"뙡ㅡ":
   "뙈트",
"뙡ㅐ":
   "뙈태",
"뙡ㅒ":
   "뙈턔",
"뙡ㅔ":
   "뙈테",
"뙡ㅖ":
   "뙈톄",

"뙢ㅏ":
   "뙈파",
"뙢ㅓ":
   "뙈퍼",
"뙢ㅑ":
   "뙈퍄",
"뙢ㅕ":
   "뙈펴",

"뙢ㅜ":
   "뙈푸",
"뙢ㅠ":
   "뙈퓨",
"뙢ㅗ":
   "뙈포",
"뙢ㅛ":
   "뙈표",

"뙢ㅣ":
   "뙈피",
"뙢ㅡ":
   "뙈프",
"뙢ㅐ":
   "뙈패",
"뙢ㅒ":
   "뙈퍠",
"뙢ㅔ":
   "뙈페",
"뙢ㅖ":
   "뙈폐",

"뙣ㅏ":
   "뙈하",
"뙣ㅓ":
   "뙈허",
"뙣ㅑ":
   "뙈햐",
"뙣ㅕ":
   "뙈혀",

"뙣ㅜ":
   "뙈후",
"뙣ㅠ":
   "뙈휴",
"뙣ㅗ":
   "뙈호",
"뙣ㅛ":
   "뙈효",

"뙣ㅣ":
   "뙈히",
"뙣ㅡ":
   "뙈흐",
"뙣ㅐ":
   "뙈해",
"뙣ㅒ":
   "뙈햬",
"뙣ㅔ":
   "뙈헤",
"뙣ㅖ":
   "뙈혜",

"뽹ㅏ":
   "뽸가",
"뽹ㅓ":
   "뽸거",
"뽹ㅑ":
   "뽸갸",
"뽹ㅕ":
   "뽸겨",

"뽹ㅜ":
   "뽸구",
"뽹ㅠ":
   "뽸규",
"뽹ㅗ":
   "뽸고",
"뽹ㅛ":
   "뽸교",

"뽹ㅣ":
   "뽸기",
"뽹ㅡ":
   "뽸그",
"뽹ㅐ":
   "뽸개",
"뽹ㅒ":
   "뽸걔",
"뽹ㅔ":
   "뽸게",
"뽹ㅖ":
   "뽸계",

"뽺ㅏ":
   "뽸까",
"뽺ㅓ":
   "뽸꺼",
"뽺ㅑ":
   "뽸꺄",
"뽺ㅕ":
   "뽸껴",

"뽺ㅜ":
   "뽸꾸",
"뽺ㅠ":
   "뽸뀨",
"뽺ㅗ":
   "뽸꼬",
"뽺ㅛ":
   "뽸꾜",

"뽺ㅣ":
   "뽸끼",
"뽺ㅡ":
   "뽸끄",
"뽺ㅐ":
   "뽸깨",
"뽺ㅒ":
   "뽸꺠",
"뽺ㅔ":
   "뽸께",
"뽺ㅖ":
   "뽸꼐",

"뽼ㅏ":
   "뽸나",
"뽼ㅓ":
   "뽸너",
"뽼ㅑ":
   "뽸냐",
"뽼ㅕ":
   "뽸녀",

"뽼ㅜ":
   "뽸누",
"뽼ㅠ":
   "뽸뉴",
"뽼ㅗ":
   "뽸노",
"뽼ㅛ":
   "뽸뇨",

"뽼ㅣ":
   "뽸니",
"뽼ㅡ":
   "뽸느",
"뽼ㅐ":
   "뽸내",
"뽼ㅒ":
   "뽸냬",
"뽼ㅔ":
   "뽸네",
"뽼ㅖ":
   "뽸녜",


"뽿ㅏ":
   "뽸다",
"뽿ㅓ":
   "뽸더",
"뽿ㅑ":
   "뽸댜",
"뽿ㅕ":
   "뽸뎌",

"뽿ㅜ":
   "뽸두",
"뽿ㅠ":
   "뽸듀",
"뽿ㅗ":
   "뽸도",
"뽿ㅛ":
   "뽸됴",

"뽿ㅣ":
   "뽸디",
"뽿ㅡ":
   "뽸드",
"뽿ㅐ":
   "뽸대",
"뽿ㅒ":
   "뽸댸",
"뽿ㅔ":
   "뽸데",
"뽿ㅖ":
   "뽸뎨",

"뾀ㅏ":
   "뽸라",
"뾀ㅓ":
   "뽸러",
"뾀ㅑ":
   "뽸랴",
"뾀ㅕ":
   "뽸려",

"뾀ㅜ":
   "뽸루",
"뾀ㅠ":
   "뽸류",
"뾀ㅗ":
   "뽸로",
"뾀ㅛ":
   "뽸료",

"뾀ㅣ":
   "뽸리",
"뾀ㅡ":
   "뽸르",
"뾀ㅐ":
   "뽸래",
"뾀ㅒ":
   "뽸럐",
"뾀ㅔ":
   "뽸레",
"뾀ㅖ":
   "뽸례",


"뾈ㅏ":
   "뽸마",
"뾈ㅓ":
   "뽸머",
"뾈ㅑ":
   "뽸먀",
"뾈ㅕ":
   "뽸며",

"뾈ㅜ":
   "뽸무",
"뾈ㅠ":
   "뽸뮤",
"뾈ㅗ":
   "뽸모",
"뾈ㅛ":
   "뽸묘",

"뾈ㅣ":
   "뽸미",
"뾈ㅡ":
   "뽸므",
"뾈ㅐ":
   "뽸매",
"뾈ㅒ":
   "뽸먜",
"뾈ㅔ":
   "뽸메",
"뾈ㅖ":
   "뽸몌",

"뾉ㅏ":
   "뽸바",
"뾉ㅓ":
   "뽸버",
"뾉ㅑ":
   "뽸뱌",
"뾉ㅕ":
   "뽸벼",

"뾉ㅜ":
   "뽸부",
"뾉ㅠ":
   "뽸뷰",
"뾉ㅗ":
   "뽸보",
"뾉ㅛ":
   "뽸뵤",

"뾉ㅣ":
   "뽸비",
"뾉ㅡ":
   "뽸브",
"뾉ㅐ":
   "뽸배",
"뾉ㅒ":
   "뽸뱨",
"뾉ㅔ":
   "뽸베",
"뾉ㅖ":
   "뽸볘",

"뾋ㅏ":
   "뽸사",
"뾋ㅓ":
   "뽸서",
"뾋ㅑ":
   "뽸샤",
"뾋ㅕ":
   "뽸셔",

"뾋ㅜ":
   "뽸수",
"뾋ㅠ":
   "뽸슈",
"뾋ㅗ":
   "뽸소",
"뾋ㅛ":
   "뽸쇼",

"뾋ㅣ":
   "뽸시",
"뾋ㅡ":
   "뽸스",
"뾋ㅐ":
   "뽸새",
"뾋ㅒ":
   "뽸섀",
"뾋ㅔ":
   "뽸세",
"뾋ㅖ":
   "뽸셰",

"뾌ㅏ":
   "뽸싸",
"뾌ㅓ":
   "뽸써",
"뾌ㅑ":
   "뽸쌰",
"뾌ㅕ":
   "뽸쎠",

"뾌ㅜ":
   "뽸쑤",
"뾌ㅠ":
   "뽸쓔",
"뾌ㅗ":
   "뽸쏘",
"뾌ㅛ":
   "뽸쑈",

"뾌ㅣ":
   "뽸씨",
"뾌ㅡ":
   "뽸쓰",
"뾌ㅐ":
   "뽸쌔",
"뾌ㅒ":
   "뽸썌",
"뾌ㅔ":
   "뽸쎄",
"뾌ㅖ":
   "뽸쎼",

"뾍ㅏ":
   "뽸아",
"뾍ㅓ":
   "뽸어",
"뾍ㅑ":
   "뽸야",
"뾍ㅕ":
   "뽸여",

"뾍ㅜ":
   "뽸우",
"뾍ㅠ":
   "뽸유",
"뾍ㅗ":
   "뽸오",
"뾍ㅛ":
   "뽸요",

"뾍ㅣ":
   "뽸이",
"뾍ㅡ":
   "뽸으",
"뾍ㅐ":
   "뽸애",
"뾍ㅒ":
   "뽸얘",
"뾍ㅔ":
   "뽸에",
"뾍ㅖ":
   "뽸예",

"뾎ㅏ":
   "뽸자",
"뾎ㅓ":
   "뽸저",
"뾎ㅑ":
   "뽸쟈",
"뾎ㅕ":
   "뽸져",

"뾎ㅜ":
   "뽸주",
"뾎ㅠ":
   "뽸쥬",
"뾎ㅗ":
   "뽸조",
"뾎ㅛ":
   "뽸죠",

"뾎ㅣ":
   "뽸지",
"뾎ㅡ":
   "뽸즈",
"뾎ㅐ":
   "뽸재",
"뾎ㅒ":
   "뽸쟤",
"뾎ㅔ":
   "뽸제",
"뾎ㅖ":
   "뽸졔",


    
"뾏ㅏ":
   "뽸차",
"뾏ㅓ":
   "뽸처",
"뾏ㅑ":
   "뽸챠",
"뾏ㅕ":
   "뽸쳐",

"뾏ㅜ":
   "뽸추",
"뾏ㅠ":
   "뽸츄",
"뾏ㅗ":
   "뽸초",
"뾏ㅛ":
   "뽸쵸",

"뾏ㅣ":
   "뽸치",
"뾏ㅡ":
   "뽸츠",
"뾏ㅐ":
   "뽸채",
"뾏ㅒ":
   "뽸챼",
"뾏ㅔ":
   "뽸체",
"뾏ㅖ":
   "뽸쳬",

"뾏ㅏ":
   "뽸차",
"뾏ㅓ":
   "뽸처",
"뾏ㅑ":
   "뽸챠",
"뾏ㅕ":
   "뽸쳐",

"뾏ㅜ":
   "뽸추",
"뾏ㅠ":
   "뽸츄",
"뾏ㅗ":
   "뽸초",
"뾏ㅛ":
   "뽸쵸",

"뾏ㅣ":
   "뽸치",
"뾏ㅡ":
   "뽸츠",
"뾏ㅐ":
   "뽸채",
"뾏ㅒ":
   "뽸챼",
"뾏ㅔ":
   "뽸체",
"뾏ㅖ":
   "뽸쳬",

"뾐ㅏ":
   "뽸카",
"뾐ㅓ":
   "뽸커",
"뾐ㅑ":
   "뽸캬",
"뾐ㅕ":
   "뽸켜",

"뾐ㅜ":
   "뽸쿠",
"뾐ㅠ":
   "뽸큐",
"뾐ㅗ":
   "뽸코",
"뾐ㅛ":
   "뽸쿄",

"뾐ㅣ":
   "뽸키",
"뾐ㅡ":
   "뽸크",
"뾐ㅐ":
   "뽸캐",
"뾐ㅒ":
   "뽸컈",
"뾐ㅔ":
   "뽸케",
"뾐ㅖ":
   "뽸켸",

"뾑ㅏ":
   "뽸타",
"뾑ㅓ":
   "뽸터",
"뾑ㅑ":
   "뽸탸",
"뾑ㅕ":
   "뽸텨",

"뾑ㅜ":
   "뽸투",
"뾑ㅠ":
   "뽸튜",
"뾑ㅗ":
   "뽸토",
"뾑ㅛ":
   "뽸툐",

"뾑ㅣ":
   "뽸티",
"뾑ㅡ":
   "뽸트",
"뾑ㅐ":
   "뽸태",
"뾑ㅒ":
   "뽸턔",
"뾑ㅔ":
   "뽸테",
"뾑ㅖ":
   "뽸톄",


"뾒ㅏ":
   "뽸파",
"뾒ㅓ":
   "뽸퍼",
"뾒ㅑ":
   "뽸퍄",
"뾒ㅕ":
   "뽸펴",

"뾒ㅜ":
   "뽸푸",
"뾒ㅠ":
   "뽸퓨",
"뾒ㅗ":
   "뽸포",
"뾒ㅛ":
   "뽸표",

"뾒ㅣ":
   "뽸피",
"뾒ㅡ":
   "뽸프",
"뾒ㅐ":
   "뽸패",
"뾒ㅒ":
   "뽸퍠",
"뾒ㅔ":
   "뽸페",
"뾒ㅖ":
   "뽸폐",


"뾓ㅏ":
   "뽸하",
"뾓ㅓ":
   "뽸허",
"뾓ㅑ":
   "뽸햐",
"뾓ㅕ":
   "뽸혀",

"뾓ㅜ":
   "뽸후",
"뾓ㅠ":
   "뽸휴",
"뾓ㅗ":
   "뽸호",
"뾓ㅛ":
   "뽸효",

"뾓ㅣ":
   "뽸히",
"뾓ㅡ":
   "뽸흐",
"뾓ㅐ":
   "뽸해",
"뾓ㅒ":
   "뽸햬",
"뾓ㅔ":
   "뽸헤",
"뾓ㅖ":
   "뽸혜",

"쐩ㅏ":
   "쐐타",
"쐩ㅓ":
   "쐐터",
"쐩ㅑ":
   "쐐탸",
"쐩ㅕ":
   "쐐텨",

"쐩ㅜ":
   "쐐투",
"쐩ㅠ":
   "쐐튜",
"쐩ㅗ":
   "쐐토",
"쐩ㅛ":
   "쐐툐",

"쐩ㅣ":
   "쐐티",
"쐩ㅡ":
   "쐐트",
"쐩ㅐ":
   "쐐태",
"쐩ㅒ":
   "쐐턔",
"쐩ㅔ":
   "쐐테",
"쐩ㅖ":
   "쐐톄",


"쐑ㅏ":
   "쐐가",
"쐑ㅓ":
   "쐐거",
"쐑ㅑ":
   "쐐갸",
"쐑ㅕ":
   "쐐겨",

"쐑ㅜ":
   "쐐구",
"쐑ㅠ":
   "쐐규",
"쐑ㅗ":
   "쐐고",
"쐑ㅛ":
   "쐐교",

"쐑ㅣ":
   "쐐기",
"쐑ㅡ":
   "쐐그",
"쐑ㅐ":
   "쐐개",
"쐑ㅒ":
   "쐐걔",
"쐑ㅔ":
   "쐐게",
"쐑ㅖ":
   "쐐계",

"쐒ㅏ":
   "쐐까",
"쐒ㅓ":
   "쐐꺼",
"쐒ㅑ":
   "쐐꺄",
"쐒ㅕ":
   "쐐껴",

"쐒ㅜ":
   "쐐꾸",
"쐒ㅠ":
   "쐐뀨",
"쐒ㅗ":
   "쐐꼬",
"쐒ㅛ":
   "쐐꾜",

"쐒ㅣ":
   "쐐끼",
"쐒ㅡ":
   "쐐끄",
"쐒ㅐ":
   "쐐깨",
"쐒ㅒ":
   "쐐꺠",
"쐒ㅔ":
   "쐐께",
"쐒ㅖ":
   "쐐꼐",

"쐔ㅏ":
   "쐐나",
"쐔ㅓ":
   "쐐너",
"쐔ㅑ":
   "쐐냐",
"쐔ㅕ":
   "쐐녀",

"쐔ㅜ":
   "쐐누",
"쐔ㅠ":
   "쐐뉴",
"쐔ㅗ":
   "쐐노",
"쐔ㅛ":
   "쐐뇨",

"쐔ㅣ":
   "쐐니",
"쐔ㅡ":
   "쐐느",
"쐔ㅐ":
   "쐐내",
"쐔ㅒ":
   "쐐냬",
"쐔ㅔ":
   "쐐네",
"쐔ㅖ":
   "쐐녜",

    "쐗ㅏ":
   "쐐다",
"쐗ㅓ":
   "쐐더",
"쐗ㅑ":
   "쐐댜",
"쐗ㅕ":
   "쐐뎌",

"쐗ㅜ":
   "쐐두",
"쐗ㅠ":
   "쐐듀",
"쐗ㅗ":
   "쐐도",
"쐗ㅛ":
   "쐐됴",

"쐗ㅣ":
   "쐐디",
"쐗ㅡ":
   "쐐드",
"쐗ㅐ":
   "쐐대",
"쐗ㅒ":
   "쐐댸",
"쐗ㅔ":
   "쐐데",
"쐗ㅖ":
   "쐐뎨",

"쐘ㅏ":
   "쐐라",
"쐘ㅓ":
   "쐐러",
"쐘ㅑ":
   "쐐랴",
"쐘ㅕ":
   "쐐려",

"쐘ㅜ":
   "쐐루",
"쐘ㅠ":
   "쐐류",
"쐘ㅗ":
   "쐐로",
"쐘ㅛ":
   "쐐료",

"쐘ㅣ":
   "쐐리",
"쐘ㅡ":
   "쐐르",
"쐘ㅐ":
   "쐐래",
"쐘ㅒ":
   "쐐럐",
"쐘ㅔ":
   "쐐레",
"쐘ㅖ":
   "쐐례",

"쐠ㅏ":
   "쐐마",
"쐠ㅓ":
   "쐐머",
"쐠ㅑ":
   "쐐먀",
"쐠ㅕ":
   "쐐며",

"쐠ㅜ":
   "쐐무",
"쐠ㅠ":
   "쐐뮤",
"쐠ㅗ":
   "쐐모",
"쐠ㅛ":
   "쐐묘",

"쐠ㅣ":
   "쐐미",
"쐠ㅡ":
   "쐐므",
"쐠ㅐ":
   "쐐매",
"쐠ㅒ":
   "쐐먜",
"쐠ㅔ":
   "쐐메",
"쐠ㅖ":
   "쐐몌",

"쐡ㅏ":
   "쐐바",
"쐡ㅓ":
   "쐐버",
"쐡ㅑ":
   "쐐뱌",
"쐡ㅕ":
   "쐐벼",

"쐡ㅜ":
   "쐐부",
"쐡ㅠ":
   "쐐뷰",
"쐡ㅗ":
   "쐐보",
"쐡ㅛ":
   "쐐뵤",

"쐡ㅣ":
   "쐐비",
"쐡ㅡ":
   "쐐브",
"쐡ㅐ":
   "쐐배",
"쐡ㅒ":
   "쐐뱨",
"쐡ㅔ":
   "쐐베",
"쐡ㅖ":
   "쐐볘",

"쐣ㅏ":
   "쐐사",
"쐣ㅓ":
   "쐐서",
"쐣ㅑ":
   "쐐샤",
"쐣ㅕ":
   "쐐셔",

"쐣ㅜ":
   "쐐수",
"쐣ㅠ":
   "쐐슈",
"쐣ㅗ":
   "쐐소",
"쐣ㅛ":
   "쐐쇼",

"쐣ㅣ":
   "쐐시",
"쐣ㅡ":
   "쐐스",
"쐣ㅐ":
   "쐐새",
"쐣ㅒ":
   "쐐섀",
"쐣ㅔ":
   "쐐세",
"쐣ㅖ":
   "쐐셰",

"쐤ㅏ":
   "쐐싸",
"쐤ㅓ":
   "쐐써",
"쐤ㅑ":
   "쐐쌰",
"쐤ㅕ":
   "쐐쎠",

"쐤ㅜ":
   "쐐쑤",
"쐤ㅠ":
   "쐐쓔",
"쐤ㅗ":
   "쐐쏘",
"쐤ㅛ":
   "쐐쑈",

"쐤ㅣ":
   "쐐씨",
"쐤ㅡ":
   "쐐쓰",
"쐤ㅐ":
   "쐐쌔",
"쐤ㅒ":
   "쐐썌",
"쐤ㅔ":
   "쐐쎄",
"쐤ㅖ":
   "쐐쎼",

"쐥ㅏ":
   "쐐아",
"쐥ㅓ":
   "쐐어",
"쐥ㅑ":
   "쐐야",
"쐥ㅕ":
   "쐐여",

"쐥ㅜ":
   "쐐우",
"쐥ㅠ":
   "쐐유",
"쐥ㅗ":
   "쐐오",
"쐥ㅛ":
   "쐐요",

"쐥ㅣ":
   "쐐이",
"쐥ㅡ":
   "쐐으",
"쐥ㅐ":
   "쐐애",
"쐥ㅒ":
   "쐐얘",
"쐥ㅔ":
   "쐐에",
"쐥ㅖ":
   "쐐예",

"쐦ㅏ":
   "쐐자",
"쐦ㅓ":
   "쐐저",
"쐦ㅑ":
   "쐐쟈",
"쐦ㅕ":
   "쐐져",

"쐦ㅜ":
   "쐐주",
"쐦ㅠ":
   "쐐쥬",
"쐦ㅗ":
   "쐐조",
"쐦ㅛ":
   "쐐죠",

"쐦ㅣ":
   "쐐지",
"쐦ㅡ":
   "쐐즈",
"쐦ㅐ":
   "쐐재",
"쐦ㅒ":
   "쐐쟤",
"쐦ㅔ":
   "쐐제",
"쐦ㅖ":
   "쐐졔",

"쐧ㅏ":
   "쐐차",
"쐧ㅓ":
   "쐐처",
"쐧ㅑ":
   "쐐챠",
"쐧ㅕ":
   "쐐쳐",

"쐧ㅜ":
   "쐐추",
"쐧ㅠ":
   "쐐츄",
"쐧ㅗ":
   "쐐초",
"쐧ㅛ":
   "쐐쵸",

"쐧ㅣ":
   "쐐치",
"쐧ㅡ":
   "쐐츠",
"쐧ㅐ":
   "쐐채",
"쐧ㅒ":
   "쐐챼",
"쐧ㅔ":
   "쐐체",
"쐧ㅖ":
   "쐐쳬",

"쐪ㅏ":
   "쐐파",
"쐪ㅓ":
   "쐐퍼",
"쐪ㅑ":
   "쐐퍄",
"쐪ㅕ":
   "쐐펴",

"쐪ㅜ":
   "쐐푸",
"쐪ㅠ":
   "쐐퓨",
"쐪ㅗ":
   "쐐포",
"쐪ㅛ":
   "쐐표",

"쐪ㅣ":
   "쐐피",
"쐪ㅡ":
   "쐐프",
"쐪ㅐ":
   "쐐패",
"쐪ㅒ":
   "쐐퍠",
"쐪ㅔ":
   "쐐페",
"쐪ㅖ":
   "쐐폐",

"쐫ㅏ":
   "쐐하",
"쐫ㅓ":
   "쐐허",
"쐫ㅑ":
   "쐐햐",
"쐫ㅕ":
   "쐐혀",

"쐫ㅜ":
   "쐐후",
"쐫ㅠ":
   "쐐휴",
"쐫ㅗ":
   "쐐호",
"쐫ㅛ":
   "쐐효",

"쐫ㅣ":
   "쐐히",
"쐫ㅡ":
   "쐐흐",
"쐫ㅐ":
   "쐐해",
"쐫ㅒ":
   "쐐햬",
"쐫ㅔ":
   "쐐헤",
"쐫ㅖ":
   "쐐혜",

"쫵ㅏ":
   "쫴가",
"쫵ㅓ":
   "쫴거",
"쫵ㅑ":
   "쫴갸",
"쫵ㅕ":
   "쫴겨",

"쫵ㅜ":
   "쫴구",
"쫵ㅠ":
   "쫴규",
"쫵ㅗ":
   "쫴고",
"쫵ㅛ":
   "쫴교",

"쫵ㅣ":
   "쫴기",
"쫵ㅡ":
   "쫴그",
"쫵ㅐ":
   "쫴개",
"쫵ㅒ":
   "쫴걔",
"쫵ㅔ":
   "쫴게",
"쫵ㅖ":
   "쫴계",

"쫶ㅏ":
   "쫴까",
"쫶ㅓ":
   "쫴꺼",
"쫶ㅑ":
   "쫴꺄",
"쫶ㅕ":
   "쫴껴",

"쫶ㅜ":
   "쫴꾸",
"쫶ㅠ":
   "쫴뀨",
"쫶ㅗ":
   "쫴꼬",
"쫶ㅛ":
   "쫴꾜",

"쫶ㅣ":
   "쫴끼",
"쫶ㅡ":
   "쫴끄",
"쫶ㅐ":
   "쫴깨",
"쫶ㅒ":
   "쫴꺠",
"쫶ㅔ":
   "쫴께",
"쫶ㅖ":
   "쫴꼐",

"쫸ㅏ":
   "쫴나",
"쫸ㅓ":
   "쫴너",
"쫸ㅑ":
   "쫴냐",
"쫸ㅕ":
   "쫴녀",

"쫸ㅜ":
   "쫴누",
"쫸ㅠ":
   "쫴뉴",
"쫸ㅗ":
   "쫴노",
"쫸ㅛ":
   "쫴뇨",

"쫸ㅣ":
   "쫴니",
"쫸ㅡ":
   "쫴느",
"쫸ㅐ":
   "쫴내",
"쫸ㅒ":
   "쫴냬",
"쫸ㅔ":
   "쫴네",
"쫸ㅖ":
   "쫴녜",
    
"쫻ㅏ":
   "쫴다",
"쫻ㅓ":
   "쫴더",
"쫻ㅑ":
   "쫴댜",
"쫻ㅕ":
   "쫴뎌",

"쫻ㅜ":
   "쫴두",
"쫻ㅠ":
   "쫴듀",
"쫻ㅗ":
   "쫴도",
"쫻ㅛ":
   "쫴됴",

"쫻ㅣ":
   "쫴디",
"쫻ㅡ":
   "쫴드",
"쫻ㅐ":
   "쫴대",
"쫻ㅒ":
   "쫴댸",
"쫻ㅔ":
   "쫴데",
"쫻ㅖ":
   "쫴뎨",

"쫼ㅏ":
   "쫴라",
"쫼ㅓ":
   "쫴러",
"쫼ㅑ":
   "쫴랴",
"쫼ㅕ":
   "쫴려",

"쫼ㅜ":
   "쫴루",
"쫼ㅠ":
   "쫴류",
"쫼ㅗ":
   "쫴로",
"쫼ㅛ":
   "쫴료",

"쫼ㅣ":
   "쫴리",
"쫼ㅡ":
   "쫴르",
"쫼ㅐ":
   "쫴래",
"쫼ㅒ":
   "쫴럐",
"쫼ㅔ":
   "쫴레",
"쫼ㅖ":
   "쫴례",

    
"쬄ㅏ":
   "쫴마",
"쬄ㅓ":
   "쫴머",
"쬄ㅑ":
   "쫴먀",
"쬄ㅕ":
   "쫴며",

"쬄ㅜ":
   "쫴무",
"쬄ㅠ":
   "쫴뮤",
"쬄ㅗ":
   "쫴모",
"쬄ㅛ":
   "쫴묘",

"쬄ㅣ":
   "쫴미",
"쬄ㅡ":
   "쫴므",
"쬄ㅐ":
   "쫴매",
"쬄ㅒ":
   "쫴먜",
"쬄ㅔ":
   "쫴메",
"쬄ㅖ":
   "쫴몌",

"쬅ㅏ":
   "쫴바",
"쬅ㅓ":
   "쫴버",
"쬅ㅑ":
   "쫴뱌",
"쬅ㅕ":
   "쫴벼",

"쬅ㅜ":
   "쫴부",
"쬅ㅠ":
   "쫴뷰",
"쬅ㅗ":
   "쫴보",
"쬅ㅛ":
   "쫴뵤",

"쬅ㅣ":
   "쫴비",
"쬅ㅡ":
   "쫴브",
"쬅ㅐ":
   "쫴배",
"쬅ㅒ":
   "쫴뱨",
"쬅ㅔ":
   "쫴베",
"쬅ㅖ":
   "쫴볘",

    
"쬇ㅏ":
   "쫴사",
"쬇ㅓ":
   "쫴서",
"쬇ㅑ":
   "쫴샤",
"쬇ㅕ":
   "쫴셔",

"쬇ㅜ":
   "쫴수",
"쬇ㅠ":
   "쫴슈",
"쬇ㅗ":
   "쫴소",
"쬇ㅛ":
   "쫴쇼",

"쬇ㅣ":
   "쫴시",
"쬇ㅡ":
   "쫴스",
"쬇ㅐ":
   "쫴새",
"쬇ㅒ":
   "쫴섀",
"쬇ㅔ":
   "쫴세",
"쬇ㅖ":
   "쫴셰",


"쬈ㅏ":
   "쫴싸",
"쬈ㅓ":
   "쫴써",
"쬈ㅑ":
   "쫴쌰",
"쬈ㅕ":
   "쫴쎠",

"쬈ㅜ":
   "쫴쑤",
"쬈ㅠ":
   "쫴쓔",
"쬈ㅗ":
   "쫴쏘",
"쬈ㅛ":
   "쫴쑈",

"쬈ㅣ":
   "쫴씨",
"쬈ㅡ":
   "쫴쓰",
"쬈ㅐ":
   "쫴쌔",
"쬈ㅒ":
   "쫴썌",
"쬈ㅔ":
   "쫴쎄",
"쬈ㅖ":
   "쫴쎼",

"쬏ㅏ":
   "쫴하",
"쬏ㅓ":
   "쫴허",
"쬏ㅑ":
   "쫴햐",
"쬏ㅕ":
   "쫴혀",

"쬏ㅜ":
   "쫴후",
"쬏ㅠ":
   "쫴휴",
"쬏ㅗ":
   "쫴호",
"쬏ㅛ":
   "쫴효",

"쬏ㅣ":
   "쫴히",
"쬏ㅡ":
   "쫴흐",
"쬏ㅐ":
   "쫴해",
"쬏ㅒ":
   "쫴햬",
"쬏ㅔ":
   "쫴헤",
"쬏ㅖ":
   "쫴혜",

"쬎ㅏ":
   "쫴파",
"쬎ㅓ":
   "쫴퍼",
"쬎ㅑ":
   "쫴퍄",
"쬎ㅕ":
   "쫴펴",

"쬎ㅜ":
   "쫴푸",
"쬎ㅠ":
   "쫴퓨",
"쬎ㅗ":
   "쫴포",
"쬎ㅛ":
   "쫴표",

"쬎ㅣ":
   "쫴피",
"쬎ㅡ":
   "쫴프",
"쬎ㅐ":
   "쫴패",
"쬎ㅒ":
   "쫴퍠",
"쬎ㅔ":
   "쫴페",
"쬎ㅖ":
   "쫴폐",

"쬍ㅏ":
   "쫴타",
"쬍ㅓ":
   "쫴터",
"쬍ㅑ":
   "쫴탸",
"쬍ㅕ":
   "쫴텨",

"쬍ㅜ":
   "쫴투",
"쬍ㅠ":
   "쫴튜",
"쬍ㅗ":
   "쫴토",
"쬍ㅛ":
   "쫴툐",

"쬍ㅣ":
   "쫴티",
"쬍ㅡ":
   "쫴트",
"쬍ㅐ":
   "쫴태",
"쬍ㅒ":
   "쫴턔",
"쬍ㅔ":
   "쫴테",
"쬍ㅖ":
   "쫴톄",

    
"쬌ㅏ":
   "쫴카",
"쬌ㅓ":
   "쫴커",
"쬌ㅑ":
   "쫴캬",
"쬌ㅕ":
   "쫴켜",

"쬌ㅜ":
   "쫴쿠",
"쬌ㅠ":
   "쫴큐",
"쬌ㅗ":
   "쫴코",
"쬌ㅛ":
   "쫴쿄",

"쬌ㅣ":
   "쫴키",
"쬌ㅡ":
   "쫴크",
"쬌ㅐ":
   "쫴캐",
"쬌ㅒ":
   "쫴컈",
"쬌ㅔ":
   "쫴케",
"쬌ㅖ":
   "쫴켸",

    "쬋ㅏ":
   "쫴차",
"쬋ㅓ":
   "쫴처",
"쬋ㅑ":
   "쫴챠",
"쬋ㅕ":
   "쫴쳐",

"쬋ㅜ":
   "쫴추",
"쬋ㅠ":
   "쫴츄",
"쬋ㅗ":
   "쫴초",
"쬋ㅛ":
   "쫴쵸",

"쬋ㅣ":
   "쫴치",
"쬋ㅡ":
   "쫴츠",
"쬋ㅐ":
   "쫴채",
"쬋ㅒ":
   "쫴챼",
"쬋ㅔ":
   "쫴체",
"쬋ㅖ":
   "쫴쳬",

"쬊ㅏ":
   "쫴자",
"쬊ㅓ":
   "쫴저",
"쬊ㅑ":
   "쫴쟈",
"쬊ㅕ":
   "쫴져",

"쬊ㅜ":
   "쫴주",
"쬊ㅠ":
   "쫴쥬",
"쬊ㅗ":
   "쫴조",
"쬊ㅛ":
   "쫴죠",

"쬊ㅣ":
   "쫴지",
"쬊ㅡ":
   "쫴즈",
"쬊ㅐ":
   "쫴재",
"쬊ㅒ":
   "쫴쟤",
"쬊ㅔ":
   "쫴제",
"쬊ㅖ":
   "쫴졔",

"쬉ㅏ":
   "쫴아",
"쬉ㅓ":
   "쫴어",
"쬉ㅑ":
   "쫴야",
"쬉ㅕ":
   "쫴여",

"쬉ㅜ":
   "쫴우",
"쬉ㅠ":
   "쫴유",
"쬉ㅗ":
   "쫴오",
"쬉ㅛ":
   "쫴요",

"쬉ㅣ":
   "쫴이",
"쬉ㅡ":
   "쫴으",
"쬉ㅐ":
   "쫴애",
"쬉ㅒ":
   "쫴얘",
"쬉ㅔ":
   "쫴에",
"쬉ㅖ":
   "쫴예" 



    }
