# -*- coding: utf-8 -*-
#
dic = {
    '삅ㅏ':
    '쁴바',
    
    '삅ㅓ':
    '쁴버',
    
    "삅ㅑ":
    '쁴뱌',
    
    "삅ㅕ":
    '쁴벼',

     "삅ㅗ":
    '쁴보',

    "삅ㅛ":
    '쁴뵤',

    "삅ㅜ":
    '쁴부',

    "삅ㅠ":
    '쁴뷰',

    "삅ㅣ":
    '쁴비',

    "삅ㅡ":
    '쁴브',

    "삅ㅐ":
    '쁴배',

    "삅ㅒ":
    '쁴뱨',

    "삅ㅔ":
    '쁴베',

    "삅ㅖ":
    '쁴볘',



    '삊ㅏ':
    '쁴자',
    
    '삊ㅓ':
    '쁴저',
    
    "삊ㅑ":
    '쁴쟈',
    
    "삊ㅕ":
    '쁴져',

     "삊ㅗ":
    '쁴조',

    "삊ㅛ":
    '쁴죠',

    "삊ㅜ":
    '쁴주',

    "삊ㅠ":
    '쁴쥬',

    "삊ㅣ":
    '쁴지',

    "삊ㅡ":
    '쁴즈',

    "삊ㅐ":
    '쁴재',

    "삊ㅒ":
    '쁴쟤',

    "삊ㅔ":
    '쁴제',

    "삊ㅖ":
    '쁴졔',


    '쁻ㅏ':
    '쁴다',
    
    '쁻ㅓ':
    '쁴더',
    
    "쁻ㅑ":
    '쁴댜',
    
    "쁻ㅕ":
    '쁴뎌',

     "쁻ㅗ":
    '쁴도',

    "쁻ㅛ":
    '쁴됴',

    "쁻ㅜ":
    '쁴두',

    "쁻ㅠ":
    '쁴듀',

    "쁻ㅣ":
    '쁴디',

    "쁻ㅡ":
    '쁴드',

    "쁻ㅐ":
    '쁴대',

    "쁻ㅒ":
    '쁴댸',

    "쁻ㅔ":
    '쁴데',

    "쁻ㅖ":
    '쁴뎨',



    '쁵ㅏ':
    '쁴가',
    
    '쁵ㅓ':
    '쁴거',
    
    "쁵ㅑ":
    '쁴갸',
    
    "쁵ㅕ":
    '쁴겨',

     "쁵ㅗ":
    '쁴고',

    "쁵ㅛ":
    '쁴교',

    "쁵ㅜ":
    '쁴구',

    "쁵ㅠ":
    '쁴규',

    "쁵ㅣ":
    '쁴기',

    "쁵ㅡ":
    '쁴그',

    "쁵ㅐ":
    '쁴개',

    "쁵ㅒ":
    '쁴걔',

    "쁵ㅔ":
    '쁴게',

    "쁵ㅖ":
    '쁴계',


    '삇ㅏ':
    '쁴사',
    
    '삇ㅓ':
    '쁴서',
    
    "삇ㅑ":
    '쁴샤',
    
    "삇ㅕ":
    '쁴셔',

     "삇ㅗ":
    '쁴소',

    "삇ㅛ":
    '쁴쇼',

    "삇ㅜ":
    '쁴수',

    "삇ㅠ":
    '쁴슈',

    "삇ㅣ":
    '쁴시',

    "삇ㅡ":
    '쁴스',

    "삇ㅐ":
    '쁴새',

    "삇ㅒ":
    '쁴섀',

    "삇ㅔ":
    '쁴세',

    "삇ㅖ":
    '쁴셰',


    '삄ㅏ':
    '쁴마',
    
    '삄ㅓ':
    '쁴머',
    
    "삄ㅑ":
    '쁴먀',
    
    "삄ㅕ":
    '쁴며',

     "삄ㅗ":
    '쁴모',

    "삄ㅛ":
    '쁴묘',

    "삄ㅜ":
    '쁴무',

    "삄ㅠ":
    '쁴뮤',

    "삄ㅣ":
    '쁴미',

    "삄ㅡ":
    '쁴므',

    "삄ㅐ":
    '쁴매',

    "삄ㅒ":
    '쁴먜',

    "삄ㅔ":
    '쁴메',

    "삄ㅖ":
    '쁴몌',

    
    '쁸ㅏ':
    '쁴나',
    
    '쁸ㅓ':
    '쁴너',
    
    "쁸ㅑ":
    '쁴냐',
    
    "쁸ㅕ":
    '쁴녀',

     "쁸ㅗ":
    '쁴노',

    "쁸ㅛ":
    '쁴뇨',

    "쁸ㅜ":
    '쁴누',

    "쁸ㅠ":
    '쁴뉴',

    "쁸ㅣ":
    '쁴니',

    "쁸ㅡ":
    '쁴느',

    "쁸ㅐ":
    '쁴내',

    "쁸ㅒ":
    '쁴냬',

    "쁸ㅔ":
    '쁴네',

    "쁸ㅖ":
    '쁴녜',

    

     '삉ㅏ':
    '쁴아',
    
    '삉ㅓ':
    '쁴어',
    
    "삉ㅑ":
    '쁴야',
    
    "삉ㅕ":
    '쁴여',

     "삉ㅗ":
    '쁴오',

    "삉ㅛ":
    '쁴요',

    "삉ㅜ":
    '쁴우',

    "삉ㅠ":
    '쁴유',

    "삉ㅣ":
    '쁴이',

    "삉ㅡ":
    '쁴으',

    "삉ㅐ":
    '쁴애',

    "삉ㅒ":
    '쁴얘',

    "삉ㅔ":
    '쁴에',

    "삉ㅖ":
    '쁴예',


    '쁼ㅏ':
    '쁴라',
    
    '쁼ㅓ':
    '쁴러',
    
    "쁼ㅑ":
    '쁴랴',
    
    "쁼ㅕ":
    '쁴려',

     "쁼ㅗ":
    '쁴로',

    "쁼ㅛ":
    '쁴료',

    "쁼ㅜ":
    '쁴루',

    "쁼ㅠ":
    '쁴류',

    "쁼ㅣ":
    '쁴리',

    "쁼ㅡ":
    '쁴르',

    "쁼ㅐ":
    '쁴래',

    "쁼ㅒ":
    '쁴럐',

    "쁼ㅔ":
    '쁴레',

    "쁼ㅖ":
    '쁴례',


    '삏ㅏ':
    '쁴하',
    
    '삏ㅓ':
    '쁴허',
    
    "삏ㅑ":
    '쁴햐',
    
    "삏ㅕ":
    '쁴혀',

     "삏ㅗ":
    '쁴호',

    "삏ㅛ":
    '쁴효',

    "삏ㅜ":
    '쁴후',

    "삏ㅠ":
    '쁴휴',

    "삏ㅣ":
    '쁴히',

    "삏ㅡ":
    '쁴흐',

    "삏ㅐ":
    '쁴해',

    "삏ㅒ":
    '쁴햬',

    "삏ㅔ":
    '쁴헤',

    "삏ㅖ":
    '쁴혜',


     '삌ㅏ':
    '쁴카',
    
    '삌ㅓ':
    '쁴커',
    
    "삌ㅑ":
    '쁴캬',
    
    "삌ㅕ":
    '쁴켜',

     "삌ㅗ":
    '쁴코',

    "삌ㅛ":
    '쁴쿄',

    "삌ㅜ":
    '쁴쿠',

    "삌ㅠ":
    '쁴큐',

    "삌ㅣ":
    '쁴키',

    "삌ㅡ":
    '쁴크',

    "삌ㅐ":
    '쁴캐',

    "삌ㅒ":
    '쁴컈',

    "삌ㅔ":
    '쁴케',

    "삌ㅖ":
    '쁴켸',


     '삍ㅏ':
    '쁴타',
    
    '삍ㅓ':
    '쁴터',
    
    "삍ㅑ":
    '쁴탸',
    
    "삍ㅕ":
    '쁴텨',

     "삍ㅗ":
    '쁴토',

    "삍ㅛ":
    '쁴툐',

    "삍ㅜ":
    '쁴투',

    "삍ㅠ":
    '쁴튜',

    "삍ㅣ":
    '쁴티',

    "삍ㅡ":
    '쁴트',

    "삍ㅐ":
    '쁴태',

    "삍ㅒ":
    '쁴턔',

    "삍ㅔ":
    '쁴테',

    "삍ㅖ":
    '쁴톄',


     '삋ㅏ':
    '쁴차',
    
    '삋ㅓ':
    '쁴처',
    
    "삋ㅑ":
    '쁴챠',
    
    "삋ㅕ":
    '쁴쳐',

     "삋ㅗ":
    '쁴초',

    "삋ㅛ":
    '쁴쵸',

    "삋ㅜ":
    '쁴추',

    "삋ㅠ":
    '쁴츄',

    "삋ㅣ":
    '쁴치',

    "삋ㅡ":
    '쁴츠',

    "삋ㅐ":
    '쁴채',

    "삋ㅒ":
    '쁴챼',

    "삋ㅔ":
    '쁴체',

    "삋ㅖ":
    '쁴쳬',


     '삎ㅏ':
    '쁴파',
    
    '삎ㅓ':
    '쁴퍼',
    
    "삎ㅑ":
    '쁴퍄',
    
    "삎ㅕ":
    '쁴펴',

     "삎ㅗ":
    '쁴포',

    "삎ㅛ":
    '쁴표',

    "삎ㅜ":
    '쁴푸',

    "삎ㅠ":
    '쁴퓨',

    "삎ㅣ":
    '쁴피',

    "삎ㅡ":
    '쁴프',

    "삎ㅐ":
    '쁴패',

    "삎ㅒ":
    '쁴퍠',

    "삎ㅔ":
    '쁴페',

    "삎ㅖ":
    '쁴폐',

    

     '쁶ㅏ':
    '쁴까',
    
    '쁶ㅓ':
    '쁴꺼',
    
    "쁶ㅑ":
    '쁴꺄',
    
    "쁶ㅕ":
    '쁴껴',

     "쁶ㅗ":
    '쁴꼬',

    "쁶ㅛ":
    '쁴꾜',

    "쁶ㅜ":
    '쁴꾸',

    "쁶ㅠ":
    '쁴뀨',

    "쁶ㅣ":
    '쁴끼',

    "쁶ㅡ":
    '쁴끄',

    "쁶ㅐ":
    '쁴깨',

    "쁶ㅒ":
    '쁴꺠',

    "쁶ㅔ":
    '쁴께',

    "쁶ㅖ":
    '쁴꼐',


    '삈ㅏ':
    '쁴싸',
    
    '삈ㅓ':
    '쁴써',
    
    "삈ㅑ":
    '쁴쌰',
    
    "삈ㅕ":
    '쁴쎠',

     "삈ㅗ":
    '쁴쏘',

    "삈ㅛ":
    '쁴쑈',

    "삈ㅜ":
    '쁴쑤',

    "삈ㅠ":
    '쁴쓔',

    "삈ㅣ":
    '쁴씨',

    "삈ㅡ":
    '쁴쓰',

    "삈ㅐ":
    '쁴쌔',

    "삈ㅒ":
    '쁴썌',

    "삈ㅔ":
    '쁴쎄',

    "삈ㅖ":
    '쁴쎼',

    

    '쁷ㅏ':
        '쁵사',
    
    '쁷ㅓ':
        '쁵서',
    
    "쁷ㅑ":
        '쁵샤',
    
    "쁷ㅕ":
        '쁵셔',

     "쁷ㅗ":
        '쁵소',

    "쁷ㅛ":
        '쁵쇼',

    "쁷ㅜ":
        '쁵수',

    "쁷ㅠ":
        '쁵슈',

    "쁷ㅣ":
        '쁵시',

    "쁷ㅡ":
        '쁵스',

    "쁷ㅐ":
        '쁵새',

    "쁷ㅒ":
        '쁵섀',

    "쁷ㅔ":
        '쁵세',

    "쁷ㅖ":
        '쁵셰',

    '쁹ㅏ':
        '쁸자',
    
    '쁹ㅓ':
        '쁸저',
    
    "쁹ㅑ":
        '쁸쟈',
    
    "쁹ㅕ":
        '쁸져',

    "쁹ㅗ":
        '쁸조',

    "쁹ㅛ":
        '쁸죠',

    "쁹ㅜ":
        '쁸주',

    "쁹ㅠ":
        '쁸쥬',

    "쁹ㅣ":
        '쁸지',

    "쁹ㅡ":
        '쁸즈',

    "쁹ㅐ":
        '쁸재',

    "쁹ㅒ":
        '쁸쟤',

    "쁹ㅔ":
        '쁸제',

    "쁹ㅖ":
        '쁸졔',


    '쁺ㅏ':
        '쁸하',
    
    '쁺ㅓ':
        '쁸허',
    
    "쁺ㅑ":
        '쁸햐',
    
    "쁺ㅕ":
        '쁸혀',

    "쁺ㅗ":
        '쁸호',

    "쁺ㅛ":
        '쁸효',

    "쁺ㅜ":
        '쁸후',

    "쁺ㅠ":
        '쁸휴',

    "쁺ㅣ":
        '쁸히',

    "쁺ㅡ":
        '쁸흐',

    "쁺ㅐ":
        '쁸해',

    "쁺ㅒ":
        '쁸햬',

    "쁺ㅔ":
        '쁸헤',

    "쁺ㅖ":
        '쁸혜',
    

    '쁽ㅏ':
        '쁼가',
    
    '쁽ㅓ':
        '쁼거',
    
    "쁽ㅑ":
        '쁼갸',
    
    "쁽ㅕ":
        '쁼겨',

    "쁽ㅗ":
        '쁼고',

    "쁽ㅛ":
        '쁼교',

    "쁽ㅜ":
        '쁼구',

    "쁽ㅠ":
        '쁼규',

    "쁽ㅣ":
        '쁼기',

    "쁽ㅡ":
        '쁼그',

    "쁽ㅐ":
        '쁼개',

    "쁽ㅒ":
        '쁼걔',

    "쁽ㅔ":
        '쁼게',

    "쁽ㅖ":
        '쁼계',

    '쁾ㅏ':
        '쁼마',
    
    '쁾ㅓ':
        '쁼머',
    
    "쁾ㅑ":
        '쁼먀',
    
    "쁾ㅕ":
        '쁼며',

    "쁾ㅗ":
        '쁼모',

    "쁾ㅛ":
        '쁼묘',

    "쁾ㅜ":
        '쁼무',

    "쁾ㅠ":
        '쁼뮤',

    "쁾ㅣ":
        '쁼미',

    "쁾ㅡ":
        '쁼므',

    "쁾ㅐ":
        '쁼매',

    "쁾ㅒ":
        '쁼먜',

    "쁾ㅔ":
        '쁼메',

    "쁾ㅖ":
        '쁼몌',

    '쁿ㅏ':
        '쁸바',
    
    '쁿ㅓ':
        '쁼버',
    
    "쁿ㅑ":
        '쁼뱌',
    
    "쁿ㅕ":
        '쁼벼',

    "쁿ㅗ":
        '쁼보',

    "쁿ㅛ":
        '쁼뵤',

    "쁿ㅜ":
        '쁼부',

    "쁿ㅠ":
        '쁼뷰',

    "쁿ㅣ":
        '쁼비',

    "쁿ㅡ":
        '쁼브',

    "쁿ㅐ":
        '쁼배',

    "쁿ㅒ":
        '쁼뱨',

    "쁿ㅔ":
        '쁼베',

    "쁿ㅖ":
        '쁼볘',


    '삀ㅏ':
        '쁼사',
    
    '삀ㅓ':
        '쁼서',
    
    "삀ㅑ":
        '쁼샤',
    
    "삀ㅕ":
        '쁼셔',

    "삀ㅗ":
        '쁼소',

    "삀ㅛ":
        '쁼쇼',

    "삀ㅜ":
        '쁼수',

    "삀ㅠ":
        '쁼슈',

    "삀ㅣ":
        '쁼시',

    "삀ㅡ":
        '쁼스',

    "삀ㅐ":
        '쁼새',

    "삀ㅒ":
        '쁼섀',

    "삀ㅔ":
        '쁼세',

    "삀ㅖ":
        '쁼셰',



    '삁ㅏ':
        '쁼타',
    
    '삁ㅓ':
        '쁼터',
    
    "삁ㅑ":
        '쁼탸',
    
    "삁ㅕ":
        '쁼텨',

    "삁ㅗ":
        '쁼토',

    "삁ㅛ":
        '쁼툐',

    "삁ㅜ":
        '쁼투',

    "삁ㅠ":
        '쁼튜',

    "삁ㅣ":
        '쁼티',

    "삁ㅡ":
        '쁼트',

    "삁ㅐ":
        '쁼태',

    "삁ㅒ":
        '쁼턔',

    "삁ㅔ":
        '쁼테',

    "삁ㅖ":
        '쁼톄',


    '삂ㅏ':
        '쁼파',
    
    '삂ㅓ':
        '쁼퍼',
    
    "삂ㅑ":
        '쁼퍄',
    
    "삂ㅕ":
        '쁼펴',

    "삂ㅗ":
        '쁼포',

    "삂ㅛ":
        '쁼표',

    "삂ㅜ":
        '쁼푸',

    "삂ㅠ":
        '쁼퓨',

    "삂ㅣ":
        '쁼피',

    "삂ㅡ":
        '쁼프',

    "삂ㅐ":
        '쁼패',

    "삂ㅒ":
        '쁼퍠',

    "삂ㅔ":
        '쁼페',

    "삂ㅖ":
        '쁼폐',



    '삃ㅏ':
        '쁼하',
    
    '삃ㅓ':
        '쁼허',
    
    "삃ㅑ":
        '쁼햐',
    
    "삃ㅕ":
        '쁼혀',

    "삃ㅗ":
        '쁼호',

    "삃ㅛ":
        '쁼효',

    "삃ㅜ":
        '쁼후',

    "삃ㅠ":
        '쁼휴',

    "삃ㅣ":
        '쁼히',

    "삃ㅡ":
        '쁼흐',

    "삃ㅐ":
        '쁼해',

    "삃ㅒ":
        '쁼햬',

    "삃ㅔ":
        '쁼헤',

    "삃ㅖ":
        '쁼혜',

    '삆ㅏ':
        '삅사',
    
    '삆ㅓ':
        '삅서',
    
    "삆ㅑ":
        '삅샤',
    
    "삆ㅕ":
        '삅셔',

    "삆ㅗ":
        '삅소',

    "삆ㅛ":
        '삅쇼',

    "삆ㅜ":
        '삅수',

    "삆ㅠ":
        '삅슈',

    "삆ㅣ":
        '삅시',

    "삆ㅡ":
        '삅스',

    "삆ㅐ":
        '삅새',

    "삆ㅒ":
        '삅섀',

    "삆ㅔ":
        '삅세',

    "삆ㅖ":
        '삅셰',

    





    
    '찁ㅏ':
    '쯰바',
    
    '찁ㅓ':
    '쯰버',
    
    "찁ㅑ":
    '쯰뱌',
    
    "찁ㅕ":
    '쯰벼',

     "ㅗ":
    '쯰보',

    "찁ㅛ":
    '쯰뵤',

    "찁ㅜ":
    '쯰부',

    "찁ㅠ":
    '쯰뷰',

    "찁ㅣ":
    '쯰비',

    "찁ㅡ":
    '쯰브',

    "찁ㅐ":
    '쯰배',

    "찁ㅒ":
    '쯰뱨',

    "찁ㅔ":
    '쯰베',

    "찁ㅖ":
    '쯰볘',



    '찆ㅏ':
    '쯰자',
    
    '찆ㅓ':
    '쯰저',
    
    "찆ㅑ":
    '쯰쟈',
    
    "찆ㅕ":
    '쯰져',

     "찆ㅗ":
    '쯰조',

    "찆ㅛ":
    '쯰죠',

    "찆ㅜ":
    '쯰주',

    "찆ㅠ":
    '쯰쥬',

    "찆ㅣ":
    '쯰지',

    "찆ㅡ":
    '쯰즈',

    "찆ㅐ":
    '쯰재',

    "찆ㅒ":
    '쯰쟤',

    "찆ㅔ":
    '쯰제',

    "찆ㅖ":
    '쯰졔',


    '쯷ㅏ':
    '쯰다',
    
    '쯷ㅓ':
    '쯰더',
    
    "쯷ㅑ":
    '쯰댜',
    
    "쯷ㅕ":
    '쯰뎌',

     "쯷ㅗ":
    '쯰도',

    "쯷ㅛ":
    '쯰됴',

    "쯷ㅜ":
    '쯰두',

    "쯷ㅠ":
    '쯰듀',

    "쯷ㅣ":
    '쯰디',

    "쯷ㅡ":
    '쯰드',

    "쯷ㅐ":
    '쯰대',

    "쯷ㅒ":
    '쯰댸',

    "쯷ㅔ":
    '쯰데',

    "쯷ㅖ":
    '쯰뎨',



    '쯱ㅏ':
    '쯰가',
    
    '쯱ㅓ':
    '쯰거',
    
    "쯱ㅑ":
    '쯰갸',
    
    "쯱ㅕ":
    '쯰겨',

     "쯱ㅗ":
    '쯰고',

    "쯱ㅛ":
    '쯰교',

    "쯱ㅜ":
    '쯰구',

    "쯱ㅠ":
    '쯰규',

    "쯱ㅣ":
    '쯰기',

    "쯱ㅡ":
    '쯰그',

    "쯱ㅐ":
    '쯰개',

    "쯱ㅒ":
    '쯰걔',

    "쯱ㅔ":
    '쯰게',

    "쯱ㅖ":
    '쯰계',


    '찃ㅏ':
    '쯰사',
    
    '찃ㅓ':
    '쯰서',
    
    "찃ㅑ":
    '쯰샤',
    
    "찃ㅕ":
    '쯰셔',

     "찃ㅗ":
    '쯰소',

    "찃ㅛ":
    '쯰쇼',

    "찃ㅜ":
    '쯰수',

    "찃ㅠ":
    '쯰슈',

    "찃ㅣ":
    '쯰시',

    "찃ㅡ":
    '쯰스',

    "찃ㅐ":
    '쯰새',

    "찃ㅒ":
    '쯰섀',

    "찃ㅔ":
    '쯰세',

    "찃ㅖ":
    '쯰셰',


    '찀ㅏ':
    '쯰마',
    
    '찀ㅓ':
    '쯰머',
    
    "찀ㅑ":
    '쯰먀',
    
    "찀ㅕ":
    '쯰며',

     "찀ㅗ":
    '쯰모',

    "찀ㅛ":
    '쯰묘',

    "찀ㅜ":
    '쯰무',

    "찀ㅠ":
    '쯰뮤',

    "찀ㅣ":
    '쯰미',

    "찀ㅡ":
    '쯰므',

    "찀ㅐ":
    '쯰매',

    "찀ㅒ":
    '쯰먜',

    "찀ㅔ":
    '쯰메',

    "찀ㅖ":
    '쯰몌',

    
    '쯴ㅏ':
    '쯰나',
    
    '쯴ㅓ':
    '쯰너',
    
    "쯴ㅑ":
    '쯰냐',
    
    "쯴ㅕ":
    '쯰녀',

     "쯴ㅗ":
    '쯰노',

    "쯴ㅛ":
    '쯰뇨',

    "쯴ㅜ":
    '쯰누',

    "쯴ㅠ":
    '쯰뉴',

    "쯴ㅣ":
    '쯰니',

    "쯴ㅡ":
    '쯰느',

    "쯴ㅐ":
    '쯰내',

    "쯴ㅒ":
    '쯰냬',

    "쯴ㅔ":
    '쯰네',

    "쯴ㅖ":
    '쯰녜',

    

     '찅ㅏ':
    '쯰아',
    
    '찅ㅓ':
    '쯰어',
    
    "찅ㅑ":
    '쯰야',
    
    "찅ㅕ":
    '쯰여',

     "찅ㅗ":
    '쯰오',

    "찅ㅛ":
    '쯰요',

    "찅ㅜ":
    '쯰우',

    "찅ㅠ":
    '쯰유',

    "찅ㅣ":
    '쯰이',

    "찅ㅡ":
    '쯰으',

    "찅ㅐ":
    '쯰애',

    "찅ㅒ":
    '쯰얘',

    "찅ㅔ":
    '쯰에',

    "찅ㅖ":
    '쯰예',


    '쯸ㅏ':
    '쯰라',
    
    '쯸ㅓ':
    '쯰러',
    
    "쯸ㅑ":
    '쯰랴',
    
    "쯸ㅕ":
    '쯰려',

     "쯸ㅗ":
    '쯰로',

    "쯸ㅛ":
    '쯰료',

    "쯸ㅜ":
    '쯰루',

    "쯸ㅠ":
    '쯰류',

    "쯸ㅣ":
    '쯰리',

    "쯸ㅡ":
    '쯰르',

    "쯸ㅐ":
    '쯰래',

    "쯸ㅒ":
    '쯰럐',

    "쯸ㅔ":
    '쯰레',

    "쯸ㅖ":
    '쯰례',


    '찋ㅏ':
    '쯰하',
    
    '찋ㅓ':
    '쯰허',
    
    "찋ㅑ":
    '쯰햐',
    
    "찋ㅕ":
    '쯰혀',

     "찋ㅗ":
    '쯰호',

    "찋ㅛ":
    '쯰효',

    "찋ㅜ":
    '쯰후',

    "찋ㅠ":
    '쯰휴',

    "찋ㅣ":
    '쯰히',

    "찋ㅡ":
    '쯰흐',

    "찋ㅐ":
    '쯰해',

    "찋ㅒ":
    '쯰햬',

    "찋ㅔ":
    '쯰헤',

    "찋ㅖ":
    '쯰혜',


     '찈ㅏ':
    '쯰카',
    
    '찈ㅓ':
    '쯰커',
    
    "찈ㅑ":
    '쯰캬',
    
    "찈ㅕ":
    '쯰켜',

     "찈ㅗ":
    '쯰코',

    "찈ㅛ":
    '쯰쿄',

    "찈ㅜ":
    '쯰쿠',

    "찈ㅠ":
    '쯰큐',

    "찈ㅣ":
    '쯰키',

    "찈ㅡ":
    '쯰크',

    "찈ㅐ":
    '쯰캐',

    "찈ㅒ":
    '쯰컈',

    "찈ㅔ":
    '쯰케',

    "찈ㅖ":
    '쯰켸',


     '찉ㅏ':
    '쯰타',
    
    '찉ㅓ':
    '쯰터',
    
    "찉ㅑ":
    '쯰탸',
    
    "찉ㅕ":
    '쯰텨',

     "찉ㅗ":
    '쯰토',

    "찉ㅛ":
    '쯰툐',

    "찉ㅜ":
    '쯰투',

    "찉ㅠ":
    '쯰튜',

    "찉ㅣ":
    '쯰티',

    "찉ㅡ":
    '쯰트',

    "찉ㅐ":
    '쯰태',

    "찉ㅒ":
    '쯰턔',

    "찉ㅔ":
    '쯰테',

    "찉ㅖ":
    '쯰톄',


     '찇ㅏ':
    '쯰차',
    
    '찇ㅓ':
    '쯰처',
    
    "찇ㅑ":
    '쯰챠',
    
    "찇ㅕ":
    '쯰쳐',

     "찇ㅗ":
    '쯰초',

    "찇ㅛ":
    '쯰쵸',

    "찇ㅜ":
    '쯰추',

    "찇ㅠ":
    '쯰츄',

    "찇ㅣ":
    '쯰치',

    "찇ㅡ":
    '쯰츠',

    "찇ㅐ":
    '쯰채',

    "찇ㅒ":
    '쯰챼',

    "찇ㅔ":
    '쯰체',

    "찇ㅖ":
    '쯰쳬',


     '찊ㅏ':
    '쯰파',
    
    '찊ㅓ':
    '쯰퍼',
    
    "찊ㅑ":
    '쯰퍄',
    
    "찊ㅕ":
    '쯰펴',

     "찊ㅗ":
    '쯰포',

    "찊ㅛ":
    '쯰표',

    "찊ㅜ":
    '쯰푸',

    "찊ㅠ":
    '쯰퓨',

    "찊ㅣ":
    '쯰피',

    "찊ㅡ":
    '쯰프',

    "찊ㅐ":
    '쯰패',

    "찊ㅒ":
    '쯰퍠',

    "찊ㅔ":
    '쯰페',

    "찊ㅖ":
    '쯰폐',

    

     '쯲ㅏ':
    '쯰까',
    
    '쯲ㅓ':
    '쯰꺼',
    
    "쯲ㅑ":
    '쯰꺄',
    
    "쯲ㅕ":
    '쯰껴',

     "쯲ㅗ":
    '쯰꼬',

    "쯲ㅛ":
    '쯰꾜',

    "쯲ㅜ":
    '쯰꾸',

    "쯲ㅠ":
    '쯰뀨',

    "쯲ㅣ":
    '쯰끼',

    "쯲ㅡ":
    '쯰끄',

    "쯲ㅐ":
    '쯰깨',

    "쯲ㅒ":
    '쯰꺠',

    "쯲ㅔ":
    '쯰께',

    "쯲ㅖ":
    '쯰꼐',


     '찄ㅏ':
    '쯰싸',
    
    '찄ㅓ':
    '쯰써',
    
    "찄ㅑ":
    '쯰쌰',
    
    "찄ㅕ":
    '쯰쎠',

     "찄ㅗ":
    '쯰쏘',

    "찄ㅛ":
    '쯰쑈',

    "찄ㅜ":
    '쯰쑤',

    "찄ㅠ":
    '쯰쓔',

    "찄ㅣ":
    '쯰씨',

    "찄ㅡ":
    '쯰쓰',

    "찄ㅐ":
    '쯰쌔',

    "찄ㅒ":
    '쯰썌',

    "찄ㅔ":
    '쯰쎄',

    "찄ㅖ":
    '쯰쎼',


    '쯳ㅏ':
        '쯱사',
    
    '쯳ㅓ':
        '쯱서',
    
    "쯳ㅑ":
        '쯱샤',
    
    "쯳ㅕ":
        '쯱셔',

    "쯳ㅗ":
        '쯱소',

    "쯳ㅛ":
        '쯱쇼',

    "쯳ㅜ":
        '쯱수',

    "쯳ㅠ":
        '쯱슈',

    "쯳ㅣ":
        '쯱시',

    "쯳ㅡ":
        '쯱스',

    "쯳ㅐ":
        '쯱새',

    "쯳ㅒ":
        '쯱섀',

    "쯳ㅔ":
        '쯱세',

    "쯳ㅖ":
        '쯱셰',

    '쯵ㅏ':
        '쯴자',
    
    '쯵ㅓ':
        '쯴저',
    
    "쯵ㅑ":
        '쯴쟈',
    
    "쯵ㅕ":
        '쯴져',

    "쯵ㅗ":
        '쯴조',

    "쯵ㅛ":
        '쯴죠',

    "쯵ㅜ":
        '쯴주',

    "쯵ㅠ":
        '쯴쥬',

    "쯵ㅣ":
        '쯴지',

    "쯵ㅡ":
        '쯴즈',

    "쯵ㅐ":
        '쯴재',

    "쯵ㅒ":
        '쯴쟤',

    "쯵ㅔ":
        '쯴제',

    "쯵ㅖ":
        '쯴졔',


    '쯶ㅏ':
        '쯴하',
    
    '쯶ㅓ':
        '쯴허',
    
    "쯶ㅑ":
        '쯴햐',
    
    "쯶ㅕ":
        '쯴혀',

    "쯶ㅗ":
        '쯴호',

    "쯶ㅛ":
        '쯴효',

    "쯶ㅜ":
        '쯴후',

    "쯶ㅠ":
        '쯴휴',

    "쯶ㅣ":
        '쯴히',

    "쯶ㅡ":
        '쯴흐',

    "쯶ㅐ":
        '쯴해',

    "쯶ㅒ":
        '쯴햬',

    "쯶ㅔ":
        '쯴헤',

    "쯶ㅖ":
        '쯴혜',
    

    '쯹ㅏ':
        '쁼가',
    
    '쯹ㅓ':
        '쁼거',
    
    "쯹ㅑ":
        '쁼갸',
    
    "쯹ㅕ":
        '쁼겨',

    "쯹ㅗ":
        '쁼고',

    "쯹ㅛ":
        '쁼교',

    "쯹ㅜ":
        '쁼구',

    "쯹ㅠ":
        '쁼규',

    "쯹ㅣ":
        '쯸기',

    "쯹ㅡ":
        '쯸그',

    "쯹ㅐ":
        '쯸개',

    "쯹ㅒ":
        '쯸걔',

    "쯹ㅔ":
        '쯸게',

    "쯹ㅖ":
        '쯸계',

    '쯺ㅏ':
        '쯸마',
    
    '쯺ㅓ':
        '쯸머',
    
    "쯺ㅑ":
        '쁼먀',
    
    "쯺ㅕ":
        '쁼며',

    "쯺ㅗ":
        '쯸모',

    "쯺ㅛ":
        '쯸묘',

    "쯺ㅜ":
        '쯸무',

    "쯺ㅠ":
        '쯸뮤',

    "쯺ㅣ":
        '쯸미',

    "쯺ㅡ":
        '쯸므',

    "쯺ㅐ":
        '쯸매',

    "쯺ㅒ":
        '쯸먜',

    "쯺ㅔ":
        '쯸메',

    "쯺ㅖ":
        '쯸몌',

    '쯻ㅏ':
        '쯸바',
    
    '쯻ㅓ':
        '쯸버',
    
    "쯻ㅑ":
        '쯸뱌',
    
    "쯻ㅕ":
        '쯸벼',

    "쯻ㅗ":
        '쯸보',

    "쯻ㅛ":
        '쯸뵤',

    "쯻ㅜ":
        '쯸부',

    "쯻ㅠ":
        '쯸뷰',

    "쯻ㅣ":
        '쯸비',

    "쁿ㅡ":
        '쯸브',

    "쯻ㅐ":
        '쯸배',

    "쯻ㅒ":
        '쯸뱨',

    "쯻ㅔ":
        '쯸베',

    "쯻ㅖ":
        '쯸볘',


    '쯼ㅏ':
        '쯸사',
    
    '쯼ㅓ':
        '쯸서',
    
    "쯼ㅑ":
        '쯸샤',
    
    "쯼ㅕ":
        '쯸셔',

    "쯼ㅗ":
        '쯸소',

    "쯼ㅛ":
        '쯸쇼',

    "쯼ㅜ":
        '쯸수',

    "쯼ㅠ":
        '쯸슈',

    "쯼ㅣ":
        '쯸시',

    "쯼ㅡ":
        '쯸스',

    "쯼ㅐ":
        '쯸새',

    "쯼ㅒ":
        '쯸섀',

    "쯼ㅔ":
        '쯸세',

    "쯼ㅖ":
        '쯸셰',



    '쯽ㅏ':
        '쯸타',
    
    '쯽ㅓ':
        '쯸터',
    
    "쯽ㅑ":
        '쯸탸',
    
    "쯽ㅕ":
        '쯸텨',

    "쯽ㅗ":
        '쯸토',

    "쯽ㅛ":
        '쯸툐',

    "쯽ㅜ":
        '쯸투',

    "쯽ㅠ":
        '쯸튜',

    "쯽ㅣ":
        '쯸티',

    "쯽ㅡ":
        '쯸트',

    "쯽ㅐ":
        '쯸태',

    "쯽ㅒ":
        '쯸턔',

    "쯽ㅔ":
        '쯸테',

    "쯽ㅖ":
        '쯸톄',


    '쯾ㅏ':
        '쯸파',
    
    '쯾ㅓ':
        '쯸퍼',
    
    "쯾ㅑ":
        '쯸퍄',
    
    "쯾ㅕ":
        '쯸펴',

    "쯾ㅗ":
        '쯸포',

    "쯾ㅛ":
        '쯸표',

    "쯾ㅜ":
        '쯸푸',

    "쯾ㅠ":
        '쯸퓨',

    "쯾ㅣ":
        '쯸피',

    "쯾ㅡ":
        '쯸프',

    "쯾ㅐ":
        '쯸패',

    "쯾ㅒ":
        '쯸퍠',

    "쯾ㅔ":
        '쯸페',

    "쯾ㅖ":
        '쯸폐',



    '쯿ㅏ':
        '쯸하',
    
    '쯿ㅓ':
        '쯸허',
    
    "쯿ㅑ":
        '쯸햐',
    
    "쯿ㅕ":
        '쯸혀',

    "쯿ㅗ":
        '쯸호',

    "쯿ㅛ":
        '쯸효',

    "쯿ㅜ":
        '쯸후',

    "쯿ㅠ":
        '쯸휴',

    "쯿ㅣ":
        '쯸히',

    "쯿ㅡ":
        '쯸흐',

    "쯿ㅐ":
        '쯸해',

    "쯿ㅒ":
        '쯸햬',

    "쯿ㅔ":
        '쯸헤',

    "쯿ㅖ":
        '쯸혜',

    '찂ㅏ':
        '찁사',
    
    '찂ㅓ':
        '찁서',
    
    "찂ㅑ":
        '찁샤',
    
    "찂ㅕ":
        '찁셔',

    "찂ㅗ":
        '찁소',

    "찂ㅛ":
        '찁쇼',

    "찂ㅜ":
        '찁수',

    "찂ㅠ":
        '찁슈',

    "찂ㅣ":
        '찁시',

    "찂ㅡ":
        '찁스',

    "찂ㅐ":
        '찁새',

    "찂ㅒ":
        '찁섀',

    "찂ㅔ":
        '찁세',

    "찂ㅖ":
        '찁셰',
      
    
    "띕ㅏ":
        "띄바",
    "띕ㅓ":
        "띄버",
    "띕ㅑ":
        '띄뱌',    
    "띕ㅕ":
        '띄벼',
    "띕ㅗ":
        '띄보',
    "띕ㅛ":
        '띄뵤,
    "띕ㅜ":
        '띄부',
    "띕ㅠ":
        '띄뷰',
    "띕ㅣ":
        '띄비',
    "띕ㅡ":
        '띄브',
    "띕ㅐ":
        '띄배',
    "띕ㅒ":
        '띄ㅒ',
    "띕ㅔ":
        '띄베',
    "띕ㅖ":
        '띄볘',

    "띚ㅏ":
        "띄자",
    "띚ㅓ":
        "띄저",
    "띚ㅑ":
        '띄쟈',    
    "띚ㅕ":
        '띄져',
    "띚ㅗ":
        '띄조',
    "띚ㅛ":
        '띄죠,
    "띚ㅜ":
        '띄주',
    "띚ㅠ":
        '띄쥬',
    "띚ㅣ":
        '띄지',
    "띚ㅡ":
        '띄즈',
    "띚ㅐ":
        '띄재',
    "띚ㅒ":
        '띄쟤',
    "띚ㅔ":
        '띄제',
    "띚ㅖ":
        '띄졔',

    "띋ㅏ":
        "띄다",
    "띋ㅓ":
        "띄더",
    "띋ㅑ":
        '띄댜',    
    "띋ㅕ":
        '띄뎌',
    "띋ㅗ":
        '띄도',
    "띋ㅛ":
        '띄됴,
    "띋ㅜ":
        '띄두',
    "띋ㅠ":
        '띄듀',
    "띋ㅣ":
        '띄디',
    "띋ㅡ":
        '띄드',
    "띋ㅐ":
        '띄대',
    "띋ㅒ":
        '띄댸',
    "띋ㅔ":
        '띄데',
    "띋ㅖ":
        '띄뎨',

    "띅ㅏ":
        "띄가",
    "띅ㅓ":
        "끠거",
    "띅ㅑ":
        '끠갸',    
    "띅ㅕ":
        '끠겨',
    "띅ㅗ":
        '끠고',
    "띅ㅛ":
        '끠교,
    "띅ㅜ":
        '끠구',
    "띅ㅠ":
        '끠규',
    "띅ㅣ":
        '끠기',
    "띅ㅡ":
        '끠그',
    "띅ㅐ":
        '끠개',
    "띅ㅒ":
        '끠걔',
    "띅ㅔ":
        '끠게',
    "띅ㅖ":
        '끠계',

    "띗ㅏ":
        "띄사",
    "띗ㅓ":
        "띄서",
    "띗ㅑ":
        '띄샤',    
    "띗ㅕ":
        '띄셔',
    "띗ㅗ":
        '띄소',
    "띗ㅛ":
        '띄쇼,
    "띗ㅜ":
        '띄수',
    "띗ㅠ":
        '띄슈',
    "띗ㅣ":
        '띄시',
    "띗ㅡ":
        '띄스',
    "띗ㅐ":
        '띄새',
    "띗ㅒ":
        '띄섀',
    "띗ㅔ":
        '띄세',
    "띗ㅖ":
        '띄셰',

    "띔ㅏ":
        "띄마",
    "띔ㅓ":
        "띄머",
    "띔ㅑ":
        '띄먀',    
    "띔ㅕ":
        '띄며',
    "띔ㅗ":
        '띄모',
    "띔ㅛ":
        '띄묘,
    "띔ㅜ":
        '띄무',
    "띔ㅠ":
        '띄뮤',
    "띔ㅣ":
        '띄미',
    "띔ㅡ":
        '띄므',
    "띔ㅐ":
        '띄매',
    "띔ㅒ":
        '띄먜',
    "띔ㅔ":
        '띄메',
    "띔ㅖ":
        '띄몌',

    "띈ㅏ":
        "띄나",
    "띈ㅓ":
        "띄너",
    "띈ㅑ":
        '띄냐',    
    "띈ㅕ":
        '띄녀',
    "띈ㅗ":
        '띄노',
    "띈ㅛ":
        '띄뇨,
    "띈ㅜ":
        '띄누',
    "띈ㅠ":
        '띄뉴',
    "띈ㅣ":
        '띄니',
    "띈ㅡ":
        '띄느',
    "띈ㅐ":
        '띄내',
    "띈ㅒ":
        '띄냬',
    "띈ㅔ":
        '띄네',
    "띈ㅖ":
        '띄녜',

    "띙ㅏ":
        "띄아",
    "띙ㅓ":
        "띄어",
    "띙ㅑ":
        '띄야',    
    "띙ㅕ":
        '띄여',
    "띙ㅗ":
        '띄오',
    "띙ㅛ":
        '띄요,
    "띙ㅜ":
        '띄우',
    "띙ㅠ":
        '띄유',
    "띙ㅣ":
        '띄이',
    "띙ㅡ":
        '띄으',
    "띙ㅐ":
        '띄애',
    "띙ㅒ":
        '띄얘',
    "띙ㅔ":
        '띄에',
    "띙ㅖ":
        '띄예',

    "띌ㅏ":
        "띄라",
    "띌ㅓ":
        "띄러",
    "띌ㅑ":
        '띄랴',    
    "띌ㅕ":
        '띄려',
    "띌ㅗ":
        '띄로',
    "띌ㅛ":
        '띄료,
    "띌ㅜ":
        '띄루',
    "띌ㅠ":
        '띄류',
    "띌ㅣ":
        '띄리',
    "띌ㅡ":
        '띄르',
    "띌ㅐ":
        '띄래',
    "띌ㅒ":
        '띄럐',
    "띌ㅔ":
        '띄레',
    "띌ㅖ":
        '띄례',

    "띟ㅏ":
        "띄하",
    "띟ㅓ":
        "띄허",
    "띟ㅑ":
        '띄햐',    
    "띟ㅕ":
        '띄혀',
    "띟ㅗ":
        '띄호',
    "띟ㅛ":
        '띄효,
    "띟ㅜ":
        '띄후',
    "띟ㅠ":
        '띄휴',
    "띟ㅣ":
        '띄히',
    "띟ㅡ":
        '띄흐',
    "띟ㅐ":
        '띄해',
    "띟ㅒ":
        '띄햬',
    "띟ㅔ":
        '띄헤',
    "띟ㅖ":
        '띄혜',

    "띜ㅏ":
        "띄카",
    "띜ㅓ":
        "띄커",
    "띜ㅑ":
        '띄캬',    
    "띜ㅕ":
        '띄켜',
    "띜ㅗ":
        '띄코',
    "띜ㅛ":
        '띄쿄,
    "띜ㅜ":
        '띄쿠',
    "띜ㅠ":
        '띄큐',
    "띜ㅣ":
        '띄키',
    "띜ㅡ":
        '띄크',
    "띜ㅐ":
        '띄캐',
    "띜ㅒ":
        '띄컈',
    "띜ㅔ":
        '띄케',
    "띜ㅖ":
        '띄켸',

    "띝ㅏ":
        "띄타",
    "띝ㅓ":
        "띄터",
    "띝ㅑ":
        '띄탸',    
    "띝ㅕ":
        '띄텨',
    "띝ㅗ":
        '띄토',
    "띝ㅛ":
        '띄툐,
    "띝ㅜ":
        '띄투',
    "띝ㅠ":
        '띄튜',
    "띝ㅣ":
        '띄티',
    "띝ㅡ":
        '띄트',
    "띝ㅐ":
        '띄태',
    "띝ㅒ":
        '띄턔',
    "띝ㅔ":
        '띄테',
    "띝ㅖ":
        '띄톄',

    "띛ㅏ":
        "띄차",
    "띛ㅓ":
        "띄처",
    "띛ㅑ":
        '띄챠',    
    "띛ㅕ":
        '띄쳐',
    "띛ㅗ":
        '띄초',
    "띛ㅛ":
        '띄쵸,
    "띛ㅜ":
        '띄추',
    "띛ㅠ":
        '띄츄',
    "띛ㅣ":
        '띄치',
    "띛ㅡ":
        '띄츠',
    "띛ㅐ":
        '띄채',
    "띛ㅒ":
        '띄챼',
    "띛ㅔ":
        '띄체',
    "띛ㅖ":
        '띄쳬',

    "띞ㅏ":
        "띄파",
    "띞ㅓ":
        "띄퍼",
    "띞ㅑ":
        '띄퍄',    
    "띞ㅕ":
        '띄펴',
    "띞ㅗ":
        '띄포',
    "띞ㅛ":
        '띄표,
    "띞ㅜ":
        '띄푸',
    "띞ㅠ":
        '띄퓨',
    "띞ㅣ":
        '띄피',
    "띞ㅡ":
        '띄프',
    "띞ㅐ":
        '띄패',
    "띞ㅒ":
        '띄퍠',
    "띞ㅔ":
        '띄페',
    "띞ㅖ":
        '띄폐',

    "띆ㅏ":
        "띄까",
    "띆ㅓ":
        "띄꺼",
    "띆ㅑ":
        '띄꺄',    
    "띆ㅕ":
        '띄껴',
    "띆ㅗ":
        '띄꼬',
    "띆ㅛ":
        '띄꾜,
    "띆ㅜ":
        '띄꾸',
    "띆ㅠ":
        '띄뀨',
    "띆ㅣ":
        '띄끼',
    "띆ㅡ":
        '띄끄',
    "띆ㅐ":
        '띄깨',
    "띆ㅒ":
        '띄꺠',
    "띆ㅔ":
        '띄께',
    "띆ㅖ":
        '띄꼐',

    "띘ㅏ":
        "띄싸",
    "띘ㅓ":
        "띄써",
    "띘ㅑ":
        '띄쌰',    
    "띘ㅕ":
        '띄쎠',
    "띘ㅗ":
        '띄쏘',
    "띘ㅛ":
        '띄쑈,
    "띘ㅜ":
        '띄쑤',
    "띘ㅠ":
        '띄쓔',
    "띘ㅣ":
        '띄씨',
    "띘ㅡ":
        '띄쓰',
    "띘ㅐ":
        '띄쌔',
    "띘ㅒ":
        '띄썌',
    "띘ㅔ":
        '띄쎄',
    "띘ㅖ":
        '띄쎼',

    '띇ㅏ':
        '띅사',
    
    '띇ㅓ':
        '띅서',
    
    "띇ㅑ":
        '띅샤',
    
    "띇ㅕ":
        '띅셔',

    "띇ㅗ":
        '띅소',

    "띇ㅛ":
        '띅쇼',

    "띇ㅜ":
        '띅수',

    "띇ㅠ":
        '띅슈',

    "띇ㅣ":
        '띅시',

    "띇ㅡ":
        '띅스',

    "띇ㅐ":
        '띅새',

    "띇ㅒ":
        '띅섀',

    "띇ㅔ":
        '띅세',

    "띇ㅖ":
        '띅셰',

    '띉ㅏ':
        '띈자',
    
    '띉ㅓ':
        '띈저',
    
    "띉ㅑ":
        '띈쟈',
    
    "띉ㅕ":
        '띈져',

    "띉ㅗ":
        '띈조',

    "띉ㅛ":
        '띈죠',

    "띉ㅜ":
        '띈주',

    "띉ㅠ":
        '띈쥬',

    "띉ㅣ":
        '띈지',

    "띉ㅡ":
        '띈즈',

    "띉ㅐ":
        '띈재',

    "띉ㅒ":
        '띈쟤',

    "띉ㅔ":
        '띈제',

    "띉ㅖ":
        '띈졔',


    '띊ㅏ':
        '띈하',
    
    '띊ㅓ':
        '띈허',
    
    "띊ㅑ":
        '쯴햐',
    
    "띊ㅕ":
        '띈혀',

    "띊ㅗ":
        '띈호',

    "띊ㅛ":
        '쯴효',

    "띊ㅜ":
        '띈후',

    "띊ㅠ":
        '띈휴',

    "띊ㅣ":
        '띈히',

    "띊ㅡ":
        '띈흐',

    "띊ㅐ":
        '띈해',

    "띊ㅒ":
        '띈햬',

    "띊ㅔ":
        '띈헤',

    "띊ㅖ":
        '띈혜',
    

    '띍ㅏ':
        '띌가',
    
    '띍ㅓ':
        '띌거',
    
    "띍ㅑ":
        '띌갸',
    
    "띍ㅕ":
        '띌겨',

    "띍ㅗ":
        '띌고',

    "띍ㅛ":
        '띌교',

    "띍ㅜ":
        '띌구',

    "띍ㅠ":
        '띌규',

    "띍ㅣ":
        '띌기',

    "띍ㅡ":
        '띌그',

    "띍ㅐ":
        '띌개',

    "띍ㅒ":
        '띌걔',

    "띍ㅔ":
        '띌게',

    "띍ㅖ":
        '띌계',

    '띎ㅏ':
        '띌마',
    
    '띎ㅓ':
        '띌머',
    
    "띎ㅑ":
        '띌먀',
    
    "띎ㅕ":
        '띌며',

    "띎ㅗ":
        '띌모',

    "띎ㅛ":
        '띌묘',

    "띎ㅜ":
        '띌무',

    "띎ㅠ":
        '띌뮤',

    "띎ㅣ":
        '띌미',

    "띎ㅡ":
        '띌므',

    "띎ㅐ":
        '띌매',

    "띎ㅒ":
        '띌먜',

    "쯺ㅔ":
        '띌메',

    "띎ㅖ":
        '띌몌',

    '띏ㅏ':
        '띌바',
    
    '띏ㅓ':
        '띌버',
    
    "띏ㅑ":
        '띌뱌',
    
    "띏ㅕ":
        '띌벼',

    "띏ㅗ":
        '띌보',

    "띏ㅛ":
        '띌뵤',

    "띏ㅜ":
        '띌부',

    "띏ㅠ":
        '띌뷰',

    "띏ㅣ":
        '띌비',

    "띏ㅡ":
        '띌브',

    "띏ㅐ":
        '띌배',

    "띏ㅒ":
        '띌뱨',

    "띏ㅔ":
        '띌베',

    "띏ㅖ":
        '띌볘',


    '띐ㅏ':
        '띌사',
    
    '띐ㅓ':
        '띌서',
    
    "띐ㅑ":
        '띌샤',
    
    "띐ㅕ":
        '띌셔',

    "띐ㅗ":
        '띌소',

    "띐ㅛ":
        '띌쇼',

    "띐ㅜ":
        '띌수',

    "띐ㅠ":
        '띌슈',

    "띐ㅣ":
        '띌시',

    "띐ㅡ":
        '띌스',

    "띐ㅐ":
        '띌새',

    "띐ㅒ":
        '띌섀',

    "띐ㅔ":
        '띌세',

    "띐ㅖ":
        '띌셰',



    '띑ㅏ':
        '띌타',
    
    '띑ㅓ':
        '띌터',
    
    "띑ㅑ":
        '띌탸',
    
    "띑ㅕ":
        '띌텨',

    "띑ㅗ":
        '띌토',

    "띑ㅛ":
        '띌툐',

    "띑ㅜ":
        '띌투',

    "띑ㅠ":
        '띌튜',

    "띑ㅣ":
        '띌티',

    "띑ㅡ":
        '띌트',

    "띑ㅐ":
        '띌태',

    "띑ㅒ":
        '띌턔',

    "띑ㅔ":
        '띌테',

    "띑ㅖ":
        '띌톄',


    '띒ㅏ':
        '띌파',
    
    '띒ㅓ':
        '띌퍼',
    
    "띒ㅑ":
        '띌퍄',
    
    "띒ㅕ":
        '띌펴',

    "띒ㅗ":
        '띌포',

    "띒ㅛ":
        '띌표',

    "띒ㅜ":
        '띌푸',

    "띒ㅠ":
        '띌퓨',

    "띒ㅣ":
        '띌피',

    "띒ㅡ":
        '띌프',

    "띒ㅐ":
        '띌패',

    "띒ㅒ":
        '띌퍠',

    "띒ㅔ":
        '띌페',

    "띒ㅖ":
        '띌폐',



    '띓ㅏ':
        '띌하',
    
    '띓ㅓ':
        '띌허',
    
    "띓ㅑ":
        '띌햐',
    
    "띓ㅕ":
        '띌혀',

    "띓ㅗ":
        '띌호',

    "띓ㅛ":
        '띌효',

    "띓ㅜ":
        '띌후',

    "띓ㅠ":
        '띌휴',

    "띓ㅣ":
        '띌히',

    "띓ㅡ":
        '띌흐',

    "띓ㅐ":
        '띌해',

    "띓ㅒ":
        '띌햬',

    "띓ㅔ":
        '띌헤',

    "띓ㅖ":
        '띌혜',

    '띖ㅏ':
        '띕사',
    
    '띖ㅓ':
        '띕서',
    
    "띖ㅑ":
        '띕샤',
    
    "띖ㅕ":
        '띕셔',

    "띖ㅗ":
        '띕소',

    "띖ㅛ":
        '띕쇼',

    "띖ㅜ":
        '띕수',

    "띖ㅠ":
        '띕슈',

    "띖ㅣ":
        '띕시',

    "띖ㅡ":
        '띕스',

    "띖ㅐ":
        '띕새',

    "띖ㅒ":
        '띕섀',

    "띖ㅔ":
        '띕세',

    "띖ㅖ":
        '띕셰',
    
    "끱ㅏ":
        "끠바",
    "끱ㅓ":
        "끠버",
    "끱ㅑ":
        '끠뱌',    
    "끱ㅕ":
        '끠벼',
    "끱ㅗ":
        '끠보',
    "끱ㅛ":
        '끠뵤,
    "끱ㅜ":
        '끠부',
    "끱ㅠ":
        '끠뷰',
    "끱ㅣ":
        '끠비',
    "끱ㅡ":
        '끠브',
    "끱ㅐ":
        '끠배',
    "끱ㅒ":
        '끠ㅒ',
    "끱ㅔ":
        '끠베',
    "끱ㅖ":
        '끠볘',

    "끶ㅏ":
        "끠자",
    "끶ㅓ":
        "끠저",
    "끶ㅑ":
        '끠쟈',    
    "끶ㅕ":
        '끠져',
    "끶ㅗ":
        '끠조',
    "끶ㅛ":
        '끠죠,
    "끶ㅜ":
        '끠주',
    "끶ㅠ":
        '끠쥬',
    "끶ㅣ":
        '끠지',
    "끶ㅡ":
        '끠즈',
    "끶ㅐ":
        '끠재',
    "끶ㅒ":
        '끠쟤',
    "끶ㅔ":
        '끠제',
    "끶ㅖ":
        '끠졔',

    "끧ㅏ":
        "끠다",
    "끧ㅓ":
        "끠더",
    "끧ㅑ":
        '끠댜',    
    "끧ㅕ":
        '끠뎌',
    "끧ㅗ":
        '끠도',
    "끧ㅛ":
        '끠됴,
    "끧ㅜ":
        '끠두',
    "끧ㅠ":
        '끠듀',
    "끧ㅣ":
        '끠디',
    "끧ㅡ":
        '끠드',
    "끧ㅐ":
        '끠대',
    "끧ㅒ":
        '끠댸',
    "끧ㅔ":
        '끠데',
    "끧ㅖ":
        '끠뎨',

    "끡ㅏ":
        "끠가",
    "끡ㅓ":
        "끠거",
    "끡ㅑ":
        '끠갸',    
    "끡ㅕ":
        '끠겨',
    "끡ㅗ":
        '끠고',
    "끡ㅛ":
        '끠교,
    "끡ㅜ":
        '끠구',
    "끡ㅠ":
        '끠규',
    "끡ㅣ":
        '끠기',
    "끡ㅡ":
        '끠그',
    "끡ㅐ":
        '끠개',
    "끡ㅒ":
        '끠걔',
    "끡ㅔ":
        '끠게',
    "끡ㅖ":
        '끠계',

    "끳ㅏ":
        "끠사",
    "끳ㅓ":
        "끠서",
    "끳ㅑ":
        '끠샤',    
    "끳ㅕ":
        '끠셔',
    "끳ㅗ":
        '끠소',
    "끳ㅛ":
        '끠쇼,
    "끳ㅜ":
        '끠수',
    "끳ㅠ":
        '끠슈',
    "끳ㅣ":
        '끠시',
    "끳ㅡ":
        '끠스',
    "끳ㅐ":
        '끠새',
    "끳ㅒ":
        '끠섀',
    "끳ㅔ":
        '끠세',
    "끳ㅖ":
        '끠셰',

    "끰ㅏ":
        "끠마",
    "끰ㅓ":
        "끠머",
    "끰ㅑ":
        '끠먀',    
    "끰ㅕ":
        '끠며',
    "끰ㅗ":
        '끠모',
    "끰ㅛ":
        '끠묘,
    "끰ㅜ":
        '끠무',
    "끰ㅠ":
        '끠뮤',
    "끰ㅣ":
        '끠미',
    "끰ㅡ":
        '끠므',
    "끰ㅐ":
        '끠매',
    "끰ㅒ":
        '끠먜',
    "끰ㅔ":
        '끠메',
    "끰ㅖ":
        '끠몌',

    "끤ㅏ":
        "끠나",
    "끤ㅓ":
        "끠너",
    "끤ㅑ":
        '끠냐',    
    "끤ㅕ":
        '끠녀',
    "끤ㅗ":
        '끠노',
    "끤ㅛ":
        '끠뇨,
    "끤ㅜ":
        '끠누',
    "끤ㅠ":
        '끠뉴',
    "끤ㅣ":
        '끠니',
    "끤ㅡ":
        '끠느',
    "끤ㅐ":
        '끠내',
    "끤ㅒ":
        '끠냬',
    "끤ㅔ":
        '끠네',
    "끤ㅖ":
        '끠녜',

    "끵ㅏ":
        "끠아",
    "끵ㅓ":
        "끠어",
    "끵ㅑ":
        '끠야',    
    "끵ㅕ":
        '끠여',
    "끵ㅗ":
        '끠오',
    "끵ㅛ":
        '끠요,
    "끵ㅜ":
        '끠우',
    "끵ㅠ":
        '끠유',
    "끵ㅣ":
        '끠이',
    "끵ㅡ":
        '끠으',
    "끵ㅐ":
        '끠애',
    "끵ㅒ":
        '끠얘',
    "끵ㅔ":
        '끠에',
    "끵ㅖ":
        '끠예',

    "끨ㅏ":
        "끠라",
    "끨ㅓ":
        "끠러",
    "끨ㅑ":
        '끠랴',    
    "끨ㅕ":
        '끠려',
    "끨ㅗ":
        '끠로',
    "끨ㅛ":
        '끠료,
    "끨ㅜ":
        '끠루',
    "끨ㅠ":
        '끠류',
    "끨ㅣ":
        '끠리',
    "끨ㅡ":
        '끠르',
    "끨ㅐ":
        '끠래',
    "끨ㅒ":
        '끠럐',
    "끨ㅔ":
        '끠레',
    "끨ㅖ":
        '끠례',

    "끻ㅏ":
        "끠하",
    "끻ㅓ":
        "끠허",
    "끻ㅑ":
        '끠햐',    
    "끻ㅕ":
        '끠혀',
    "끻ㅗ":
        '끠호',
    "끻ㅛ":
        '끠효,
    "끻ㅜ":
        '끠후',
    "끻ㅠ":
        '끠휴',
    "끻ㅣ":
        '끠히',
    "끻ㅡ":
        '끠흐',
    "끻ㅐ":
        '끠해',
    "끻ㅒ":
        '끠햬',
    "끻ㅔ":
        '끠헤',
    "끻ㅖ":
        '끠혜',

    "끸ㅏ":
        "끠카",
    "끸ㅓ":
        "끠커",
    "끸ㅑ":
        '끠캬',    
    "끸ㅕ":
        '끠켜',
    "끸ㅗ":
        '끠코',
    "끸ㅛ":
        '끠쿄,
    "끸ㅜ":
        '끠쿠',
    "끸ㅠ":
        '끠큐',
    "끸ㅣ":
        '끠키',
    "끸ㅡ":
        '끠크',
    "끸ㅐ":
        '끠캐',
    "끸ㅒ":
        '끠컈',
    "끸ㅔ":
        '끠케',
    "끸ㅖ":
        '끠켸',

    "끹ㅏ":
        "끠타",
    "끹ㅓ":
        "끠터",
    "끹ㅑ":
        '끠탸',    
    "끹ㅕ":
        '끠텨',
    "끹ㅗ":
        '끠토',
    "끹ㅛ":
        '끠툐,
    "끹ㅜ":
        '끠투',
    "끹ㅠ":
        '끠튜',
    "끹ㅣ":
        '끠티',
    "끹ㅡ":
        '끠트',
    "끹ㅐ":
        '끠태',
    "끹ㅒ":
        '끠턔',
    "끹ㅔ":
        '끠테',
    "끹ㅖ":
        '끠톄',

    "끷ㅏ":
        "끠차",
    "끷ㅓ":
        "끠처",
    "끷ㅑ":
        '끠챠',    
    "끷ㅕ":
        '끠쳐',
    "끷ㅗ":
        '끠초',
    "끷ㅛ":
        '끠쵸,
    "끷ㅜ":
        '끠추',
    "끷ㅠ":
        '끠츄',
    "끷ㅣ":
        '끠치',
    "끷ㅡ":
        '끠츠',
    "끷ㅐ":
        '끠채',
    "끷ㅒ":
        '끠챼',
    "끷ㅔ":
        '끠체',
    "끷ㅖ":
        '끠쳬',

    "끺ㅏ":
        "끠파",
    "끺ㅓ":
        "끠퍼",
    "끺ㅑ":
        '끠퍄',    
    "끺ㅕ":
        '끠펴',
    "끺ㅗ":
        '끠포',
    "끺ㅛ":
        '끠표,
    "끺ㅜ":
        '끠푸',
    "끺ㅠ":
        '끠퓨',
    "끺ㅣ":
        '끠피',
    "끺ㅡ":
        '끠프',
    "끺ㅐ":
        '끠패',
    "끺ㅒ":
        '끠퍠',
    "끺ㅔ":
        '끠페',
    "끺ㅖ":
        '끠폐',

    "끢ㅏ":
        "끠까",
    "끢ㅓ":
        "끠꺼",
    "끢ㅑ":
        '끠꺄',    
    "끢ㅕ":
        '끠껴',
    "끢ㅗ":
        '끠꼬',
    "끢ㅛ":
        '끠꾜,
    "끢ㅜ":
        '끠꾸',
    "끢ㅠ":
        '끠뀨',
    "끢ㅣ":
        '끠끼',
    "끢ㅡ":
        '끠끄',
    "끢ㅐ":
        '끠깨',
    "끢ㅒ":
        '끠꺠',
    "끢ㅔ":
        '끠께',
    "끢ㅖ":
        '끠꼐',

    "끴ㅏ":
        "끠싸",
    "끴ㅓ":
        "끠써",
    "끴ㅑ":
        '끠쌰',    
    "끴ㅕ":
        '끠쎠',
    "끴ㅗ":
        '끠쏘',
    "끴ㅛ":
        '끠쑈,
    "끴ㅜ":
        '끠쑤',
    "끴ㅠ":
        '끠쓔',
    "끴ㅣ":
        '끠씨',
    "끴ㅡ":
        '끠쓰',
    "끴ㅐ":
        '끠쌔',
    "끴ㅒ":
        '끠썌',
    "끴ㅔ":
        '끠쎄',
    "끴ㅖ":
        '끠쎼',


    '끣ㅏ':
        '끡사',
    
    '끣ㅓ':
        '끡서',
    
    "끣ㅑ":
        '끡샤',
    
    "끣ㅕ":
        '끡셔',

    "끣ㅗ":
        '끡소',

    "끣ㅛ":
        '끡쇼',

    "끣ㅜ":
        '끡수',

    "끣ㅠ":
        '끡슈',

    "끣ㅣ":
        '끡시',

    "끣ㅡ":
        '끡스',

    "끣ㅐ":
        '끡새',

    "끣ㅒ":
        '끡섀',

    "끣ㅔ":
        '끡세',

    "끣ㅖ":
        '끡셰',

    '끥ㅏ':
        '끤자',
    
    '끥ㅓ':
        '끤저',
    
    "끥ㅑ":
        '끤쟈',
    
    "끥ㅕ":
        '끤져',

    "끥ㅗ":
        '끤조',

    "끥ㅛ":
        '끤죠',

    "끥ㅜ":
        '끤주',

    "끥ㅠ":
        '끤쥬',

    "끥ㅣ":
        '끤지',

    "끥ㅡ":
        '끤즈',

    "끥ㅐ":
        '끤재',

    "끥ㅒ":
        '끤쟤',

    "끥ㅔ":
        '끤제',

    "끥ㅖ":
        '끤졔',


    '끦ㅏ':
        '끤하',
    
    '끦ㅓ':
        '끤허',
    
    "끦ㅑ":
        '끤햐',
    
    "끦ㅕ":
        '끤혀',

    "끦ㅗ":
        '끤호',

    "끦ㅛ":
        '끤효',

    "끦ㅜ":
        '끤후',

    "끦ㅠ":
        '끤휴',

    "끦ㅣ":
        '끤히',

    "끦ㅡ":
        '끤흐',

    "끦ㅐ":
        '끤해',

    "끦ㅒ":
        '끤햬',

    "끦ㅔ":
        '끤헤',

    "끦ㅖ":
        '끤혜',
    

    '끩ㅏ':
        '끨가',
    
    '끩ㅓ':
        '끨거',
    
    "끩ㅑ":
        '끨갸',
    
    "끩ㅕ":
        '끨겨',

    "끩ㅗ":
        '끨고',

    "끩ㅛ":
        '끨교',

    "끩ㅜ":
        '끨구',

    "끩ㅠ":
        '끨규',

    "끩ㅣ":
        '끨기',

    "끩ㅡ":
        '끨그',

    "끩ㅐ":
        '끨개',

    "끩ㅒ":
        '끨걔',

    "끩ㅔ":
        '끨게',

    "끩ㅖ":
        '끨계',

    '끩ㅏ':
        '끨마',
    
    '끪ㅓ':
        '끨머',
    
    "끪ㅑ":
        '끨먀',
    
    "끪ㅕ":
        '끨며',

    "끪ㅗ":
        '끨모',

    "끪ㅛ":
        '끨묘',

    "끪ㅜ":
        '끨무',

    "끪ㅠ":
        '끨뮤',

    "끪ㅣ":
        '끨미',

    "끪ㅡ":
        '끨므',

    "끪ㅐ":
        '끨매',

    "끪ㅒ":
        '끨먜',

    "끪ㅔ":
        '끨메',

    "끪ㅖ":
        '끨몌',

    '끫ㅏ':
        '끨바',
    
    '끫ㅓ':
        '끨버',
    
    "끫ㅑ":
        '끨뱌',
    
    "끫ㅕ":
        '끨벼',

    "끫ㅗ":
        '끨보',

    "끫ㅛ":
        '끨뵤',

    "끫ㅜ":
        '끨부',

    "끫ㅠ":
        '끨뷰',

    "끫ㅣ":
        '끨비',

    "끫ㅡ":
        '끨브',

    "끫ㅐ":
        '끨배',

    "끫ㅒ":
        '끨뱨',

    "끫ㅔ":
        '끨베',

    "끫ㅖ":
        '끨볘',


    '끬ㅏ':
        '끨사',
    
    '끬ㅓ':
        '끨서',
    
    "끬ㅑ":
        '끨샤',
    
    "끬ㅕ":
        '끨셔',

    "끬ㅗ":
        '끨소',

    "끬ㅛ":
        '끨쇼',

    "끬ㅜ":
        '끨수',

    "끬ㅠ":
        '끨슈',

    "끬ㅣ":
        '끨시',

    "끬ㅡ":
        '끨스',

    "끬ㅐ":
        '끨새',

    "끬ㅒ":
        '끨섀',

    "끬ㅔ":
        '끨세',

    "끬ㅖ":
        '끨셰',



    '끭ㅏ':
        '끨타',
    
    '끭ㅓ':
        '끨터',
    
    "끭ㅑ":
        '끨탸',
    
    "끭ㅕ":
        '끨텨',

    "끭ㅗ":
        '끨토',

    "끭ㅛ":
        '끨툐',

    "끭ㅜ":
        '끨투',

    "끭ㅠ":
        '끨튜',

    "끭ㅣ":
        '끨티',

    "끭ㅡ":
        '끨트',

    "끭ㅐ":
        '끨태',

    "끭ㅒ":
        '끨턔',

    "끭ㅔ":
        '끨테',

    "끭ㅖ":
        '끨톄',


    '끮ㅏ':
        '끨파',
    
    '끮ㅓ':
        '끨퍼',
    
    "끮ㅑ":
        '끨퍄',
    
    "끮ㅕ":
        '끨펴',

    "끮ㅗ":
        '끨포',

    "끮ㅛ":
        '끨표',

    "끮ㅜ":
        '끨푸',

    "끮ㅠ":
        '끨퓨',

    "끮ㅣ":
        '끨피',

    "끮ㅡ":
        '끨프',

    "끮ㅐ":
        '끨패',

    "끮ㅒ":
        '끨퍠',

    "끮ㅔ":
        '끨페',

    "끮ㅖ":
        '끨폐',



    '끯ㅏ':
        '끨하',
    
    '끯ㅓ':
        '끨허',
    
    "끯ㅑ":
        '끨햐',
    
    "끯ㅕ":
        '끨혀',

    "끯ㅗ":
        '끨호',

    "끯ㅛ":
        '끨효',

    "끯ㅜ":
        '끨후',

    "끯ㅠ":
        '끨휴',

    "끯ㅣ":
        '끨히',

    "끯ㅡ":
        '끨흐',

    "끯ㅐ":
        '끨해',

    "끯ㅒ":
        '끨햬',

    "끯ㅔ":
        '끨헤',

    "끯ㅖ":
        '끨혜',

    '끲ㅏ':
        '끱사',
    
    '끲ㅓ':
        '끱서',
    
    "끲ㅑ":
        '끱샤',
    
    "끲ㅕ":
        '끱셔',

    "끲ㅗ":
        '끱소',

    "끲ㅛ":
        '끱쇼',

    "끲ㅜ":
        '끱수',

    "끲ㅠ":
        '끱슈',

    "끲ㅣ":
        '끱시',

    "끲ㅡ":
        '끱스',

    "끲ㅐ":
        '끱새',

    "끲ㅒ":
        '끱섀',

    "끲ㅔ":
        '끱세',

    "끲ㅖ":
        '끱셰',


    "씝ㅏ":
        "씌바",
    "씝ㅓ":
        "씌버",
    "씝ㅑ":
        '씌뱌',    
    "씝ㅕ":
        '씌벼',
    "씝ㅗ":
        '씌보',
    "씝ㅛ":
        '씌뵤,
    "씝ㅜ":
        '씌부',
    "씝ㅠ":
        '씌뷰',
    "씝ㅣ":
        '씌비',
    "씝ㅡ":
        '씌브',
    "씝ㅐ":
        '씌배',
    "씝ㅒ":
        '씌ㅒ',
    "씝ㅔ":
        '씌베',
    "씝ㅖ":
        '씌볘',

    "씢ㅏ":
        "씌자",
    "씢ㅓ":
        "씌저",
    "씢ㅑ":
        '씌쟈',    
    "씢ㅕ":
        '씌져',
    "씢ㅗ":
        '씌조',
    "씢ㅛ":
        '씌죠,
    "씢ㅜ":
        '씌주',
    "씢ㅠ":
        '씌쥬',
    "씢ㅣ":
        '씌지',
    "씢ㅡ":
        '씌즈',
    "씢ㅐ":
        '씌재',
    "씢ㅒ":
        '씌쟤',
    "씢ㅔ":
        '씌제',
    "씢ㅖ":
        '씌졔',

    "씓ㅏ":
        "씌다",
    "씓ㅓ":
        "씌더",
    "씓ㅑ":
        '씌댜',    
    "씓ㅕ":
        '씌뎌',
    "씓ㅗ":
        '씌도',
    "씓ㅛ":
        '씌됴,
    "씓ㅜ":
        '씌두',
    "씓ㅠ":
        '씌듀',
    "씓ㅣ":
        '씌디',
    "씓ㅡ":
        '씌드',
    "씓ㅐ":
        '씌대',
    "씓ㅒ":
        '씌댸',
    "씓ㅔ":
        '씌데',
    "씓ㅖ":
        '씌뎨',

    "씍ㅏ":
        "씌가",
    "씍ㅓ":
        "씌거",
    "씍ㅑ":
        '씌갸',    
    "씍ㅕ":
        '씌겨',
    "씍ㅗ":
        '씌고',
    "씍ㅛ":
        '씌교,
    "씍ㅜ":
        '씌구',
    "씍ㅠ":
        '씌규',
    "씍ㅣ":
        '씌기',
    "씍ㅡ":
        '씌그',
    "씍ㅐ":
        '씌개',
    "씍ㅒ":
        '씌걔',
    "씍ㅔ":
        '씌게',
    "씍ㅖ":
        '씌계',

    "씟ㅏ":
        "씌사",
    "씟ㅓ":
        "씌서",
    "씟ㅑ":
        '씌샤',    
    "씟ㅕ":
        '씌셔',
    "씟ㅗ":
        '씌소',
    "씟ㅛ":
        '씌쇼,
    "씟ㅜ":
        '씌수',
    "씟ㅠ":
        '씌슈',
    "씟ㅣ":
        '씌시',
    "씟ㅡ":
        '씌스',
    "씟ㅐ":
        '씌새',
    "씟ㅒ":
        '씌섀',
    "씟ㅔ":
        '씌세',
    "씟ㅖ":
        '씌셰',

    "씜ㅏ":
        "씌마",
    "씜ㅓ":
        "씌머",
    "씜ㅑ":
        '씌먀',    
    "씜ㅕ":
        '씌며',
    "씜ㅗ":
        '씌모',
    "씜ㅛ":
        '씌묘,
    "씜ㅜ":
        '씌무',
    "씜ㅠ":
        '씌뮤',
    "씜ㅣ":
        '씌미',
    "씜ㅡ":
        '씌므',
    "씜ㅐ":
        '씌매',
    "씜ㅒ":
        '씌먜',
    "씜ㅔ":
        '씌메',
    "씜ㅖ":
        '씌몌',

    "씐ㅏ":
        "씌나",
    "씐ㅓ":
        "씌너",
    "씐ㅑ":
        '씌냐',    
    "씐ㅕ":
        '씌녀',
    "씐ㅗ":
        '씌노',
    "씐ㅛ":
        '씌뇨,
    "씐ㅜ":
        '씌누',
    "씐ㅠ":
        '씌뉴',
    "씐ㅣ":
        '씌니',
    "씐ㅡ":
        '씌느',
    "씐ㅐ":
        '씌내',
    "씐ㅒ":
        '씌냬',
    "씐ㅔ":
        '씌네',
    "씐ㅖ":
        '씌녜',

    "씡ㅏ":
        "씌아",
    "씡ㅓ":
        "씌어",
    "씡ㅑ":
        '씌야',    
    "씡ㅕ":
        '씌여',
    "씡ㅗ":
        '씌오',
    "씡ㅛ":
        '씌요,
    "씡ㅜ":
        '씌우',
    "씡ㅠ":
        '씌유',
    "씡ㅣ":
        '씌이',
    "씡ㅡ":
        '씌으',
    "씡ㅐ":
        '씌애',
    "씡ㅒ":
        '씌얘',
    "씡ㅔ":
        '씌에',
    "씡ㅖ":
        '씌예',

    "씔ㅏ":
        "씌라",
    "씔ㅓ":
        "씌러",
    "씔ㅑ":
        '씌랴',    
    "씔ㅕ":
        '씌려',
    "씔ㅗ":
        '씌로',
    "씔ㅛ":
        '씌료,
    "씔ㅜ":
        '씌루',
    "씔ㅠ":
        '씌류',
    "씔ㅣ":
        '씌리',
    "씔ㅡ":
        '씌르',
    "씔ㅐ":
        '씌래',
    "씔ㅒ":
        '씌럐',
    "씔ㅔ":
        '씌레',
    "씔ㅖ":
        '씌례',

    "씧ㅏ":
        "끠하",
    "씧ㅓ":
        "끠허",
    "씧ㅑ":
        '끠햐',    
    "씧ㅕ":
        '끠혀',
    "씧ㅗ":
        '끠호',
    "씧ㅛ":
        '끠효,
    "씧ㅜ":
        '끠후',
    "씧ㅠ":
        '끠휴',
    "씧ㅣ":
        '끠히',
    "씧ㅡ":
        '끠흐',
    "씧ㅐ":
        '끠해',
    "씧ㅒ":
        '끠햬',
    "씧ㅔ":
        '끠헤',
    "씧ㅖ":
        '끠혜',

    "씤ㅏ":
        "씌카",
    "씤ㅓ":
        "씌커",
    "씤ㅑ":
        '씌캬',    
    "씤ㅕ":
        '씌켜',
    "씤ㅗ":
        '씌코',
    "씤ㅛ":
        '씌쿄,
    "씤ㅜ":
        '씌쿠',
    "씤ㅠ":
        '씌큐',
    "씤ㅣ":
        '씌키',
    "씤ㅡ":
        '씌크',
    "씤ㅐ":
        '씌캐',
    "씤ㅒ":
        '씌컈',
    "씤ㅔ":
        '씌케',
    "씤ㅖ":
        '씌켸',

    "씥ㅏ":
        "씌타",
    "씥ㅓ":
        "씌터",
    "씥ㅑ":
        '씌탸',    
    "씥ㅕ":
        '씌텨',
    "씥ㅗ":
        '씌토',
    "씥ㅛ":
        '씌툐,
    "씥ㅜ":
        '씌투',
    "씥ㅠ":
        '씌튜',
    "씥ㅣ":
        '씌티',
    "씥ㅡ":
        '씌트',
    "씥ㅐ":
        '씌태',
    "씥ㅒ":
        '씌턔',
    "씥ㅔ":
        '씌테',
    "씥ㅖ":
        '씌톄',

    "씣ㅏ":
        "씌차",
    "씣ㅓ":
        "씌처",
    "씣ㅑ":
        '씌챠',    
    "씣ㅕ":
        '씌쳐',
    "씣ㅗ":
        '씌초',
    "씣ㅛ":
        '씌쵸,
    "씣ㅜ":
        '씌추',
    "씣ㅠ":
        '씌츄',
    "씣ㅣ":
        '씌치',
    "씣ㅡ":
        '씌츠',
    "씣ㅐ":
        '씌채',
    "씣ㅒ":
        '씌챼',
    "씣ㅔ":
        '씌체',
    "씣ㅖ":
        '씌쳬',

    "씦ㅏ":
        "씌파",
    "씦ㅓ":
        "씌퍼",
    "씦ㅑ":
        '씌퍄',    
    "씦ㅕ":
        '씌펴',
    "씦ㅗ":
        '씌포',
    "씦ㅛ":
        '씌표,
    "씦ㅜ":
        '씌푸',
    "씦ㅠ":
        '씌퓨',
    "씦ㅣ":
        '씌피',
    "씦ㅡ":
        '씌프',
    "씦ㅐ":
        '씌패',
    "씦ㅒ":
        '씌퍠',
    "씦ㅔ":
        '씌페',
    "씦ㅖ":
        '씌폐',

    "씎ㅏ":
        "씌까",
    "씎ㅓ":
        "씌꺼",
    "씎ㅑ":
        '씌꺄',    
    "씎ㅕ":
        '씌껴',
    "씎ㅗ":
        '씌꼬',
    "씎ㅛ":
        '씌꾜,
    "씎ㅜ":
        '씌꾸',
    "씎ㅠ":
        '씌뀨',
    "씎ㅣ":
        '씌끼',
    "씎ㅡ":
        '씌끄',
    "씎ㅐ":
        '씌깨',
    "씎ㅒ":
        '씌꺠',
    "씎ㅔ":
        '씌께',
    "씎ㅖ":
        '씌꼐',

    "씠ㅏ":
        "씌싸",
    "씠ㅓ":
        "씌써",
    "씠ㅑ":
        '씌쌰',    
    "씠ㅕ":
        '씌쎠',
    "씠ㅗ":
        '씌쏘',
    "씠ㅛ":
        '씌쑈,
    "씠ㅜ":
        '씌쑤',
    "씠ㅠ":
        '씌쓔',
    "씠ㅣ":
        '씌씨',
    "씠ㅡ":
        '씌쓰',
    "씠ㅐ":
        '씌쌔',
    "씠ㅒ":
        '씌썌',
    "씠ㅔ":
        '씌쎄',
    "씠ㅖ":
        '씌쎼'

    '씏ㅏ':
        '씍사',
    
    '씏ㅓ':
        '씍서',
    
    "씏ㅑ":
        '씍샤',
    
    "씏ㅕ":
        '씍셔',

    "씏ㅗ":
        '씍소',

    "씏ㅛ":
        '씍쇼',

    "씏ㅜ":
        '씍수',

    "씏ㅠ":
        '씍슈',

    "씏ㅣ":
        '씍시',

    "씏ㅡ":
        '씍스',

    "씏ㅐ":
        '씍새',

    "씏ㅒ":
        '씍섀',

    "씏ㅔ":
        '씍세',

    "씏ㅖ":
        '씍셰',

    '씑ㅏ':
        '씐자',
    
    '씑ㅓ':
        '씐저',
    
    "씑ㅑ":
        '씐쟈',
    
    "씑ㅕ":
        '씐져',

    "씑ㅗ":
        '씐조',

    "씑ㅛ":
        '씐죠',

    "씑ㅜ":
        '씐주',

    "씑ㅠ":
        '씐쥬',

    "씑ㅣ":
        '씐지',

    "씑ㅡ":
        '씐즈',

    "씑ㅐ":
        '씐재',

    "씑ㅒ":
        '씐쟤',

    "씑ㅔ":
        '씐제',

    "씑ㅖ":
        '씐졔',


    '씒ㅏ':
        '씐하',
    
    '씒ㅓ':
        '씐허',
    
    "씒ㅑ":
        '씐햐',
    
    "씒ㅕ":
        '씐혀',

    "씒ㅗ":
        '씐호',

    "씒ㅛ":
        '씐효',

    "씒ㅜ":
        '씐후',

    "씒ㅠ":
        '씐휴',

    "씒ㅣ":
        '씐히',

    "씒ㅡ":
        '씐흐',

    "씒ㅐ":
        '씐해',

    "씒ㅒ":
        '씐햬',

    "씒ㅔ":
        '씐헤',

    "씒ㅖ":
        '씐혜',
    

    '씕ㅏ':
        '씔가',
    
    '씕ㅓ':
        '씔거',
    
    "씕ㅑ":
        '씔갸',
    
    "씕ㅕ":
        '씔겨',

    "씕ㅗ":
        '씔고',

    "씕ㅛ":
        '씔교',

    "씕ㅜ":
        '씔구',

    "씕ㅠ":
        '씔규',

    "씕ㅣ":
        '씔기',

    "씕ㅡ":
        '씔그',

    "씕ㅐ":
        '씔개',

    "씕ㅒ":
        '씔걔',

    "씕ㅔ":
        '씔게',

    "씕ㅖ":
        '씔계',

    '씖ㅏ':
        '씔마',
    
    '씖ㅓ':
        '씔머',
    
    "씖ㅑ":
        '씔먀',
    
    "씖ㅕ":
        '씔며',

    "씖ㅗ":
        '씔모',

    "씖ㅛ":
        '씔묘',

    "씖ㅜ":
        '씔무',

    "씖ㅠ":
        '씔뮤',

    "씖ㅣ":
        '씔미',

    "씖ㅡ":
        '씔므',

    "씖ㅐ":
        '씔매',

    "씖ㅒ":
        '씔먜',

    "씖ㅔ":
        '씔메',

    "씖ㅖ":
        '씔몌',

    '씗ㅏ':
        '씔바',
    
    '씗ㅓ':
        '씔버',
    
    "씗ㅑ":
        '씔뱌',
    
    "씗ㅕ":
        '씔벼',

    "씗ㅗ":
        '씔보',

    "씗ㅛ":
        '씔뵤',

    "씗ㅜ":
        '씔부',

    "씗ㅠ":
        '씔뷰',

    "씗ㅣ":
        '씔비',

    "씗ㅡ":
        '씔브',

    "씗ㅐ":
        '끨배',

    "씗ㅒ":
        '씔뱨',

    "씗ㅔ":
        '씔베',

    "씗ㅖ":
        '씔볘',


    '씘ㅏ':
        '씔사',
    
    '씘ㅓ':
        '씔서',
    
    "씘ㅑ":
        '씔샤',
    
    "씘ㅕ":
        '씔셔',

    "씘ㅗ":
        '씔소',

    "씘ㅛ":
        '씔쇼',

    "씘ㅜ":
        '씔수',

    "씘ㅠ":
        '씔슈',

    "씘ㅣ":
        '씔시',

    "씘ㅡ":
        '씔스',

    "씘ㅐ":
        '씔새',

    "씘ㅒ":
        '씔섀',

    "씘ㅔ":
        '씔세',

    "씘ㅖ":
        '씔셰',



    '씙ㅏ':
        '씔타',
    
    '씙ㅓ':
        '씔터',
    
    "씙ㅑ":
        '씔탸',
    
    "씙ㅕ":
        '씔텨',

    "씙ㅗ":
        '씔토',

    "씙ㅛ":
        '씔툐',

    "씙ㅜ":
        '씔투',

    "씙ㅠ":
        '씔튜',

    "씙ㅣ":
        '씔티',

    "씙ㅡ":
        '씔트',

    "씙ㅐ":
        '씔태',

    "씙ㅒ":
        '씔턔',

    "씙ㅔ":
        '씔테',

    "씙ㅖ":
        '씔톄',


    '씚ㅏ':
        '씔파',
    
    '씚ㅓ':
        '씔퍼',
    
    "씚ㅑ":
        '씔퍄',
    
    "씚ㅕ":
        '씔펴',

    "씚ㅗ":
        '씔포',

    "씚ㅛ":
        '씔표',

    "씚ㅜ":
        '씔푸',

    "씚ㅠ":
        '씔퓨',

    "씚ㅣ":
        '씔피',

    "씚ㅡ":
        '씔프',

    "씚ㅐ":
        '씔패',

    "씚ㅒ":
        '씔퍠',

    "씚ㅔ":
        '씔페',

    "씚ㅖ":
        '씔폐',



    '씛ㅏ':
        '씔하',
    
    '씛ㅓ':
        '씔허',
    
    "씛ㅑ":
        '씔햐',
    
    "씛ㅕ":
        '씔혀',

    "씛ㅗ":
        '씔호',

    "씛ㅛ":
        '씔효',

    "씛ㅜ":
        '씔후',

    "씛ㅠ":
        '씔휴',

    "씛ㅣ":
        '씔히',

    "씛ㅡ":
        '씔흐',

    "씛ㅐ":
        '씔해',

    "씛ㅒ":
        '씔햬',

    "씛ㅔ":
        '씔헤',

    "씛ㅖ":
        '씔혜',

    '씞ㅏ':
        '씝사',
    
    '씞ㅓ':
        '씝서',
    
    "씞ㅑ":
        '씝샤',
    
    "씞ㅕ":
        '씝셔',

    "씞ㅗ":
        '씝소',

    "씞ㅛ":
        '씝쇼',

    "씞ㅜ":
        '씝수',

    "씞ㅠ":
        '씝슈',

    "씞ㅣ":
        '씝시',

    "씞ㅡ":
        '씝스',

    "씞ㅐ":
        '씝새',

    "씞ㅒ":
        '씝섀',

    "씞ㅔ":
        '씝세',

    "씞ㅖ":
        '씝셰'
    


    }
    
    
    
