# -*- coding: utf-8 -*-
#
dic = {
    '삅ㅏ':
    '쁴바',
    
    '삅ㅓ':
    '쁴버',
    
    "삅ㅑ":
    '쁴뱌',
    
    "삅ㅕ":
    '쁴벼',

     "삅ㅗ":
    '쁴보',

    "삅ㅛ":
    '쁴뵤',

    "삅ㅜ":
    '쁴부',

    "삅ㅠ":
    '쁴뷰',

    "삅ㅣ":
    '쁴비',

    "삅ㅡ":
    '쁴브',

    "삅ㅐ":
    '쁴배',

    "삅ㅒ":
    '쁴뱨',

    "삅ㅔ":
    '쁴베',

    "삅ㅖ":
    '쁴볘',



    '삊ㅏ':
    '쁴자',
    
    '삊ㅓ':
    '쁴저',
    
    "삊ㅑ":
    '쁴쟈',
    
    "삊ㅕ":
    '쁴져',

     "삊ㅗ":
    '쁴조',

    "삊ㅛ":
    '쁴죠',

    "삊ㅜ":
    '쁴주',

    "삊ㅠ":
    '쁴쥬',

    "삊ㅣ":
    '쁴지',

    "삊ㅡ":
    '쁴즈',

    "삊ㅐ":
    '쁴재',

    "삊ㅒ":
    '쁴쟤',

    "삊ㅔ":
    '쁴제',

    "삊ㅖ":
    '쁴졔',


    '쁻ㅏ':
    '쁴다',
    
    '쁻ㅓ':
    '쁴더',
    
    "쁻ㅑ":
    '쁴댜',
    
    "쁻ㅕ":
    '쁴뎌',

     "쁻ㅗ":
    '쁴도',

    "쁻ㅛ":
    '쁴됴',

    "쁻ㅜ":
    '쁴두',

    "쁻ㅠ":
    '쁴듀',

    "쁻ㅣ":
    '쁴디',

    "쁻ㅡ":
    '쁴드',

    "쁻ㅐ":
    '쁴대',

    "쁻ㅒ":
    '쁴댸',

    "쁻ㅔ":
    '쁴데',

    "쁻ㅖ":
    '쁴뎨',



    '쁵ㅏ':
    '쁴가',
    
    '쁵ㅓ':
    '쁴거',
    
    "쁵ㅑ":
    '쁴갸',
    
    "쁵ㅕ":
    '쁴겨',

     "쁵ㅗ":
    '쁴고',

    "쁵ㅛ":
    '쁴교',

    "쁵ㅜ":
    '쁴구',

    "쁵ㅠ":
    '쁴규',

    "쁵ㅣ":
    '쁴기',

    "쁵ㅡ":
    '쁴그',

    "쁵ㅐ":
    '쁴개',

    "쁵ㅒ":
    '쁴걔',

    "쁵ㅔ":
    '쁴게',

    "쁵ㅖ":
    '쁴계',


    '삇ㅏ':
    '쁴사',
    
    '삇ㅓ':
    '쁴서',
    
    "삇ㅑ":
    '쁴샤',
    
    "삇ㅕ":
    '쁴셔',

     "삇ㅗ":
    '쁴소',

    "삇ㅛ":
    '쁴쇼',

    "삇ㅜ":
    '쁴수',

    "삇ㅠ":
    '쁴슈',

    "삇ㅣ":
    '쁴시',

    "삇ㅡ":
    '쁴스',

    "삇ㅐ":
    '쁴새',

    "삇ㅒ":
    '쁴섀',

    "삇ㅔ":
    '쁴세',

    "삇ㅖ":
    '쁴셰',


    '삄ㅏ':
    '쁴마',
    
    '삄ㅓ':
    '쁴머',
    
    "삄ㅑ":
    '쁴먀',
    
    "삄ㅕ":
    '쁴며',

     "삄ㅗ":
    '쁴모',

    "삄ㅛ":
    '쁴묘',

    "삄ㅜ":
    '쁴무',

    "삄ㅠ":
    '쁴뮤',

    "삄ㅣ":
    '쁴미',

    "삄ㅡ":
    '쁴므',

    "삄ㅐ":
    '쁴매',

    "삄ㅒ":
    '쁴먜',

    "삄ㅔ":
    '쁴메',

    "삄ㅖ":
    '쁴몌',

    
    '쁸ㅏ':
    '쁴나',
    
    '쁸ㅓ':
    '쁴너',
    
    "쁸ㅑ":
    '쁴냐',
    
    "쁸ㅕ":
    '쁴녀',

     "쁸ㅗ":
    '쁴노',

    "쁸ㅛ":
    '쁴뇨',

    "쁸ㅜ":
    '쁴누',

    "쁸ㅠ":
    '쁴뉴',

    "쁸ㅣ":
    '쁴니',

    "쁸ㅡ":
    '쁴느',

    "쁸ㅐ":
    '쁴내',

    "쁸ㅒ":
    '쁴냬',

    "쁸ㅔ":
    '쁴네',

    "쁸ㅖ":
    '쁴녜',

    

     '삉ㅏ':
    '쁴아',
    
    '삉ㅓ':
    '쁴어',
    
    "삉ㅑ":
    '쁴야',
    
    "삉ㅕ":
    '쁴여',

     "삉ㅗ":
    '쁴오',

    "삉ㅛ":
    '쁴요',

    "삉ㅜ":
    '쁴우',

    "삉ㅠ":
    '쁴유',

    "삉ㅣ":
    '쁴이',

    "삉ㅡ":
    '쁴으',

    "삉ㅐ":
    '쁴애',

    "삉ㅒ":
    '쁴얘',

    "삉ㅔ":
    '쁴에',

    "삉ㅖ":
    '쁴예',


    '쁼ㅏ':
    '쁴라',
    
    '쁼ㅓ':
    '쁴러',
    
    "쁼ㅑ":
    '쁴랴',
    
    "쁼ㅕ":
    '쁴려',

     "쁼ㅗ":
    '쁴로',

    "쁼ㅛ":
    '쁴료',

    "쁼ㅜ":
    '쁴루',

    "쁼ㅠ":
    '쁴류',

    "쁼ㅣ":
    '쁴리',

    "쁼ㅡ":
    '쁴르',

    "쁼ㅐ":
    '쁴래',

    "쁼ㅒ":
    '쁴럐',

    "쁼ㅔ":
    '쁴레',

    "쁼ㅖ":
    '쁴례',


    '삏ㅏ':
    '쁴하',
    
    '삏ㅓ':
    '쁴허',
    
    "삏ㅑ":
    '쁴햐',
    
    "삏ㅕ":
    '쁴혀',

     "삏ㅗ":
    '쁴호',

    "삏ㅛ":
    '쁴효',

    "삏ㅜ":
    '쁴후',

    "삏ㅠ":
    '쁴휴',

    "삏ㅣ":
    '쁴히',

    "삏ㅡ":
    '쁴흐',

    "삏ㅐ":
    '쁴해',

    "삏ㅒ":
    '쁴햬',

    "삏ㅔ":
    '쁴헤',

    "삏ㅖ":
    '쁴혜',


     '삌ㅏ':
    '쁴카',
    
    '삌ㅓ':
    '쁴커',
    
    "삌ㅑ":
    '쁴캬',
    
    "삌ㅕ":
    '쁴켜',

     "삌ㅗ":
    '쁴코',

    "삌ㅛ":
    '쁴쿄',

    "삌ㅜ":
    '쁴쿠',

    "삌ㅠ":
    '쁴큐',

    "삌ㅣ":
    '쁴키',

    "삌ㅡ":
    '쁴크',

    "삌ㅐ":
    '쁴캐',

    "삌ㅒ":
    '쁴컈',

    "삌ㅔ":
    '쁴케',

    "삌ㅖ":
    '쁴켸',


     '삍ㅏ':
    '쁴타',
    
    '삍ㅓ':
    '쁴터',
    
    "삍ㅑ":
    '쁴탸',
    
    "삍ㅕ":
    '쁴텨',

     "삍ㅗ":
    '쁴토',

    "삍ㅛ":
    '쁴툐',

    "삍ㅜ":
    '쁴투',

    "삍ㅠ":
    '쁴튜',

    "삍ㅣ":
    '쁴티',

    "삍ㅡ":
    '쁴트',

    "삍ㅐ":
    '쁴태',

    "삍ㅒ":
    '쁴턔',

    "삍ㅔ":
    '쁴테',

    "삍ㅖ":
    '쁴톄',


     '삋ㅏ':
    '쁴차',
    
    '삋ㅓ':
    '쁴처',
    
    "삋ㅑ":
    '쁴챠',
    
    "삋ㅕ":
    '쁴쳐',

     "삋ㅗ":
    '쁴초',

    "삋ㅛ":
    '쁴쵸',

    "삋ㅜ":
    '쁴추',

    "삋ㅠ":
    '쁴츄',

    "삋ㅣ":
    '쁴치',

    "삋ㅡ":
    '쁴츠',

    "삋ㅐ":
    '쁴채',

    "삋ㅒ":
    '쁴챼',

    "삋ㅔ":
    '쁴체',

    "삋ㅖ":
    '쁴쳬',


     '삎ㅏ':
    '쁴파',
    
    '삎ㅓ':
    '쁴퍼',
    
    "삎ㅑ":
    '쁴퍄',
    
    "삎ㅕ":
    '쁴펴',

     "삎ㅗ":
    '쁴포',

    "삎ㅛ":
    '쁴표',

    "삎ㅜ":
    '쁴푸',

    "삎ㅠ":
    '쁴퓨',

    "삎ㅣ":
    '쁴피',

    "삎ㅡ":
    '쁴프',

    "삎ㅐ":
    '쁴패',

    "삎ㅒ":
    '쁴퍠',

    "삎ㅔ":
    '쁴페',

    "삎ㅖ":
    '쁴폐',

    

     '쁶ㅏ':
    '쁴까',
    
    '쁶ㅓ':
    '쁴꺼',
    
    "쁶ㅑ":
    '쁴꺄',
    
    "쁶ㅕ":
    '쁴껴',

     "쁶ㅗ":
    '쁴꼬',

    "쁶ㅛ":
    '쁴꾜',

    "쁶ㅜ":
    '쁴꾸',

    "쁶ㅠ":
    '쁴뀨',

    "쁶ㅣ":
    '쁴끼',

    "쁶ㅡ":
    '쁴끄',

    "쁶ㅐ":
    '쁴깨',

    "쁶ㅒ":
    '쁴꺠',

    "쁶ㅔ":
    '쁴께',

    "쁶ㅖ":
    '쁴꼐',


     '삈ㅏ':
    '쁴싸',
    
    '삈ㅓ':
    '쁴써',
    
    "삈ㅑ":
    '쁴쌰',
    
    "삈ㅕ":
    '쁴쎠',

     "삈ㅗ":
    '쁴쏘',

    "삈ㅛ":
    '쁴쑈',

    "삈ㅜ":
    '쁴쑤',

    "삈ㅠ":
    '쁴쓔',

    "삈ㅣ":
    '쁴씨',

    "삈ㅡ":
    '쁴쓰',

    "삈ㅐ":
    '쁴쌔',

    "삈ㅒ":
    '쁴썌',

    "삈ㅔ":
    '쁴쎄',

    "삈ㅖ":
    '쁴쎼',




    
    '찁ㅏ':
    '쯰바',
    
    '찁ㅓ':
    '쯰버',
    
    "찁ㅑ":
    '쯰뱌',
    
    "찁ㅕ":
    '쯰벼',

     "ㅗ":
    '쯰보',

    "찁ㅛ":
    '쯰뵤',

    "찁ㅜ":
    '쯰부',

    "찁ㅠ":
    '쯰뷰',

    "찁ㅣ":
    '쯰비',

    "찁ㅡ":
    '쯰브',

    "찁ㅐ":
    '쯰배',

    "찁ㅒ":
    '쯰뱨',

    "찁ㅔ":
    '쯰베',

    "찁ㅖ":
    '쯰볘',



    '찆ㅏ':
    '쯰자',
    
    '찆ㅓ':
    '쯰저',
    
    "찆ㅑ":
    '쯰쟈',
    
    "찆ㅕ":
    '쯰져',

     "찆ㅗ":
    '쯰조',

    "찆ㅛ":
    '쯰죠',

    "찆ㅜ":
    '쯰주',

    "찆ㅠ":
    '쯰쥬',

    "찆ㅣ":
    '쯰지',

    "찆ㅡ":
    '쯰즈',

    "찆ㅐ":
    '쯰재',

    "찆ㅒ":
    '쯰쟤',

    "찆ㅔ":
    '쯰제',

    "찆ㅖ":
    '쯰졔',


    '쯷ㅏ':
    '쯰다',
    
    '쯷ㅓ':
    '쯰더',
    
    "쯷ㅑ":
    '쯰댜',
    
    "쯷ㅕ":
    '쯰뎌',

     "쯷ㅗ":
    '쯰도',

    "쯷ㅛ":
    '쯰됴',

    "쯷ㅜ":
    '쯰두',

    "쯷ㅠ":
    '쯰듀',

    "쯷ㅣ":
    '쯰디',

    "쯷ㅡ":
    '쯰드',

    "쯷ㅐ":
    '쯰대',

    "쯷ㅒ":
    '쯰댸',

    "쯷ㅔ":
    '쯰데',

    "쯷ㅖ":
    '쯰뎨',



    '쯱ㅏ':
    '쯰가',
    
    '쯱ㅓ':
    '쯰거',
    
    "쯱ㅑ":
    '쯰갸',
    
    "쯱ㅕ":
    '쯰겨',

     "쯱ㅗ":
    '쯰고',

    "쯱ㅛ":
    '쯰교',

    "쯱ㅜ":
    '쯰구',

    "쯱ㅠ":
    '쯰규',

    "쯱ㅣ":
    '쯰기',

    "쯱ㅡ":
    '쯰그',

    "쯱ㅐ":
    '쯰개',

    "쯱ㅒ":
    '쯰걔',

    "쯱ㅔ":
    '쯰게',

    "쯱ㅖ":
    '쯰계',


    '찃ㅏ':
    '쯰사',
    
    '찃ㅓ':
    '쯰서',
    
    "찃ㅑ":
    '쯰샤',
    
    "찃ㅕ":
    '쯰셔',

     "찃ㅗ":
    '쯰소',

    "찃ㅛ":
    '쯰쇼',

    "찃ㅜ":
    '쯰수',

    "찃ㅠ":
    '쯰슈',

    "찃ㅣ":
    '쯰시',

    "찃ㅡ":
    '쯰스',

    "찃ㅐ":
    '쯰새',

    "찃ㅒ":
    '쯰섀',

    "찃ㅔ":
    '쯰세',

    "찃ㅖ":
    '쯰셰',


    '찀ㅏ':
    '쯰마',
    
    '찀ㅓ':
    '쯰머',
    
    "찀ㅑ":
    '쯰먀',
    
    "찀ㅕ":
    '쯰며',

     "찀ㅗ":
    '쯰모',

    "찀ㅛ":
    '쯰묘',

    "찀ㅜ":
    '쯰무',

    "찀ㅠ":
    '쯰뮤',

    "찀ㅣ":
    '쯰미',

    "찀ㅡ":
    '쯰므',

    "찀ㅐ":
    '쯰매',

    "찀ㅒ":
    '쯰먜',

    "찀ㅔ":
    '쯰메',

    "찀ㅖ":
    '쯰몌',

    
    '쯴ㅏ':
    '쯰나',
    
    '쯴ㅓ':
    '쯰너',
    
    "쯴ㅑ":
    '쯰냐',
    
    "쯴ㅕ":
    '쯰녀',

     "쯴ㅗ":
    '쯰노',

    "쯴ㅛ":
    '쯰뇨',

    "쯴ㅜ":
    '쯰누',

    "쯴ㅠ":
    '쯰뉴',

    "쯴ㅣ":
    '쯰니',

    "쯴ㅡ":
    '쯰느',

    "쯴ㅐ":
    '쯰내',

    "쯴ㅒ":
    '쯰냬',

    "쯴ㅔ":
    '쯰네',

    "쯴ㅖ":
    '쯰녜',

    

     '찅ㅏ':
    '쯰아',
    
    '찅ㅓ':
    '쯰어',
    
    "찅ㅑ":
    '쯰야',
    
    "찅ㅕ":
    '쯰여',

     "찅ㅗ":
    '쯰오',

    "찅ㅛ":
    '쯰요',

    "찅ㅜ":
    '쯰우',

    "찅ㅠ":
    '쯰유',

    "찅ㅣ":
    '쯰이',

    "찅ㅡ":
    '쯰으',

    "찅ㅐ":
    '쯰애',

    "찅ㅒ":
    '쯰얘',

    "찅ㅔ":
    '쯰에',

    "찅ㅖ":
    '쯰예',


    '쯸ㅏ':
    '쯰라',
    
    '쯸ㅓ':
    '쯰러',
    
    "쯸ㅑ":
    '쯰랴',
    
    "쯸ㅕ":
    '쯰려',

     "쯸ㅗ":
    '쯰로',

    "쯸ㅛ":
    '쯰료',

    "쯸ㅜ":
    '쯰루',

    "쯸ㅠ":
    '쯰류',

    "쯸ㅣ":
    '쯰리',

    "쯸ㅡ":
    '쯰르',

    "쯸ㅐ":
    '쯰래',

    "쯸ㅒ":
    '쯰럐',

    "쯸ㅔ":
    '쯰레',

    "쯸ㅖ":
    '쯰례',


    '찋ㅏ':
    '쯰하',
    
    '찋ㅓ':
    '쯰허',
    
    "찋ㅑ":
    '쯰햐',
    
    "찋ㅕ":
    '쯰혀',

     "찋ㅗ":
    '쯰호',

    "찋ㅛ":
    '쯰효',

    "찋ㅜ":
    '쯰후',

    "찋ㅠ":
    '쯰휴',

    "찋ㅣ":
    '쯰히',

    "찋ㅡ":
    '쯰흐',

    "찋ㅐ":
    '쯰해',

    "찋ㅒ":
    '쯰햬',

    "찋ㅔ":
    '쯰헤',

    "찋ㅖ":
    '쯰혜',


     '찈ㅏ':
    '쯰카',
    
    '찈ㅓ':
    '쯰커',
    
    "찈ㅑ":
    '쯰캬',
    
    "찈ㅕ":
    '쯰켜',

     "찈ㅗ":
    '쯰코',

    "찈ㅛ":
    '쯰쿄',

    "찈ㅜ":
    '쯰쿠',

    "찈ㅠ":
    '쯰큐',

    "찈ㅣ":
    '쯰키',

    "찈ㅡ":
    '쯰크',

    "찈ㅐ":
    '쯰캐',

    "찈ㅒ":
    '쯰컈',

    "찈ㅔ":
    '쯰케',

    "찈ㅖ":
    '쯰켸',


     '찉ㅏ':
    '쯰타',
    
    '찉ㅓ':
    '쯰터',
    
    "찉ㅑ":
    '쯰탸',
    
    "찉ㅕ":
    '쯰텨',

     "찉ㅗ":
    '쯰토',

    "찉ㅛ":
    '쯰툐',

    "찉ㅜ":
    '쯰투',

    "찉ㅠ":
    '쯰튜',

    "찉ㅣ":
    '쯰티',

    "찉ㅡ":
    '쯰트',

    "찉ㅐ":
    '쯰태',

    "찉ㅒ":
    '쯰턔',

    "찉ㅔ":
    '쯰테',

    "찉ㅖ":
    '쯰톄',


     '찇ㅏ':
    '쯰차',
    
    '찇ㅓ':
    '쯰처',
    
    "찇ㅑ":
    '쯰챠',
    
    "찇ㅕ":
    '쯰쳐',

     "찇ㅗ":
    '쯰초',

    "찇ㅛ":
    '쯰쵸',

    "찇ㅜ":
    '쯰추',

    "찇ㅠ":
    '쯰츄',

    "찇ㅣ":
    '쯰치',

    "찇ㅡ":
    '쯰츠',

    "찇ㅐ":
    '쯰채',

    "찇ㅒ":
    '쯰챼',

    "찇ㅔ":
    '쯰체',

    "찇ㅖ":
    '쯰쳬',


     '찊ㅏ':
    '쯰파',
    
    '찊ㅓ':
    '쯰퍼',
    
    "찊ㅑ":
    '쯰퍄',
    
    "찊ㅕ":
    '쯰펴',

     "찊ㅗ":
    '쯰포',

    "찊ㅛ":
    '쯰표',

    "찊ㅜ":
    '쯰푸',

    "찊ㅠ":
    '쯰퓨',

    "찊ㅣ":
    '쯰피',

    "찊ㅡ":
    '쯰프',

    "찊ㅐ":
    '쯰패',

    "찊ㅒ":
    '쯰퍠',

    "찊ㅔ":
    '쯰페',

    "찊ㅖ":
    '쯰폐',

    

     '쯲ㅏ':
    '쯰까',
    
    '쯲ㅓ':
    '쯰꺼',
    
    "쯲ㅑ":
    '쯰꺄',
    
    "쯲ㅕ":
    '쯰껴',

     "쯲ㅗ":
    '쯰꼬',

    "쯲ㅛ":
    '쯰꾜',

    "쯲ㅜ":
    '쯰꾸',

    "쯲ㅠ":
    '쯰뀨',

    "쯲ㅣ":
    '쯰끼',

    "쯲ㅡ":
    '쯰끄',

    "쯲ㅐ":
    '쯰깨',

    "쯲ㅒ":
    '쯰꺠',

    "쯲ㅔ":
    '쯰께',

    "쯲ㅖ":
    '쯰꼐',


     '찄ㅏ':
    '쯰싸',
    
    '찄ㅓ':
    '쯰써',
    
    "찄ㅑ":
    '쯰쌰',
    
    "찄ㅕ":
    '쯰쎠',

     "찄ㅗ":
    '쯰쏘',

    "찄ㅛ":
    '쯰쑈',

    "찄ㅜ":
    '쯰쑤',

    "찄ㅠ":
    '쯰쓔',

    "찄ㅣ":
    '쯰씨',

    "찄ㅡ":
    '쯰쓰',

    "찄ㅐ":
    '쯰쌔',

    "찄ㅒ":
    '쯰썌',

    "찄ㅔ":
    '쯰쎄',

    "찄ㅖ":
    '쯰쎼',
    
    

    
    
    
    
    
    
    
    "끹 ㅏ":
        "끠타",
    "띈ㅡ":
        "띄느"
    }
    
    
    
