# -*- coding: utf-8 -*-
dic = {
    "꿭ㅏ":
   "꿔타",
"꿭ㅓ":
   "꿔터",
"꿭ㅑ":
   "꿔탸",
"꿭ㅕ":
   "꿔텨",

"꿭ㅜ":
   "꿔투",
"꿭ㅠ":
   "꿔튜",
"꿭ㅗ":
   "꿔토",
"꿭ㅛ":
   "꿔툐",

"꿭ㅣ":
   "꿔티",
"꿭ㅡ":
   "꿔트",
"꿭ㅐ":
   "꿔태",
"꿭ㅒ":
   "꿔턔",
"꿭ㅔ":
   "꿔테",
"꿭ㅖ":
   "꿔톄",

"꿖ㅏ":
   "꿔까",
"꿖ㅓ":
   "꿔꺼",
"꿖ㅑ":
   "꿔꺄",
"꿖ㅕ":
   "꿔껴",

"꿖ㅜ":
   "꿔꾸",
"꿖ㅠ":
   "꿔뀨",
"꿖ㅗ":
   "꿔꼬",
"꿖ㅛ":
   "꿔꾜",

"꿖ㅣ":
   "꿔끼",
"꿖ㅡ":
   "꿔끄",
"꿖ㅐ":
   "꿔깨",
"꿖ㅒ":
   "꿔꺠",
"꿖ㅔ":
   "꿔께",
"꿖ㅖ":
   "꿔꼐",

"꿘ㅏ":
   "꿔나",
"꿘ㅓ":
   "꿔너",
"꿘ㅑ":
   "꿔냐",
"꿘ㅕ":
   "꿔녀",

"꿘ㅜ":
   "꿔누",
"꿘ㅠ":
   "꿔뉴",
"꿘ㅗ":
   "꿔노",
"꿘ㅛ":
   "꿔뇨",

"꿘ㅣ":
   "꿔니",
"꿘ㅡ":
   "꿔느",
"꿘ㅐ":
   "꿔내",
"꿘ㅒ":
   "꿔냬",
"꿘ㅔ":
   "꿔네",
"꿘ㅖ":
   "꿔녜",

"꿜ㅏ":
   "꿔라",
"꿜ㅓ":
   "꿔러",
"꿜ㅑ":
   "꿔랴",
"꿜ㅕ":
   "꿔려",

"꿜ㅜ":
   "꿔루",
"꿜ㅠ":
   "꿔류",
"꿜ㅗ":
   "꿔로",
"꿜ㅛ":
   "꿔료",

"꿜ㅣ":
   "꿔리",
"꿜ㅡ":
   "꿔르",
"꿜ㅐ":
   "꿔래",
"꿜ㅒ":
   "꿔럐",
"꿜ㅔ":
   "꿔레",
"꿜ㅖ":
   "꿔례",

"꿤ㅏ":
   "꿔마",
"꿤ㅓ":
   "꿔머",
"꿤ㅑ":
   "꿔먀",
"꿤ㅕ":
   "꿔며",

"꿤ㅜ":
   "꿔무",
"꿤ㅠ":
   "꿔뮤",
"꿤ㅗ":
   "꿔모",
"꿤ㅛ":
   "꿔묘",

"꿤ㅣ":
   "꿔미",
"꿤ㅡ":
   "꿔므",
"꿤ㅐ":
   "꿔매",
"꿤ㅒ":
   "꿔먜",
"꿤ㅔ":
   "꿔메",
"꿤ㅖ":
   "꿔몌",

"꿕ㅏ":
   "꿔가",
"꿕ㅓ":
   "꿔거",
"꿕ㅑ":
   "꿔갸",
"꿕ㅕ":
   "꿔겨",

"꿕ㅜ":
   "꿔구",
"꿕ㅠ":
   "꿔규",
"꿕ㅗ":
   "꿔고",
"꿕ㅛ":
   "꿔교",

"꿕ㅣ":
   "꿔기",
"꿕ㅡ":
   "꿔그",
"꿕ㅐ":
   "꿔개",
"꿕ㅒ":
   "꿔걔",
"꿕ㅔ":
   "꿔게",
"꿕ㅖ":
   "꿔계",

"꿛ㅏ":
   "꿔다",
"꿛ㅓ":
   "꿔더",
"꿛ㅑ":
   "꿔댜",
"꿛ㅕ":
   "꿔뎌",

"꿛ㅜ":
   "꿔두",
"꿛ㅠ":
   "꿔듀",
"꿛ㅗ":
   "꿔도",
"꿛ㅛ":
   "꿔됴",

"꿛ㅣ":
   "꿔디",
"꿛ㅡ":
   "꿔드",
"꿛ㅐ":
   "꿔대",
"꿛ㅒ":
   "꿔댸",
"꿛ㅔ":
   "꿔데",
"꿛ㅖ":
   "꿔뎨",

"꿥ㅏ":
   "꿔바",
"꿥ㅓ":
   "꿔버",
"꿥ㅑ":
   "꿔뱌",
"꿥ㅕ":
   "꿔벼",

"꿥ㅜ":
   "꿔부",
"꿥ㅠ":
   "꿔뷰",
"꿥ㅗ":
   "꿔보",
"꿥ㅛ":
   "꿔뵤",

"꿥ㅣ":
   "꿔비",
"꿥ㅡ":
   "꿔브",
"꿥ㅐ":
   "꿔배",
"꿥ㅒ":
   "꿔뱨",
"꿥ㅔ":
   "꿔베",
"꿥ㅖ":
   "꿔볘",

"꿧ㅏ":
   "꿔사",
"꿧ㅓ":
   "꿔서",
"꿧ㅑ":
   "꿔샤",
"꿧ㅕ":
   "꿔셔",

"꿧ㅜ":
   "꿔수",
"꿧ㅠ":
   "꿔슈",
"꿧ㅗ":
   "꿔소",
"꿧ㅛ":
   "꿔쇼",

"꿧ㅣ":
   "꿔시",
"꿧ㅡ":
   "꿔스",
"꿧ㅐ":
   "꿔새",
"꿧ㅒ":
   "꿔섀",
"꿧ㅔ":
   "꿔세",
"꿧ㅖ":
   "꿔셰",

"꿨ㅏ":
   "꿔싸",
"꿨ㅓ":
   "꿔써",
"꿨ㅑ":
   "꿔쌰",
"꿨ㅕ":
   "꿔쎠",

"꿨ㅜ":
   "꿔쑤",
"꿨ㅠ":
   "꿔쓔",
"꿨ㅗ":
   "꿔쏘",
"꿨ㅛ":
   "꿔쑈",

"꿨ㅣ":
   "꿔씨",
"꿨ㅡ":
   "꿔쓰",
"꿨ㅐ":
   "꿔쌔",
"꿨ㅒ":
   "꿔썌",
"꿨ㅔ":
   "꿔쎄",
"꿨ㅖ":
   "꿔쎼",

"꿩ㅏ":
   "꿔아",
"꿩ㅓ":
   "꿔어",
"꿩ㅑ":
   "꿔야",
"꿩ㅕ":
   "꿔여",

"꿩ㅜ":
   "꿔우",
"꿩ㅠ":
   "꿔유",
"꿩ㅗ":
   "꿔오",
"꿩ㅛ":
   "꿔요",

"꿩ㅣ":
   "꿔이",
"꿩ㅡ":
   "꿔으",
"꿩ㅐ":
   "꿔애",
"꿩ㅒ":
   "꿔얘",
"꿩ㅔ":
   "꿔에",
"꿩ㅖ":
   "꿔예",

"꿪ㅏ":
   "꿔자",
"꿪ㅓ":
   "꿔저",
"꿪ㅑ":
   "꿔쟈",
"꿪ㅕ":
   "꿔져",

"꿪ㅜ":
   "꿔주",
"꿪ㅠ":
   "꿔쥬",
"꿪ㅗ":
   "꿔조",
"꿪ㅛ":
   "꿔죠",

"꿪ㅣ":
   "꿔지",
"꿪ㅡ":
   "꿔즈",
"꿪ㅐ":
   "꿔재",
"꿪ㅒ":
   "꿔쟤",
"꿪ㅔ":
   "꿔제",
"꿪ㅖ":
   "꿔졔",

"꿫ㅏ":
   "꿔차",
"꿫ㅓ":
   "꿔처",
"꿫ㅑ":
   "꿔챠",
"꿫ㅕ":
   "꿔쳐",

"꿫ㅜ":
   "꿔추",
"꿫ㅠ":
   "꿔츄",
"꿫ㅗ":
   "꿔초",
"꿫ㅛ":
   "꿔쵸",

"꿫ㅣ":
   "꿔치",
"꿫ㅡ":
   "꿔츠",
"꿫ㅐ":
   "꿔채",
"꿫ㅒ":
   "꿔챼",
"꿫ㅔ":
   "꿔체",
"꿫ㅖ":
   "꿔쳬",

"꿭ㅏ":
   "꿔타",
"꿭ㅓ":
   "꿔터",
"꿭ㅑ":
   "꿔탸",
"꿭ㅕ":
   "꿔텨",

"꿭ㅜ":
   "꿔투",
"꿭ㅠ":
   "꿔튜",
"꿭ㅗ":
   "꿔토",
"꿭ㅛ":
   "꿔툐",

"꿭ㅣ":
   "꿔티",
"꿭ㅡ":
   "꿔트",
"꿭ㅐ":
   "꿔태",
"꿭ㅒ":
   "꿔턔",
"꿭ㅔ":
   "꿔테",
"꿭ㅖ":
   "꿔톄",

"꿬ㅏ":
   "꿔카",
"꿬ㅓ":
   "꿔커",
"꿬ㅑ":
   "꿔캬",
"꿬ㅕ":
   "꿔켜",

"꿬ㅜ":
   "꿔쿠",
"꿬ㅠ":
   "꿔큐",
"꿬ㅗ":
   "꿔코",
"꿬ㅛ":
   "꿔쿄",

"꿬ㅣ":
   "꿔키",
"꿬ㅡ":
   "꿔크",
"꿬ㅐ":
   "꿔캐",
"꿬ㅒ":
   "꿔컈",
"꿬ㅔ":
   "꿔케",
"꿬ㅖ":
   "꿔켸",

"꿮ㅏ":
   "꿔파",
"꿮ㅓ":
   "꿔퍼",
"꿮ㅑ":
   "꿔퍄",
"꿮ㅕ":
   "꿔펴",

"꿮ㅜ":
   "꿔푸",
"꿮ㅠ":
   "꿔퓨",
"꿮ㅗ":
   "꿔포",
"꿮ㅛ":
   "꿔표",

"꿮ㅣ":
   "꿔피",
"꿮ㅡ":
   "꿔프",
"꿮ㅐ":
   "꿔패",
"꿮ㅒ":
   "꿔퍠",
"꿮ㅔ":
   "꿔페",
"꿮ㅖ":
   "꿔폐",

"꿯ㅏ":
   "꿔하",
"꿯ㅓ":
   "꿔허",
"꿯ㅑ":
   "꿔햐",
"꿯ㅕ":
   "꿔혀",

"꿯ㅜ":
   "꿔후",
"꿯ㅠ":
   "꿔휴",
"꿯ㅗ":
   "꿔호",
"꿯ㅛ":
   "꿔효",

"꿯ㅣ":
   "꿔히",
"꿯ㅡ":
   "꿔흐",
"꿯ㅐ":
   "꿔해",
"꿯ㅒ":
   "꿔햬",
"꿯ㅔ":
   "꿔헤",
"꿯ㅖ":
   "꿔혜",

"뛋ㅏ":
   "뚸사",
"뛋ㅓ":
   "뚸서",
"뛋ㅑ":
   "뚸샤",
"뛋ㅕ":
   "뚸셔",

"뛋ㅜ":
   "뚸수",
"뛋ㅠ":
   "뚸슈",
"뛋ㅗ":
   "뚸소",
"뛋ㅛ":
   "뚸쇼",

"뛋ㅣ":
   "뚸시",
"뛋ㅡ":
   "뚸스",
"뛋ㅐ":
   "뚸새",
"뛋ㅒ":
   "뚸섀",
"뛋ㅔ":
   "뚸세",
"뛋ㅖ":
   "뚸셰",

"뚹ㅏ":
   "뚸가",
"뚹ㅓ":
   "뚸거",
"뚹ㅑ":
   "뚸갸",
"뚹ㅕ":
   "뚸겨",

"뚹ㅜ":
   "뚸구",
"뚹ㅠ":
   "뚸규",
"뚹ㅗ":
   "뚸고",
"뚹ㅛ":
   "뚸교",

"뚹ㅣ":
   "뚸기",
"뚹ㅡ":
   "뚸그",
"뚹ㅐ":
   "뚸개",
"뚹ㅒ":
   "뚸걔",
"뚹ㅔ":
   "뚸게",
"뚹ㅖ":
   "뚸계",

"뚺ㅏ":
   "뚸까",
"뚺ㅓ":
   "뚸꺼",
"뚺ㅑ":
   "뚸꺄",
"뚺ㅕ":
   "뚸껴",

"뚺ㅜ":
   "뚸꾸",
"뚺ㅠ":
   "뚸뀨",
"뚺ㅗ":
   "뚸꼬",
"뚺ㅛ":
   "뚸꾜",

"뚺ㅣ":
   "뚸끼",
"뚺ㅡ":
   "뚸끄",
"뚺ㅐ":
   "뚸깨",
"뚺ㅒ":
   "뚸꺠",
"뚺ㅔ":
   "뚸께",
"뚺ㅖ":
   "뚸꼐",

"뚼ㅏ":
   "뚸나",
"뚼ㅓ":
   "뚸너",
"뚼ㅑ":
   "뚸냐",
"뚼ㅕ":
   "뚸녀",

"뚼ㅜ":
   "뚸누",
"뚼ㅠ":
   "뚸뉴",
"뚼ㅗ":
   "뚸노",
"뚼ㅛ":
   "뚸뇨",

"뚼ㅣ":
   "뚸니",
"뚼ㅡ":
   "뚸느",
"뚼ㅐ":
   "뚸내",
"뚼ㅒ":
   "뚸냬",
"뚼ㅔ":
   "뚸네",
"뚼ㅖ":
   "뚸녜",
    
"뚿ㅏ":
   "뚸다",
"뚿ㅓ":
   "뚸더",
"뚿ㅑ":
   "뚸댜",
"뚿ㅕ":
   "뚸뎌",

"뚿ㅜ":
   "뚸두",
"뚿ㅠ":
   "뚸듀",
"뚿ㅗ":
   "뚸도",
"뚿ㅛ":
   "뚸됴",

"뚿ㅣ":
   "뚸디",
"뚿ㅡ":
   "뚸드",
"뚿ㅐ":
   "뚸대",
"뚿ㅒ":
   "뚸댸",
"뚿ㅔ":
   "뚸데",
"뚿ㅖ":
   "뚸뎨",

"뛀ㅏ":
   "뛰라",
"뛀ㅓ":
   "뛰러",
"뛀ㅑ":
   "뛰랴",
"뛀ㅕ":
   "뛰려",

"뛀ㅜ":
   "뛰루",
"뛀ㅠ":
   "뛰류",
"뛀ㅗ":
   "뛰로",
"뛀ㅛ":
   "뛰료",

"뛀ㅣ":
   "뛰리",
"뛀ㅡ":
   "뛰르",
"뛀ㅐ":
   "뛰래",
"뛀ㅒ":
   "뛰럐",
"뛀ㅔ":
   "뛰레",
"뛀ㅖ":
   "뛰례",

"뛈ㅏ":
   "뚸마",
"뛈ㅓ":
   "뚸머",
"뛈ㅑ":
   "뚸먀",
"뛈ㅕ":
   "뚸며",

"뛈ㅜ":
   "뚸무",
"뛈ㅠ":
   "뚸뮤",
"뛈ㅗ":
   "뚸모",
"뛈ㅛ":
   "뚸묘",

"뛈ㅣ":
   "뚸미",
"뛈ㅡ":
   "뚸므",
"뛈ㅐ":
   "뚸매",
"뛈ㅒ":
   "뚸먜",
"뛈ㅔ":
   "뚸메",
"뛈ㅖ":
   "뚸몌",

"뛈ㅏ":
   "뚸마",
"뛈ㅓ":
   "뚸머",
"뛈ㅑ":
   "뚸먀",
"뛈ㅕ":
   "뚸며",

"뛈ㅜ":
   "뚸무",
"뛈ㅠ":
   "뚸뮤",
"뛈ㅗ":
   "뚸모",
"뛈ㅛ":
   "뚸묘",

"뛈ㅣ":
   "뚸미",
"뛈ㅡ":
   "뚸므",
"뛈ㅐ":
   "뚸매",
"뛈ㅒ":
   "뚸먜",
"뛈ㅔ":
   "뚸메",
"뛈ㅖ":
   "뚸몌",

"뛉ㅏ":
   "뚸바",
"뛉ㅓ":
   "뚸버",
"뛉ㅑ":
   "뚸뱌",
"뛉ㅕ":
   "뚸벼",

"뛉ㅜ":
   "뚸부",
"뛉ㅠ":
   "뚸뷰",
"뛉ㅗ":
   "뚸보",
"뛉ㅛ":
   "뚸뵤",

"뛉ㅣ":
   "뚸비",
"뛉ㅡ":
   "뚸브",
"뛉ㅐ":
   "뚸배",
"뛉ㅒ":
   "뚸뱨",
"뛉ㅔ":
   "뚸베",
"뛉ㅖ":
   "뚸볘",

"뛌ㅏ":
   "뚸싸",
"뛌ㅓ":
   "뚸써",
"뛌ㅑ":
   "뚸쌰",
"뛌ㅕ":
   "뚸쎠",

"뛌ㅜ":
   "뚸쑤",
"뛌ㅠ":
   "뚸쓔",
"뛌ㅗ":
   "뚸쏘",
"뛌ㅛ":
   "뚸쑈",

"뛌ㅣ":
   "뚸씨",
"뛌ㅡ":
   "뚸쓰",
"뛌ㅐ":
   "뚸쌔",
"뛌ㅒ":
   "뚸썌",
"뛌ㅔ":
   "뚸쎄",
"뛌ㅖ":
   "뚸쎼",

"뛍ㅏ":
   "뚸아",
"뛍ㅓ":
   "뚸어",
"뛍ㅑ":
   "뚸야",
"뛍ㅕ":
   "뚸여",

"뛍ㅜ":
   "뚸우",
"뛍ㅠ":
   "뚸유",
"뛍ㅗ":
   "뚸오",
"뛍ㅛ":
   "뚸요",

"뛍ㅣ":
   "뚸이",
"뛍ㅡ":
   "뚸으",
"뛍ㅐ":
   "뚸애",
"뛍ㅒ":
   "뚸얘",
"뛍ㅔ":
   "뚸에",
"뛍ㅖ":
   "뚸예",

"뛎ㅏ":
   "뚸자",
"뛎ㅓ":
   "뚸저",
"뛎ㅑ":
   "뚸쟈",
"뛎ㅕ":
   "뚸져",

"뛎ㅜ":
   "뚸주",
"뛎ㅠ":
   "뚸쥬",
"뛎ㅗ":
   "뚸조",
"뛎ㅛ":
   "뚸죠",

"뛎ㅣ":
   "뚸지",
"뛎ㅡ":
   "뚸즈",
"뛎ㅐ":
   "뚸재",
"뛎ㅒ":
   "뚸쟤",
"뛎ㅔ":
   "뚸제",
"뛎ㅖ":
   "뚸졔",

"꿭ㅏ":
   "꿔타",
"꿭ㅓ":
   "꿔터",
"꿭ㅑ":
   "꿔탸",
"꿭ㅕ":
   "꿔텨",

"꿭ㅜ":
   "꿔투",
"꿭ㅠ":
   "꿔튜",
"꿭ㅗ":
   "꿔토",
"꿭ㅛ":
   "꿔툐",

"꿭ㅣ":
   "꿔티",
"꿭ㅡ":
   "꿔트",
"꿭ㅐ":
   "꿔태",
"꿭ㅒ":
   "꿔턔",
"꿭ㅔ":
   "꿔테",
"꿭ㅖ":
   "꿔톄",

"뛐ㅏ":
   "뚸카",
"뛐ㅓ":
   "뚸커",
"뛐ㅑ":
   "뚸캬",
"뛐ㅕ":
   "뚸켜",

"뛐ㅜ":
   "뚸쿠",
"뛐ㅠ":
   "뚸큐",
"뛐ㅗ":
   "뚸코",
"뛐ㅛ":
   "뚸쿄",

"뛐ㅣ":
   "뚸키",
"뛐ㅡ":
   "뚸크",
"뛐ㅐ":
   "뚸캐",
"뛐ㅒ":
   "뚸컈",
"뛐ㅔ":
   "뚸케",
"뛐ㅖ":
   "뚸켸",

"뙽ㅏ":
   "뚸타",
"뙽ㅓ":
   "뚸터",
"뙽ㅑ":
   "뚸탸",
"뙽ㅕ":
   "뚸텨",

"뙽ㅜ":
   "뚸투",
"뙽ㅠ":
   "뚸튜",
"뙽ㅗ":
   "뚸토",
"뙽ㅛ":
   "뚸툐",

"뙽ㅣ":
   "뚸티",
"뙽ㅡ":
   "뚸트",
"뙽ㅐ":
   "뚸태",
"뙽ㅒ":
   "뚸턔",
"뙽ㅔ":
   "뚸테",
"뙽ㅖ":
   "뚸톄",

"뛒ㅏ":
   "뚸파",
"뛒ㅓ":
   "뚸퍼",
"뛒ㅑ":
   "뚸퍄",
"뛒ㅕ":
   "뚸펴",

"뛒ㅜ":
   "뚸푸",
"뛒ㅠ":
   "뚸퓨",
"뛒ㅗ":
   "뚸포",
"뛒ㅛ":
   "뚸표",

"뛒ㅣ":
   "뚸피",
"뛒ㅡ":
   "뚸프",
"뛒ㅐ":
   "뚸패",
"뛒ㅒ":
   "뚸퍠",
"뛒ㅔ":
   "뚸페",
"뛒ㅖ":
   "뚸폐",
"뛓ㅏ":
   "뚸하",
"뛓ㅓ":
   "뚸허",
"뛓ㅑ":
   "뚸햐",
"뛓ㅕ":
   "뚸혀",

"뛓ㅜ":
   "뚸후",
"뛓ㅠ":
   "뚸휴",
"뛓ㅗ":
   "뚸호",
"뛓ㅛ":
   "뚸효",

"뛓ㅣ":
   "뚸히",
"뛓ㅡ":
   "뚸흐",
"뛓ㅐ":
   "뚸해",
"뛓ㅒ":
   "뚸햬",
"뛓ㅔ":
   "뚸헤",
"뛓ㅖ":
   "뚸혜",

"뿪ㅏ":
   "뿨까",
"뿪ㅓ":
   "뿨꺼",
"뿪ㅑ":
   "뿨꺄",
"뿪ㅕ":
   "뿨껴",

"뿪ㅜ":
   "뿨꾸",
"뿪ㅠ":
   "뿨뀨",
"뿪ㅗ":
   "뿨꼬",
"뿪ㅛ":
   "뿨꾜",

"뿪ㅣ":
   "뿨끼",
"뿪ㅡ":
   "뿨끄",
"뿪ㅐ":
   "뿨깨",
"뿪ㅒ":
   "뿨꺠",
"뿪ㅔ":
   "뿨께",
"뿪ㅖ":
   "뿨꼐",

"뿩ㅏ":
   "뿨가",
"뿩ㅓ":
   "뿨거",
"뿩ㅑ":
   "뿨갸",
"뿩ㅕ":
   "뿨겨",

"뿩ㅜ":
   "뿨구",
"뿩ㅠ":
   "뿨규",
"뿩ㅗ":
   "뿨고",
"뿩ㅛ":
   "뿨교",

"뿩ㅣ":
   "뿨기",
"뿩ㅡ":
   "뿨그",
"뿩ㅐ":
   "뿨개",
"뿩ㅒ":
   "뿨걔",
"뿩ㅔ":
   "뿨게",
"뿩ㅖ":
   "뿨계",

"뿬ㅏ":
   "뿨나",
"뿬ㅓ":
   "뿨너",
"뿬ㅑ":
   "뿨냐",
"뿬ㅕ":
   "뿨녀",

"뿬ㅜ":
   "뿨누",
"뿬ㅠ":
   "뿨뉴",
"뿬ㅗ":
   "뿨노",
"뿬ㅛ":
   "뿨뇨",

"뿬ㅣ":
   "뿨니",
"뿬ㅡ":
   "뿨느",
"뿬ㅐ":
   "뿨내",
"뿬ㅒ":
   "뿨냬",
"뿬ㅔ":
   "뿨네",
"뿬ㅖ":
   "뿨녜",

"뿯ㅏ":
   "뿨다",
"뿯ㅓ":
   "뿨더",
"뿯ㅑ":
   "뿨댜",
"뿯ㅕ":
   "뿨뎌",

"뿯ㅜ":
   "뿨두",
"뿯ㅠ":
   "뿨듀",
"뿯ㅗ":
   "뿨도",
"뿯ㅛ":
   "뿨됴",

"뿯ㅣ":
   "뿨디",
"뿯ㅡ":
   "뿨드",
"뿯ㅐ":
   "뿨대",
"뿯ㅒ":
   "뿨댸",
"뿯ㅔ":
   "뿨데",
"뿯ㅖ":
   "뿨뎨",

"뿰ㅏ":
   "뿨라",
"뿰ㅓ":
   "뿨러",
"뿰ㅑ":
   "뿨랴",
"뿰ㅕ":
   "뿨려",

"뿰ㅜ":
   "뿨루",
"뿰ㅠ":
   "뿨류",
"뿰ㅗ":
   "뿨로",
"뿰ㅛ":
   "뿨료",

"뿰ㅣ":
   "뿨리",
"뿰ㅡ":
   "뿨르",
"뿰ㅐ":
   "뿨래",
"뿰ㅒ":
   "뿨럐",
"뿰ㅔ":
   "뿨레",
"뿰ㅖ":
   "뿨례",

"뿸ㅏ":
   "뿨마",
"뿸ㅓ":
   "뿨머",
"뿸ㅑ":
   "뿨먀",
"뿸ㅕ":
   "뿨며",

"뿸ㅜ":
   "뿨무",
"뿸ㅠ":
   "뿨뮤",
"뿸ㅗ":
   "뿨모",
"뿸ㅛ":
   "뿨묘",

"뿸ㅣ":
   "뿨미",
"뿸ㅡ":
   "뿨므",
"뿸ㅐ":
   "뿨매",
"뿸ㅒ":
   "뿨먜",
"뿸ㅔ":
   "뿨메",
"뿸ㅖ":
   "뿨몌",

"뿻ㅏ":
   "뿨사",
"뿻ㅓ":
   "뿨서",
"뿻ㅑ":
   "뿨샤",
"뿻ㅕ":
   "뿨셔",

"뿻ㅜ":
   "뿨수",
"뿻ㅠ":
   "뿨슈",
"뿻ㅗ":
   "뿨소",
"뿻ㅛ":
   "뿨쇼",

"뿻ㅣ":
   "뿨시",
"뿻ㅡ":
   "뿨스",
"뿻ㅐ":
   "뿨새",
"뿻ㅒ":
   "뿨섀",
"뿻ㅔ":
   "뿨세",
"뿻ㅖ":
   "뿨셰",

"뿽ㅏ":
   "뿨아",
"뿽ㅓ":
   "뿨어",
"뿽ㅑ":
   "뿨야",
"뿽ㅕ":
   "뿨여",

"뿽ㅜ":
   "뿨우",
"뿽ㅠ":
   "뿨유",
"뿽ㅗ":
   "뿨오",
"뿽ㅛ":
   "뿨요",

"뿽ㅣ":
   "뿨이",
"뿽ㅡ":
   "뿨으",
"뿽ㅐ":
   "뿨애",
"뿽ㅒ":
   "뿨얘",
"뿽ㅔ":
   "뿨에",
"뿽ㅖ":
   "뿨예",

"뿾ㅏ":
   "뿨자",
"뿾ㅓ":
   "뿨저",
"뿾ㅑ":
   "뿨쟈",
"뿾ㅕ":
   "뿨져",

"뿾ㅜ":
   "뿨주",
"뿾ㅠ":
   "뿨쥬",
"뿾ㅗ":
   "뿨조",
"뿾ㅛ":
   "뿨죠",

"뿾ㅣ":
   "뿨지",
"뿾ㅡ":
   "뿨즈",
"뿾ㅐ":
   "뿨재",
"뿾ㅒ":
   "뿨쟤",
"뿾ㅔ":
   "뿨제",
"뿾ㅖ":
   "뿨졔",

"뿿ㅏ":
   "뿨차",
"뿿ㅓ":
   "뿨처",
"뿿ㅑ":
   "뿨챠",
"뿿ㅕ":
   "뿨쳐",

"뿿ㅜ":
   "뿨추",
"뿿ㅠ":
   "뿨츄",
"뿿ㅗ":
   "뿨초",
"뿿ㅛ":
   "뿨쵸",

"뿿ㅣ":
   "뿨치",
"뿿ㅡ":
   "뿨츠",
"뿿ㅐ":
   "뿨채",
"뿿ㅒ":
   "뿨챼",
"뿿ㅔ":
   "뿨체",
"뿿ㅖ":
   "뿨쳬",

"쀀ㅏ":
   "뿨카",
"쀀ㅓ":
   "뿨커",
"쀀ㅑ":
   "뿨캬",
"쀀ㅕ":
   "뿨켜",

"쀀ㅜ":
   "뿨쿠",
"쀀ㅠ":
   "뿨큐",
"쀀ㅗ":
   "뿨코",
"쀀ㅛ":
   "뿨쿄",

"쀀ㅣ":
   "뿨키",
"쀀ㅡ":
   "뿨크",
"쀀ㅐ":
   "뿨캐",
"쀀ㅒ":
   "뿨컈",
"쀀ㅔ":
   "뿨케",
"쀀ㅖ":
   "뿨켸",

"쀁ㅏ":
   "뿨타",
"쀁ㅓ":
   "뿨터",
"쀁ㅑ":
   "뿨탸",
"쀁ㅕ":
   "뿨텨",

"쀁ㅜ":
   "뿨투",
"쀁ㅠ":
   "뿨튜",
"쀁ㅗ":
   "뿨토",
"쀁ㅛ":
   "뿨툐",

"쀁ㅣ":
   "뿨티",
"쀁ㅡ":
   "뿨트",
"쀁ㅐ":
   "뿨태",
"쀁ㅒ":
   "뿨턔",
"쀁ㅔ":
   "뿨테",
"쀁ㅖ":
   "뿨톄",

"쀂ㅏ":
   "뿨파",
"쀂ㅓ":
   "뿨퍼",
"쀂ㅑ":
   "뿨퍄",
"쀂ㅕ":
   "뿨펴",

"쀂ㅜ":
   "뿨푸",
"쀂ㅠ":
   "뿨퓨",
"쀂ㅗ":
   "뿨포",
"쀂ㅛ":
   "뿨표",

"쀂ㅣ":
   "뿨피",
"쀂ㅡ":
   "뿨프",
"쀂ㅐ":
   "뿨패",
"쀂ㅒ":
   "뿨퍠",
"쀂ㅔ":
   "뿨페",
"쀂ㅖ":
   "뿨폐",

"쀃ㅏ":
   "뿨하",
"쀃ㅓ":
   "뿨허",
"쀃ㅑ":
   "뿨햐",
"쀃ㅕ":
   "뿨혀",

"쀃ㅜ":
   "뿨후",
"쀃ㅠ":
   "뿨휴",
"쀃ㅗ":
   "뿨호",
"쀃ㅛ":
   "뿨효",

"쀃ㅣ":
   "뿨히",
"쀃ㅡ":
   "뿨흐",
"쀃ㅐ":
   "뿨해",
"쀃ㅒ":
   "뿨햬",
"쀃ㅔ":
   "뿨헤",
"쀃ㅖ":
   "뿨혜",

"쀀ㅏ":
   "뿨카",
"쀀ㅓ":
   "뿨커",
"쀀ㅑ":
   "뿨캬",
"쀀ㅕ":
   "뿨켜",

"쀀ㅜ":
   "뿨쿠",
"쀀ㅠ":
   "뿨큐",
"쀀ㅗ":
   "뿨코",
"쀀ㅛ":
   "뿨쿄",

"쀀ㅣ":
   "뿨키",
"쀀ㅡ":
   "뿨크",
"쀀ㅐ":
   "뿨캐",
"쀀ㅒ":
   "뿨컈",
"쀀ㅔ":
   "뿨케",
"쀀ㅖ":
   "뿨켸",

"쀂ㅏ":
   "뿨파",
"쀂ㅓ":
   "뿨퍼",
"쀂ㅑ":
   "뿨퍄",
"쀂ㅕ":
   "뿨펴",

"쀂ㅜ":
   "뿨푸",
"쀂ㅠ":
   "뿨퓨",
"쀂ㅗ":
   "뿨포",
"쀂ㅛ":
   "뿨표",

"쀂ㅣ":
   "뿨피",
"쀂ㅡ":
   "뿨프",
"쀂ㅐ":
   "뿨패",
"쀂ㅒ":
   "뿨퍠",
"쀂ㅔ":
   "뿨페",
"쀂ㅖ":
   "뿨폐",

"쀃ㅏ":
   "뿨하",
"쀃ㅓ":
   "뿨허",
"쀃ㅑ":
   "뿨햐",
"쀃ㅕ":
   "뿨혀",

"쀃ㅜ":
   "뿨후",
"쀃ㅠ":
   "뿨휴",
"쀃ㅗ":
   "뿨호",
"쀃ㅛ":
   "뿨효",

"쀃ㅣ":
   "뿨히",
"쀃ㅡ":
   "뿨흐",
"쀃ㅐ":
   "뿨해",
"쀃ㅒ":
   "뿨햬",
"쀃ㅔ":
   "뿨헤",
"쀃ㅖ":
   "뿨혜",

"뿼ㅏ":
   "뿨싸",
"뿼ㅓ":
   "뿨써",
"뿼ㅑ":
   "뿨쌰",
"뿼ㅕ":
   "뿨쎠",

"뿼ㅜ":
   "뿨쑤",
"뿼ㅠ":
   "뿨쓔",
"뿼ㅗ":
   "뿨쏘",
"뿼ㅛ":
   "뿨쑈",

"뿼ㅣ":
   "뿨씨",
"뿼ㅡ":
   "뿨쓰",
"뿼ㅐ":
   "뿨쌔",
"뿼ㅒ":
   "뿨썌",
"뿼ㅔ":
   "뿨쎄",
"뿼ㅖ":
   "뿨쎼",

"뾥ㅏ":
   "뾔바",
"뾥ㅓ":
   "뾔버",
"뾥ㅑ":
   "뾔뱌",
"뾥ㅕ":
   "뾔벼",

"뾥ㅜ":
   "뾔부",
"뾥ㅠ":
   "뾔뷰",
"뾥ㅗ":
   "뾔보",
"뾥ㅛ":
   "뾔뵤",

"뾥ㅣ":
   "뾔비",
"뾥ㅡ":
   "뾔브",
"뾥ㅐ":
   "뾔배",
"뾥ㅒ":
   "뾔뱨",
"뾥ㅔ":
   "뾔베",
"뾥ㅖ":
   "뾔볘",
    

"쒁ㅏ":
   "쒀가",
"쒁ㅓ":
   "쒀거",
"쒁ㅑ":
   "쒀갸",
"쒁ㅕ":
   "쒀겨",

"쒁ㅜ":
   "쒀구",
"쒁ㅠ":
   "쒀규",
"쒁ㅗ":
   "쒀고",
"쒁ㅛ":
   "쒀교",

"쒁ㅣ":
   "쒀기",
"쒁ㅡ":
   "쒀그",
"쒁ㅐ":
   "쒀개",
"쒁ㅒ":
   "쒀걔",
"쒁ㅔ":
   "쒀게",
"쒁ㅖ":
   "쒀계",

"쒂ㅏ":
   "쒀까",
"쒂ㅓ":
   "쒀꺼",
"쒂ㅑ":
   "쒀꺄",
"쒂ㅕ":
   "쒀껴",

"쒂ㅜ":
   "쒀꾸",
"쒂ㅠ":
   "쒀뀨",
"쒂ㅗ":
   "쒀꼬",
"쒂ㅛ":
   "쒀꾜",

"쒂ㅣ":
   "쒀끼",
"쒂ㅡ":
   "쒀끄",
"쒂ㅐ":
   "쒀깨",
"쒂ㅒ":
   "쒀꺠",
"쒂ㅔ":
   "쒀께",
"쒂ㅖ":
   "쒀꼐",

"쒄ㅏ":
   "쒀나",
"쒄ㅓ":
   "쒀너",
"쒄ㅑ":
   "쒀냐",
"쒄ㅕ":
   "쒀녀",

"쒄ㅜ":
   "쒀누",
"쒄ㅠ":
   "쒀뉴",
"쒄ㅗ":
   "쒀노",
"쒄ㅛ":
   "쒀뇨",

"쒄ㅣ":
   "쒀니",
"쒄ㅡ":
   "쒀느",
"쒄ㅐ":
   "쒀내",
"쒄ㅒ":
   "쒀냬",
"쒄ㅔ":
   "쒀네",
"쒄ㅖ":
   "쒀녜",

"쒇ㅏ":
   "쒀다",
"쒇ㅓ":
   "쒀더",
"쒇ㅑ":
   "쒀댜",
"쒇ㅕ":
   "쒀뎌",

"쒇ㅜ":
   "쒀두",
"쒇ㅠ":
   "쒀듀",
"쒇ㅗ":
   "쒀도",
"쒇ㅛ":
   "쒀됴",

"쒇ㅣ":
   "쒀디",
"쒇ㅡ":
   "쒀드",
"쒇ㅐ":
   "쒀대",
"쒇ㅒ":
   "쒀댸",
"쒇ㅔ":
   "쒀데",
"쒇ㅖ":
   "쒀뎨",

"쒈ㅏ":
   "쒀라",
"쒈ㅓ":
   "쒀러",
"쒈ㅑ":
   "쒀랴",
"쒈ㅕ":
   "쒀려",

"쒈ㅜ":
   "쒀루",
"쒈ㅠ":
   "쒀류",
"쒈ㅗ":
   "쒀로",
"쒈ㅛ":
   "쒀료",

"쒈ㅣ":
   "쒀리",
"쒈ㅡ":
   "쒀르",
"쒈ㅐ":
   "쒀래",
"쒈ㅒ":
   "쒀럐",
"쒈ㅔ":
   "쒀레",
"쒈ㅖ":
   "쒀례",

"쒐ㅏ":
   "쒀마",
"쒐ㅓ":
   "쒀머",
"쒐ㅑ":
   "쒀먀",
"쒐ㅕ":
   "쒀며",

"쒐ㅜ":
   "쒀무",
"쒐ㅠ":
   "쒀뮤",
"쒐ㅗ":
   "쒀모",
"쒐ㅛ":
   "쒀묘",

"쒐ㅣ":
   "쒀미",
"쒐ㅡ":
   "쒀므",
"쒐ㅐ":
   "쒀매",
"쒐ㅒ":
   "쒀먜",
"쒐ㅔ":
   "쒀메",
"쒐ㅖ":
   "쒀몌",

"쒑ㅏ":
   "쒀바",
"쒑ㅓ":
   "쒀버",
"쒑ㅑ":
   "쒀뱌",
"쒑ㅕ":
   "쒀벼",

"쒑ㅜ":
   "쒀부",
"쒑ㅠ":
   "쒀뷰",
"쒑ㅗ":
   "쒀보",
"쒑ㅛ":
   "쒀뵤",

"쒑ㅣ":
   "쒀비",
"쒑ㅡ":
   "쒀브",
"쒑ㅐ":
   "쒀배",
"쒑ㅒ":
   "쒀뱨",
"쒑ㅔ":
   "쒀베",
"쒑ㅖ":
   "쒀볘",

"쒓ㅏ":
   "쒀사",
"쒓ㅓ":
   "쒀서",
"쒓ㅑ":
   "쒀샤",
"쒓ㅕ":
   "쒀셔",

"쒓ㅜ":
   "쒀수",
"쒓ㅠ":
   "쒀슈",
"쒓ㅗ":
   "쒀소",
"쒓ㅛ":
   "쒀쇼",

"쒓ㅣ":
   "쒀시",
"쒓ㅡ":
   "쒀스",
"쒓ㅐ":
   "쒀새",
"쒓ㅒ":
   "쒀섀",
"쒓ㅔ":
   "쒀세",
"쒓ㅖ":
   "쒀셰",

"쒔ㅏ":
   "쒀싸",
"쒔ㅓ":
   "쒀써",
"쒔ㅑ":
   "쒀쌰",
"쒔ㅕ":
   "쒀쎠",

"쒔ㅜ":
   "쒀쑤",
"쒔ㅠ":
   "쒀쓔",
"쒔ㅗ":
   "쒀쏘",
"쒔ㅛ":
   "쒀쑈",

"쒔ㅣ":
   "쒀씨",
"쒔ㅡ":
   "쒀쓰",
"쒔ㅐ":
   "쒀쌔",
"쒔ㅒ":
   "쒀썌",
"쒔ㅔ":
   "쒀쎄",
"쒔ㅖ":
   "쒀쎼",

"쒕ㅏ":
   "쒀아",
"쒕ㅓ":
   "쒀어",
"쒕ㅑ":
   "쒀야",
"쒕ㅕ":
   "쒀여",

"쒕ㅜ":
   "쒀우",
"쒕ㅠ":
   "쒀유",
"쒕ㅗ":
   "쒀오",
"쒕ㅛ":
   "쒀요",

"쒕ㅣ":
   "쒀이",
"쒕ㅡ":
   "쒀으",
"쒕ㅐ":
   "쒀애",
"쒕ㅒ":
   "쒀얘",
"쒕ㅔ":
   "쒀에",
"쒕ㅖ":
   "쒀예",

"쒖ㅏ":
   "쒀자",
"쒖ㅓ":
   "쒀저",
"쒖ㅑ":
   "쒀쟈",
"쒖ㅕ":
   "쒀져",

"쒖ㅜ":
   "쒀주",
"쒖ㅠ":
   "쒀쥬",
"쒖ㅗ":
   "쒀조",
"쒖ㅛ":
   "쒀죠",

"쒖ㅣ":
   "쒀지",
"쒖ㅡ":
   "쒀즈",
"쒖ㅐ":
   "쒀재",
"쒖ㅒ":
   "쒀쟤",
"쒖ㅔ":
   "쒀제",
"쒖ㅖ":
   "쒀졔",

"쒗ㅏ":
   "쒀차",
"쒗ㅓ":
   "쒀처",
"쒗ㅑ":
   "쒀챠",
"쒗ㅕ":
   "쒀쳐",

"쒗ㅜ":
   "쒀추",
"쒗ㅠ":
   "쒀츄",
"쒗ㅗ":
   "쒀초",
"쒗ㅛ":
   "쒀쵸",

"쒗ㅣ":
   "쒀치",
"쒗ㅡ":
   "쒀츠",
"쒗ㅐ":
   "쒀채",
"쒗ㅒ":
   "쒀챼",
"쒗ㅔ":
   "쒀체",
"쒗ㅖ":
   "쒀쳬",


"쒙ㅏ":
   "쒀타",
"쒙ㅓ":
   "쒀터",
"쒙ㅑ":
   "쒀탸",
"쒙ㅕ":
   "쒀텨",

"쒙ㅜ":
   "쒀투",
"쒙ㅠ":
   "쒀튜",
"쒙ㅗ":
   "쒀토",
"쒙ㅛ":
   "쒀툐",

"쒙ㅣ":
   "쒀티",
"쒙ㅡ":
   "쒀트",
"쒙ㅐ":
   "쒀태",
"쒙ㅒ":
   "쒀턔",
"쒙ㅔ":
   "쒀테",
"쒙ㅖ":
   "쒀톄",

"쒚ㅏ":
   "쒀파",
"쒚ㅓ":
   "쒀퍼",
"쒚ㅑ":
   "쒀퍄",
"쒚ㅕ":
   "쒀펴",

"쒚ㅜ":
   "쒀푸",
"쒚ㅠ":
   "쒀퓨",
"쒚ㅗ":
   "쒀포",
"쒚ㅛ":
   "쒀표",

"쒚ㅣ":
   "쒀피",
"쒚ㅡ":
   "쒀프",
"쒚ㅐ":
   "쒀패",
"쒚ㅒ":
   "쒀퍠",
"쒚ㅔ":
   "쒀페",
"쒚ㅖ":
   "쒀폐",

"쒛ㅏ":
   "쒀하",
"쒛ㅓ":
   "쒀허",
"쒛ㅑ":
   "쒀햐",
"쒛ㅕ":
   "쒀혀",

"쒛ㅜ":
   "쒀후",
"쒛ㅠ":
   "쒀휴",
"쒛ㅗ":
   "쒀호",
"쒛ㅛ":
   "쒀효",

"쒛ㅣ":
   "쒀히",
"쒛ㅡ":
   "쒀흐",
"쒛ㅐ":
   "쒀해",
"쒛ㅒ":
   "쒀햬",
"쒛ㅔ":
   "쒀헤",
"쒛ㅖ":
   "쒀혜",

"쬪ㅏ":
   "쬐파",
"쬪ㅓ":
   "쬐퍼",
"쬪ㅑ":
   "쬐퍄",
"쬪ㅕ":
   "쬐펴",

"쬪ㅜ":
   "쬐푸",
"쬪ㅠ":
   "쬐퓨",
"쬪ㅗ":
   "쬐포",
"쬪ㅛ":
   "쬐표",

"쬪ㅣ":
   "쬐피",
"쬪ㅡ":
   "쬐프",
"쬪ㅐ":
   "쬐패",
"쬪ㅒ":
   "쬐퍠",
"쬪ㅔ":
   "쬐페",
"쬪ㅖ":
   "쬐폐",

"쬫ㅏ":
   "쬐하",
"쬫ㅓ":
   "쬐허",
"쬫ㅑ":
   "쬐햐",
"쬫ㅕ":
   "쬐혀",

"쬫ㅜ":
   "쬐후",
"쬫ㅠ":
   "쬐휴",
"쬫ㅗ":
   "쬐호",
"쬫ㅛ":
   "쬐효",

"쬫ㅣ":
   "쬐히",
"쬫ㅡ":
   "쬐흐",
"쬫ㅐ":
   "쬐해",
"쬫ㅒ":
   "쬐햬",
"쬫ㅔ":
   "쬐헤",
"쬫ㅖ":
   "쬐혜",


"쭥ㅏ":
   "쭤가",
"쭥ㅓ":
   "쭤거",
"쭥ㅑ":
   "쭤갸",
"쭥ㅕ":
   "쭤겨",

"쭥ㅜ":
   "쭤구",
"쭥ㅠ":
   "쭤규",
"쭥ㅗ":
   "쭤고",
"쭥ㅛ":
   "쭤교",

"쭥ㅣ":
   "쭤기",
"쭥ㅡ":
   "쭤그",
"쭥ㅐ":
   "쭤개",
"쭥ㅒ":
   "쭤걔",
"쭥ㅔ":
   "쭤게",
"쭥ㅖ":
   "쭤계",

"쭦ㅏ":
   "쭤까",
"쭦ㅓ":
   "쭤꺼",
"쭦ㅑ":
   "쭤꺄",
"쭦ㅕ":
   "쭤껴",

"쭦ㅜ":
   "쭤꾸",
"쭦ㅠ":
   "쭤뀨",
"쭦ㅗ":
   "쭤꼬",
"쭦ㅛ":
   "쭤꾜",

"쭦ㅣ":
   "쭤끼",
"쭦ㅡ":
   "쭤끄",
"쭦ㅐ":
   "쭤깨",
"쭦ㅒ":
   "쭤꺠",
"쭦ㅔ":
   "쭤께",
"쭦ㅖ":
   "쭤꼐",

"쭨ㅏ":
   "쭤나",
"쭨ㅓ":
   "쭤너",
"쭨ㅑ":
   "쭤냐",
"쭨ㅕ":
   "쭤녀",

"쭨ㅜ":
   "쭤누",
"쭨ㅠ":
   "쭤뉴",
"쭨ㅗ":
   "쭤노",
"쭨ㅛ":
   "쭤뇨",

"쭨ㅣ":
   "쭤니",
"쭨ㅡ":
   "쭤느",
"쭨ㅐ":
   "쭤내",
"쭨ㅒ":
   "쭤냬",
"쭨ㅔ":
   "쭤네",
"쭨ㅖ":
   "쭤녜",

"쭫ㅏ":
   "쭤다",
"쭫ㅓ":
   "쭤더",
"쭫ㅑ":
   "쭤댜",
"쭫ㅕ":
   "쭤뎌",

"쭫ㅜ":
   "쭤두",
"쭫ㅠ":
   "쭤듀",
"쭫ㅗ":
   "쭤도",
"쭫ㅛ":
   "쭤됴",

"쭫ㅣ":
   "쭤디",
"쭫ㅡ":
   "쭤드",
"쭫ㅐ":
   "쭤대",
"쭫ㅒ":
   "쭤댸",
"쭫ㅔ":
   "쭤데",
"쭫ㅖ":
   "쭤뎨",

"쭬ㅏ":
   "쭤라",
"쭬ㅓ":
   "쭤러",
"쭬ㅑ":
   "쭤랴",
"쭬ㅕ":
   "쭤려",

"쭬ㅜ":
   "쭤루",
"쭬ㅠ":
   "쭤류",
"쭬ㅗ":
   "쭤로",
"쭬ㅛ":
   "쭤료",

"쭬ㅣ":
   "쭤리",
"쭬ㅡ":
   "쭤르",
"쭬ㅐ":
   "쭤래",
"쭬ㅒ":
   "쭤럐",
"쭬ㅔ":
   "쭤레",
"쭬ㅖ":
   "쭤례",

"쭴ㅏ":
   "쭤마",
"쭴ㅓ":
   "쭤머",
"쭴ㅑ":
   "쭤먀",
"쭴ㅕ":
   "쭤며",

"쭴ㅜ":
   "쭤무",
"쭴ㅠ":
   "쭤뮤",
"쭴ㅗ":
   "쭤모",
"쭴ㅛ":
   "쭤묘",

"쭴ㅣ":
   "쭤미",
"쭴ㅡ":
   "쭤므",
"쭴ㅐ":
   "쭤매",
"쭴ㅒ":
   "쭤먜",
"쭴ㅔ":
   "쭤메",
"쭴ㅖ":
   "쭤몌",

"쭵ㅏ":
   "쭤바",
"쭵ㅓ":
   "쭤버",
"쭵ㅑ":
   "쭤뱌",
"쭵ㅕ":
   "쭤벼",

"쭵ㅜ":
   "쭤부",
"쭵ㅠ":
   "쭤뷰",
"쭵ㅗ":
   "쭤보",
"쭵ㅛ":
   "쭤뵤",

"쭵ㅣ":
   "쭤비",
"쭵ㅡ":
   "쭤브",
"쭵ㅐ":
   "쭤배",
"쭵ㅒ":
   "쭤뱨",
"쭵ㅔ":
   "쭤베",
"쭵ㅖ":
   "쭤볘",


"쭵ㅏ":
   "쭤바",
"쭵ㅓ":
   "쭤버",
"쭵ㅑ":
   "쭤뱌",
"쭵ㅕ":
   "쭤벼",

"쭵ㅜ":
   "쭤부",
"쭵ㅠ":
   "쭤뷰",
"쭵ㅗ":
   "쭤보",
"쭵ㅛ":
   "쭤뵤",

"쭵ㅣ":
   "쭤비",
"쭵ㅡ":
   "쭤브",
"쭵ㅐ":
   "쭤배",
"쭵ㅒ":
   "쭤뱨",
"쭵ㅔ":
   "쭤베",
"쭵ㅖ":
   "쭤볘",
    




    
    }
