# -*- coding: utf-8 -*-
dic = {
    
"쀕ㅏ":
   "쀄바",
"쀕ㅓ":
   "쀄버",
"쀕ㅑ":
   "쀄뱌",
"쀕ㅕ":
   "쀄벼",

"쀕ㅜ":
   "쀄부",
"쀕ㅠ":
   "쀄뷰",
"쀕ㅗ":
   "쀄보",
"쀕ㅛ":
   "쀄뵤",

"쀕ㅣ":
   "쀄비",
"쀕ㅡ":
   "쀄브",
"쀕ㅐ":
   "쀄배",
"쀕ㅒ":
   "쀄뱨",
"쀕ㅔ":
   "쀄베",
"쀕ㅖ":
   "쀄볘",

"쀚ㅏ":
   "쀄자",
"쀚ㅓ":
   "쀄저",
"쀚ㅑ":
   "쀄쟈",
"쀚ㅕ":
   "쀄져",

"쀚ㅜ":
   "쀄주",
"쀚ㅠ":
   "쀄쥬",
"쀚ㅗ":
   "쀄조",
"쀚ㅛ":
   "쀄죠",

"쀚ㅣ":
   "쀄지",
"쀚ㅡ":
   "쀄즈",
"쀚ㅐ":
   "쀄재",
"쀚ㅒ":
   "쀄쟤",
"쀚ㅔ":
   "쀄제",
"쀚ㅖ":
   "쀄졔",

"쀋ㅏ":
   "쀄다",
"쀋ㅓ":
   "쀄더",
"쀋ㅑ":
   "쀄댜",
"쀋ㅕ":
   "쀄뎌",

"쀋ㅜ":
   "쀄두",
"쀋ㅠ":
   "쀄듀",
"쀋ㅗ":
   "쀄도",
"쀋ㅛ":
   "쀄됴",

"쀋ㅣ":
   "쀄디",
"쀋ㅡ":
   "쀄드",
"쀋ㅐ":
   "쀄대",
"쀋ㅒ":
   "쀄댸",
"쀋ㅔ":
   "쀄데",
"쀋ㅖ":
   "쀄뎨",

"쀅ㅏ":
   "쀄가",
"쀅ㅓ":
   "쀄거",
"쀅ㅑ":
   "쀄갸",
"쀅ㅕ":
   "쀄겨",

"쀅ㅜ":
   "쀄구",
"쀅ㅠ":
   "쀄규",
"쀅ㅗ":
   "쀄고",
"쀅ㅛ":
   "쀄교",

"쀅ㅣ":
   "쀄기",
"쀅ㅡ":
   "쀄그",
"쀅ㅐ":
   "쀄개",
"쀅ㅒ":
   "쀄걔",
"쀅ㅔ":
   "쀄게",
"쀅ㅖ":
   "쀄계",

"쀗ㅏ":
   "쀄사",
"쀗ㅓ":
   "쀄서",
"쀗ㅑ":
   "쀄샤",
"쀗ㅕ":
   "쀄셔",

"쀗ㅜ":
   "쀄수",
"쀗ㅠ":
   "쀄슈",
"쀗ㅗ":
   "쀄소",
"쀗ㅛ":
   "쀄쇼",

"쀗ㅣ":
   "쀄시",
"쀗ㅡ":
   "쀄스",
"쀗ㅐ":
   "쀄새",
"쀗ㅒ":
   "쀄섀",
"쀗ㅔ":
   "쀄세",
"쀗ㅖ":
   "쀄셰",


"쀔ㅏ":
   "쀄마",
"쀔ㅓ":
   "쀄머",
"쀔ㅑ":
   "쀄먀",
"쀔ㅕ":
   "쀄며",

"쀔ㅜ":
   "쀄무",
"쀔ㅠ":
   "쀄뮤",
"쀔ㅗ":
   "쀄모",
"쀔ㅛ":
   "쀄묘",

"쀔ㅣ":
   "쀄미",
"쀔ㅡ":
   "쀄므",
"쀔ㅐ":
   "쀄매",
"쀔ㅒ":
   "쀄먜",
"쀔ㅔ":
   "쀄메",
"쀔ㅖ":
   "쀄몌",
"쀈ㅏ":
   "쀄나",
"쀈ㅓ":
   "쀄너",
"쀈ㅑ":
   "쀄냐",
"쀈ㅕ":
   "쀄녀",

"쀈ㅜ":
   "쀄누",
"쀈ㅠ":
   "쀄뉴",
"쀈ㅗ":
   "쀄노",
"쀈ㅛ":
   "쀄뇨",

"쀈ㅣ":
   "쀄니",
"쀈ㅡ":
   "쀄느",
"쀈ㅐ":
   "쀄내",
"쀈ㅒ":
   "쀄냬",
"쀈ㅔ":
   "쀄네",
"쀈ㅖ":
   "쀄녜",

"쀙ㅏ":
   "쀄아",
"쀙ㅓ":
   "쀄어",
"쀙ㅑ":
   "쀄야",
"쀙ㅕ":
   "쀄여",

"쀙ㅜ":
   "쀄우",
"쀙ㅠ":
   "쀄유",
"쀙ㅗ":
   "쀄오",
"쀙ㅛ":
   "쀄요",

"쀙ㅣ":
   "쀄이",
"쀙ㅡ":
   "쀄으",
"쀙ㅐ":
   "쀄애",
"쀙ㅒ":
   "쀄얘",
"쀙ㅔ":
   "쀄에",
"쀙ㅖ":
   "쀄예",

"쀌ㅏ":
   "쀄라",
"쀌ㅓ":
   "쀄러",
"쀌ㅑ":
   "쀄랴",
"쀌ㅕ":
   "쀄려",

"쀌ㅜ":
   "쀄루",
"쀌ㅠ":
   "쀄류",
"쀌ㅗ":
   "쀄로",
"쀌ㅛ":
   "쀄료",

"쀌ㅣ":
   "쀄리",
"쀌ㅡ":
   "쀄르",
"쀌ㅐ":
   "쀄래",
"쀌ㅒ":
   "쀄럐",
"쀌ㅔ":
   "쀄레",
"쀌ㅖ":
   "쀄례",



"쀟ㅏ":
   "쀄하",
"쀟ㅓ":
   "쀄허",
"쀟ㅑ":
   "쀄햐",
"쀟ㅕ":
   "쀄혀",

"쀟ㅜ":
   "쀄후",
"쀟ㅠ":
   "쀄휴",
"쀟ㅗ":
   "쀄호",
"쀟ㅛ":
   "쀄효",

"쀟ㅣ":
   "쀄히",
"쀟ㅡ":
   "쀄흐",
"쀟ㅐ":
   "쀄해",
"쀟ㅒ":
   "쀄햬",
"쀟ㅔ":
   "쀄헤",
"쀟ㅖ":
   "쀄혜",

"쀜ㅏ":
   "쀄카",
"쀜ㅓ":
   "쀄커",
"쀜ㅑ":
   "쀄캬",
"쀜ㅕ":
   "쀄켜",

"쀜ㅜ":
   "쀄쿠",
"쀜ㅠ":
   "쀄큐",
"쀜ㅗ":
   "쀄코",
"쀜ㅛ":
   "쀄쿄",

"쀜ㅣ":
   "쀄키",
"쀜ㅡ":
   "쀄크",
"쀜ㅐ":
   "쀄캐",
"쀜ㅒ":
   "쀄컈",
"쀜ㅔ":
   "쀄케",
"쀜ㅖ":
   "쀄켸",

"쀝ㅏ":
   "쀄타",
"쀝ㅓ":
   "쀄터",
"쀝ㅑ":
   "쀄탸",
"쀝ㅕ":
   "쀄텨",

"쀝ㅜ":
   "쀄투",
"쀝ㅠ":
   "쀄튜",
"쀝ㅗ":
   "쀄토",
"쀝ㅛ":
   "쀄툐",

"쀝ㅣ":
   "쀄티",
"쀝ㅡ":
   "쀄트",
"쀝ㅐ":
   "쀄태",
"쀝ㅒ":
   "쀄턔",
"쀝ㅔ":
   "쀄테",
"쀝ㅖ":
   "쀄톄",

"쀛ㅏ":
   "쀄차",
"쀛ㅓ":
   "쀄처",
"쀛ㅑ":
   "쀄챠",
"쀛ㅕ":
   "쀄쳐",

"쀛ㅜ":
   "쀄추",
"쀛ㅠ":
   "쀄츄",
"쀛ㅗ":
   "쀄초",
"쀛ㅛ":
   "쀄쵸",

"쀛ㅣ":
   "쀄치",
"쀛ㅡ":
   "쀄츠",
"쀛ㅐ":
   "쀄채",
"쀛ㅒ":
   "쀄챼",
"쀛ㅔ":
   "쀄체",
"쀛ㅖ":
   "쀄쳬",

"쀞ㅏ":
   "쀄파",
"쀞ㅓ":
   "쀄퍼",
"쀞ㅑ":
   "쀄퍄",
"쀞ㅕ":
   "쀄펴",

"쀞ㅜ":
   "쀄푸",
"쀞ㅠ":
   "쀄퓨",
"쀞ㅗ":
   "쀄포",
"쀞ㅛ":
   "쀄표",

"쀞ㅣ":
   "쀄피",
"쀞ㅡ":
   "쀄프",
"쀞ㅐ":
   "쀄패",
"쀞ㅒ":
   "쀄퍠",
"쀞ㅔ":
   "쀄페",
"쀞ㅖ":
   "쀄폐",

"쀆ㅏ":
   "쀄까",
"쀆ㅓ":
   "쀄꺼",
"쀆ㅑ":
   "쀄꺄",
"쀆ㅕ":
   "쀄껴",

"쀆ㅜ":
   "쀄꾸",
"쀆ㅠ":
   "쀄뀨",
"쀆ㅗ":
   "쀄꼬",
"쀆ㅛ":
   "쀄꾜",

"쀆ㅣ":
   "쀄끼",
"쀆ㅡ":
   "쀄끄",
"쀆ㅐ":
   "쀄깨",
"쀆ㅒ":
   "쀄꺠",
"쀆ㅔ":
   "쀄께",
"쀆ㅖ":
   "쀄꼐",


"쀘ㅏ":
   "쀄싸",
"쀘ㅓ":
   "쀄써",
"쀘ㅑ":
   "쀄쌰",
"쀘ㅕ":
   "쀄쎠",

"쀘ㅜ":
   "쀄쑤",
"쀘ㅠ":
   "쀄쓔",
"쀘ㅗ":
   "쀄쏘",
"쀘ㅛ":
   "쀄쑈",

"쀘ㅣ":
   "쀄씨",
"쀘ㅡ":
   "쀄쓰",
"쀘ㅐ":
   "쀄쌔",
"쀘ㅒ":
   "쀄썌",
"쀘ㅔ":
   "쀄쎄",
"쀘ㅖ":
   "쀄쎼",

"쀇ㅏ":
   "쀅사",
"쀇ㅓ":
   "쀅서",
"쀇ㅑ":
   "쀅샤",
"쀇ㅕ":
   "쀅셔",

"쀇ㅜ":
   "쀅수",
"쀇ㅠ":
   "쀅슈",
"쀇ㅗ":
   "쀅소",
"쀇ㅛ":
   "쀅쇼",

"쀇ㅣ":
   "쀅시",
"쀇ㅡ":
   "쀅스",
"쀇ㅐ":
   "쀅새",
"쀇ㅒ":
   "쀅섀",
"쀇ㅔ":
   "쀅세",
"쀇ㅖ":
   "쀅셰",

"쮑ㅏ":
   "쮀바",
"쮑ㅓ":
   "쮀버",
"쮑ㅑ":
   "쮀뱌",
"쮑ㅕ":
   "쮀벼",

"쮑ㅜ":
   "쮀부",
"쮑ㅠ":
   "쮀뷰",
"쮑ㅗ":
   "쮀보",
"쮑ㅛ":
   "쮀뵤",

"쮑ㅣ":
   "쮀비",
"쮑ㅡ":
   "쮀브",
"쮑ㅐ":
   "쮀배",
"쮑ㅒ":
   "쮀뱨",
"쮑ㅔ":
   "쮀베",
"쮑ㅖ":
   "쮀볘",

"쮖ㅏ":
   "쮀자",
"쮖ㅓ":
   "쮀저",
"쮖ㅑ":
   "쮀쟈",
"쮖ㅕ":
   "쮀져",

"쮖ㅜ":
   "쮀주",
"쮖ㅠ":
   "쮀쥬",
"쮖ㅗ":
   "쮀조",
"쮖ㅛ":
   "쮀죠",

"쮖ㅣ":
   "쮀지",
"쮖ㅡ":
   "쮀즈",
"쮖ㅐ":
   "쮀재",
"쮖ㅒ":
   "쮀쟤",
"쮖ㅔ":
   "쮀제",
"쮖ㅖ":
   "쮀졔",

"쮇ㅏ":
   "쮀다",
"쮇ㅓ":
   "쮀더",
"쮇ㅑ":
   "쮀댜",
"쮇ㅕ":
   "쮀뎌",

"쮇ㅜ":
   "쮀두",
"쮇ㅠ":
   "쮀듀",
"쮇ㅗ":
   "쮀도",
"쮇ㅛ":
   "쮀됴",

"쮇ㅣ":
   "쮀디",
"쮇ㅡ":
   "쮀드",
"쮇ㅐ":
   "쮀대",
"쮇ㅒ":
   "쮀댸",
"쮇ㅔ":
   "쮀데",
"쮇ㅖ":
   "쮀뎨",


"쮁ㅏ":
   "쮀가",
"쮁ㅓ":
   "쮀거",
"쮁ㅑ":
   "쮀갸",
"쮁ㅕ":
   "쮀겨",

"쮁ㅜ":
   "쮀구",
"쮁ㅠ":
   "쮀규",
"쮁ㅗ":
   "쮀고",
"쮁ㅛ":
   "쮀교",

"쮁ㅣ":
   "쮀기",
"쮁ㅡ":
   "쮀그",
"쮁ㅐ":
   "쮀개",
"쮁ㅒ":
   "쮀걔",
"쮁ㅔ":
   "쮀게",
"쮁ㅖ":
   "쮀계",

"쮓ㅏ":
   "쮀사",
"쮓ㅓ":
   "쮀서",
"쮓ㅑ":
   "쮀샤",
"쮓ㅕ":
   "쮀셔",

"쮓ㅜ":
   "쮀수",
"쮓ㅠ":
   "쮀슈",
"쮓ㅗ":
   "쮀소",
"쮓ㅛ":
   "쮀쇼",

"쮓ㅣ":
   "쮀시",
"쮓ㅡ":
   "쮀스",
"쮓ㅐ":
   "쮀새",
"쮓ㅒ":
   "쮀섀",
"쮓ㅔ":
   "쮀세",
"쮓ㅖ":
   "쮀셰",




"쮐ㅏ":
   "쮀마",
"쮐ㅓ":
   "쮀머",
"쮐ㅑ":
   "쮀먀",
"쮐ㅕ":
   "쮀며",

"쮐ㅜ":
   "쮀무",
"쮐ㅠ":
   "쮀뮤",
"쮐ㅗ":
   "쮀모",
"쮐ㅛ":
   "쮀묘",

"쮐ㅣ":
   "쮀미",
"쮐ㅡ":
   "쮀므",
"쮐ㅐ":
   "쮀매",
"쮐ㅒ":
   "쮀먜",
"쮐ㅔ":
   "쮀메",
"쮐ㅖ":
   "쮀몌",

"쮄ㅏ":
   "쮀나",
"쮄ㅓ":
   "쮀너",
"쮄ㅑ":
   "쮀냐",
"쮄ㅕ":
   "쮀녀",

"쮄ㅜ":
   "쮀누",
"쮄ㅠ":
   "쮀뉴",
"쮄ㅗ":
   "쮀노",
"쮄ㅛ":
   "쮀뇨",

"쮄ㅣ":
   "쮀니",
"쮄ㅡ":
   "쮀느",
"쮄ㅐ":
   "쮀내",
"쮄ㅒ":
   "쮀냬",
"쮄ㅔ":
   "쮀네",
"쮄ㅖ":
   "쮀녜",

"쮕ㅏ":
   "쮀아",
"쮕ㅓ":
   "쮀어",
"쮕ㅑ":
   "쮀야",
"쮕ㅕ":
   "쮀여",

"쮕ㅜ":
   "쮀우",
"쮕ㅠ":
   "쮀유",
"쮕ㅗ":
   "쮀오",
"쮕ㅛ":
   "쮀요",

"쮕ㅣ":
   "쮀이",
"쮕ㅡ":
   "쮀으",
"쮕ㅐ":
   "쮀애",
"쮕ㅒ":
   "쮀얘",
"쮕ㅔ":
   "쮀에",
"쮕ㅖ":
   "쮀예",

"쮈ㅏ":
   "쮀라",
"쮈ㅓ":
   "쮀러",
"쮈ㅑ":
   "쮀랴",
"쮈ㅕ":
   "쮀려",

"쮈ㅜ":
   "쮀루",
"쮈ㅠ":
   "쮀류",
"쮈ㅗ":
   "쮀로",
"쮈ㅛ":
   "쮀료",

"쮈ㅣ":
   "쮀리",
"쮈ㅡ":
   "쮀르",
"쮈ㅐ":
   "쮀래",
"쮈ㅒ":
   "쮀럐",
"쮈ㅔ":
   "쮀레",
"쮈ㅖ":
   "쮀례",


"쮛ㅏ":
   "쮀하",
"쮛ㅓ":
   "쮀허",
"쮛ㅑ":
   "쮀햐",
"쮛ㅕ":
   "쮀혀",

"쮛ㅜ":
   "쮀후",
"쮛ㅠ":
   "쮀휴",
"쮛ㅗ":
   "쮀호",
"쮛ㅛ":
   "쮀효",

"쮛ㅣ":
   "쮀히",
"쮛ㅡ":
   "쮀흐",
"쮛ㅐ":
   "쮀해",
"쮛ㅒ":
   "쮀햬",
"쮛ㅔ":
   "쮀헤",
"쮛ㅖ":
   "쮀혜",


"쮘ㅏ":
   "쮀카",
"쮘ㅓ":
   "쮀커",
"쮘ㅑ":
   "쮀캬",
"쮘ㅕ":
   "쮀켜",

"쮘ㅜ":
   "쮀쿠",
"쮘ㅠ":
   "쮀큐",
"쮘ㅗ":
   "쮀코",
"쮘ㅛ":
   "쮀쿄",

"쮘ㅣ":
   "쮀키",
"쮘ㅡ":
   "쮀크",
"쮘ㅐ":
   "쮀캐",
"쮘ㅒ":
   "쮀컈",
"쮘ㅔ":
   "쮀케",
"쮘ㅖ":
   "쮀켸",

"쮙ㅏ":
   "쮀타",
"쮙ㅓ":
   "쮀터",
"쮙ㅑ":
   "쮀탸",
"쮙ㅕ":
   "쮀텨",

"쮙ㅜ":
   "쮀투",
"쮙ㅠ":
   "쮀튜",
"쮙ㅗ":
   "쮀토",
"쮙ㅛ":
   "쮀툐",

"쮙ㅣ":
   "쮀티",
"쮙ㅡ":
   "쮀트",
"쮙ㅐ":
   "쮀태",
"쮙ㅒ":
   "쮀턔",
"쮙ㅔ":
   "쮀테",
"쮙ㅖ":
   "쮀톄",

"쮗ㅏ":
   "쮀차",
"쮗ㅓ":
   "쮀처",
"쮗ㅑ":
   "쮀챠",
"쮗ㅕ":
   "쮀쳐",

"쮗ㅜ":
   "쮀추",
"쮗ㅠ":
   "쮀츄",
"쮗ㅗ":
   "쮀초",
"쮗ㅛ":
   "쮀쵸",

"쮗ㅣ":
   "쮀치",
"쮗ㅡ":
   "쮀츠",
"쮗ㅐ":
   "쮀채",
"쮗ㅒ":
   "쮀챼",
"쮗ㅔ":
   "쮀체",
"쮗ㅖ":
   "쮀쳬",

"쮚ㅏ":
   "쮀파",
"쮚ㅓ":
   "쮀퍼",
"쮚ㅑ":
   "쮀퍄",
"쮚ㅕ":
   "쮀펴",

"쮚ㅜ":
   "쮀푸",
"쮚ㅠ":
   "쮀퓨",
"쮚ㅗ":
   "쮀포",
"쮚ㅛ":
   "쮀표",

"쮚ㅣ":
   "쮀피",
"쮚ㅡ":
   "쮀프",
"쮚ㅐ":
   "쮀패",
"쮚ㅒ":
   "쮀퍠",
"쮚ㅔ":
   "쮀페",
"쮚ㅖ":
   "쮀폐",

"쮂ㅏ":
   "쮀까",
"쮂ㅓ":
   "쮀꺼",
"쮂ㅑ":
   "쮀꺄",
"쮂ㅕ":
   "쮀껴",

"쮂ㅜ":
   "쮀꾸",
"쮂ㅠ":
   "쮀뀨",
"쮂ㅗ":
   "쮀꼬",
"쮂ㅛ":
   "쮀꾜",

"쮂ㅣ":
   "쮀끼",
"쮂ㅡ":
   "쮀끄",
"쮂ㅐ":
   "쮀깨",
"쮂ㅒ":
   "쮀꺠",
"쮂ㅔ":
   "쮀께",
"쮂ㅖ":
   "쮀꼐",

"쮔ㅏ":
   "쮀싸",
"쮔ㅓ":
   "쮀써",
"쮔ㅑ":
   "쮀쌰",
"쮔ㅕ":
   "쮀쎠",

"쮔ㅜ":
   "쮀쑤",
"쮔ㅠ":
   "쮀쓔",
"쮔ㅗ":
   "쮀쏘",
"쮔ㅛ":
   "쮀쑈",

"쮔ㅣ":
   "쮀씨",
"쮔ㅡ":
   "쮀쓰",
"쮔ㅐ":
   "쮀쌔",
"쮔ㅒ":
   "쮀썌",
"쮔ㅔ":
   "쮀쎄",
"쮔ㅖ":
   "쮀쎼",

#
"뛥ㅏ":
   "뛔바",
"뛥ㅓ":
   "뛔버",
"뛥ㅑ":
   "뛔뱌",
"뛥ㅕ":
   "뛔벼",

"뛥ㅜ":
   "뛔부",
"뛥ㅠ":
   "뛔뷰",
"뛥ㅗ":
   "뛔보",
"뛥ㅛ":
   "뛔뵤",

"뛥ㅣ":
   "뛔비",
"뛥ㅡ":
   "뛔브",
"뛥ㅐ":
   "뛔배",
"뛥ㅒ":
   "뛔뱨",
"뛥ㅔ":
   "뛔베",
"뛥ㅖ":
   "뛔볘",

"뛪ㅏ":
   "뛔자",
"뛪ㅓ":
   "뛔저",
"뛪ㅑ":
   "뛔쟈",
"뛪ㅕ":
   "뛔져",

"뛪ㅜ":
   "뛔주",
"뛪ㅠ":
   "뛔쥬",
"뛪ㅗ":
   "뛔조",
"뛪ㅛ":
   "뛔죠",

"뛪ㅣ":
   "뛔지",
"뛪ㅡ":
   "뛔즈",
"뛪ㅐ":
   "뛔재",
"뛪ㅒ":
   "뛔쟤",
"뛪ㅔ":
   "뛔제",
"뛪ㅖ":
   "뛔졔",

"뛛ㅜ":
   "뛔두",
"뛛ㅠ":
   "뛔듀",
"뛛ㅗ":
   "뛔도",
"뛛ㅛ":
   "뛔됴",

"뛛ㅣ":
   "뛔디",
"뛛ㅡ":
   "뛔드",
"뛛ㅐ":
   "뛔대",
"뛛ㅒ":
   "뛔댸",
"뛛ㅔ":
   "뛔데",
"뛛ㅖ":
   "뛔뎨",


"뛧ㅏ":
   "뛔사",
"뛧ㅓ":
   "뛔서",
"뛧ㅑ":
   "뛔샤",
"뛧ㅕ":
   "뛔셔",

"뛧ㅜ":
   "뛔수",
"뛧ㅠ":
   "뛔슈",
"뛧ㅗ":
   "뛔소",
"뛧ㅛ":
   "뛔쇼",

"뛧ㅣ":
   "뛔시",
"뛧ㅡ":
   "뛔스",
"뛧ㅐ":
   "뛔새",
"뛧ㅒ":
   "뛔섀",
"뛧ㅔ":
   "뛔세",
"뛧ㅖ":
   "뛔셰",

"뛤ㅏ":
   "뛔마",
"뛤ㅓ":
   "뛔머",
"뛤ㅑ":
   "뛔먀",
"뛤ㅕ":
   "뛔며",

"뛤ㅜ":
   "뛔무",
"뛤ㅠ":
   "뛔뮤",
"뛤ㅗ":
   "뛔모",
"뛤ㅛ":
   "뛔묘",

"뛤ㅣ":
   "뛔미",
"뛤ㅡ":
   "뛔므",
"뛤ㅐ":
   "뛔매",
"뛤ㅒ":
   "뛔먜",
"뛤ㅔ":
   "뛔메",
"뛤ㅖ":
   "뛔몌",

"뛘ㅏ":
   "뛔나",
"뛘ㅓ":
   "뛔너",
"뛘ㅑ":
   "뛔냐",
"뛘ㅕ":
   "뛔녀",

"뛘ㅜ":
   "뛔누",
"뛘ㅠ":
   "뛔뉴",
"뛘ㅗ":
   "뛔노",
"뛘ㅛ":
   "뛔뇨",

"뛘ㅣ":
   "뛔니",
"뛘ㅡ":
   "뛔느",
"뛘ㅐ":
   "뛔내",
"뛘ㅒ":
   "뛔냬",
"뛘ㅔ":
   "뛔네",
"뛘ㅖ":
   "뛔녜",



"뛛ㅏ":
   "뛔다",
"뛛ㅓ":
   "뛔더",
"뛛ㅑ":
   "뛔댜",
"뛛ㅕ":
   "뛔뎌",

"뛩ㅏ":
   "뛔아",
"뛩ㅓ":
   "뛔어",
"뛩ㅑ":
   "뛔야",
"뛩ㅕ":
   "뛔여",

"뛩ㅜ":
   "뛔우",
"뛩ㅠ":
   "뛔유",
"뛩ㅗ":
   "뛔오",
"뛩ㅛ":
   "뛔요",

"뛩ㅣ":
   "뛔이",
"뛩ㅡ":
   "뛔으",
"뛩ㅐ":
   "뛔애",
"뛩ㅒ":
   "뛔얘",
"뛩ㅔ":
   "뛔에",
"뛩ㅖ":
   "뛔예",

"뛜ㅏ":
   "뛔라",
"뛜ㅓ":
   "뛔러",
"뛜ㅑ":
   "뛔랴",
"뛜ㅕ":
   "뛔려",

"뛜ㅜ":
   "뛔루",
"뛜ㅠ":
   "뛔류",
"뛜ㅗ":
   "뛔로",
"뛜ㅛ":
   "뛔료",

"뛜ㅣ":
   "뛔리",
"뛜ㅡ":
   "뛔르",
"뛜ㅐ":
   "뛔래",
"뛜ㅒ":
   "뛔럐",
"뛜ㅔ":
   "뛔레",
"뛜ㅖ":
   "뛔례",

"뛯ㅏ":
   "뛔하",
"뛯ㅓ":
   "뛔허",
"뛯ㅑ":
   "뛔햐",
"뛯ㅕ":
   "뛔혀",

"뛯ㅜ":
   "뛔후",
"뛯ㅠ":
   "뛔휴",
"뛯ㅗ":
   "뛔호",
"뛯ㅛ":
   "뛔효",

"뛯ㅣ":
   "뛔히",
"뛯ㅡ":
   "뛔흐",
"뛯ㅐ":
   "뛔해",
"뛯ㅒ":
   "뛔햬",
"뛯ㅔ":
   "뛔헤",
"뛯ㅖ":
   "뛔혜",


"뛬ㅏ":
   "뛔카",
"뛬ㅓ":
   "뛔커",
"뛬ㅑ":
   "뛔캬",
"뛬ㅕ":
   "뛔켜",

"뛬ㅜ":
   "뛔쿠",
"뛬ㅠ":
   "뛔큐",
"뛬ㅗ":
   "뛔코",
"뛬ㅛ":
   "뛔쿄",

"뛬ㅣ":
   "뛔키",
"뛬ㅡ":
   "뛔크",
"뛬ㅐ":
   "뛔캐",
"뛬ㅒ":
   "뛔컈",
"뛬ㅔ":
   "뛔케",
"뛬ㅖ":
   "뛔켸",

"뛭ㅏ":
   "뛔타",
"뛭ㅓ":
   "뛔터",
"뛭ㅑ":
   "뛔탸",
"뛭ㅕ":
   "뛔텨",

"뛭ㅜ":
   "뛔투",
"뛭ㅠ":
   "뛔튜",
"뛭ㅗ":
   "뛔토",
"뛭ㅛ":
   "뛔툐",

"뛭ㅣ":
   "뛔티",
"뛭ㅡ":
   "뛔트",
"뛭ㅐ":
   "뛔태",
"뛭ㅒ":
   "뛔턔",
"뛭ㅔ":
   "뛔테",
"뛭ㅖ":
   "뛔톄",


"뛫ㅏ":
   "뛔차",
"뛫ㅓ":
   "뛔처",
"뛫ㅑ":
   "뛔챠",
"뛫ㅕ":
   "뛔쳐",

"뛫ㅜ":
   "뛔추",
"뛫ㅠ":
   "뛔츄",
"뛫ㅗ":
   "뛔초",
"뛫ㅛ":
   "뛔쵸",

"뛫ㅣ":
   "뛔치",
"뛫ㅡ":
   "뛔츠",
"뛫ㅐ":
   "뛔채",
"뛫ㅒ":
   "뛔챼",
"뛫ㅔ":
   "뛔체",
"뛫ㅖ":
   "뛔쳬",




"뛮ㅏ":
   "뛔파",
"뛮ㅓ":
   "뛔퍼",
"뛮ㅑ":
   "뛔퍄",
"뛮ㅕ":
   "뛔펴",

"뛮ㅜ":
   "뛔푸",
"뛮ㅠ":
   "뛔퓨",
"뛮ㅗ":
   "뛔포",
"뛮ㅛ":
   "뛔표",

"뛮ㅣ":
   "뛔피",
"뛮ㅡ":
   "뛔프",
"뛮ㅐ":
   "뛔패",
"뛮ㅒ":
   "뛔퍠",
"뛮ㅔ":
   "뛔페",
"뛮ㅖ":
   "뛔폐",

"뛖ㅏ":
   "뛔까",
"뛖ㅓ":
   "뛔꺼",
"뛖ㅑ":
   "뛔꺄",
"뛖ㅕ":
   "뛔껴",

"뛖ㅜ":
   "뛔꾸",
"뛖ㅠ":
   "뛔뀨",
"뛖ㅗ":
   "뛔꼬",
"뛖ㅛ":
   "뛔꾜",

"뛖ㅣ":
   "뛔끼",
"뛖ㅡ":
   "뛔끄",
"뛖ㅐ":
   "뛔깨",
"뛖ㅒ":
   "뛔꺠",
"뛖ㅔ":
   "뛔께",
"뛖ㅖ":
   "뛔꼐",



"뛨ㅏ":
   "뛔싸",
"뛨ㅓ":
   "뛔써",
"뛨ㅑ":
   "뛔쌰",
"뛨ㅕ":
   "뛔쎠",

"뛨ㅜ":
   "뛔쑤",
"뛨ㅠ":
   "뛔쓔",
"뛨ㅗ":
   "뛔쏘",
"뛨ㅛ":
   "뛔쑈",

"뛨ㅣ":
   "뛔씨",
"뛨ㅡ":
   "뛔쓰",
"뛨ㅐ":
   "뛔쌔",
"뛨ㅒ":
   "뛔썌",
"뛨ㅔ":
   "뛔쎄",
"뛨ㅖ":
   "뛔쎼",


"뛗ㅏ":
   "뛕사",
"뛗ㅓ":
   "뛕서",
"뛗ㅑ":
   "뛕샤",
"뛗ㅕ":
   "뛕셔",

"뛗ㅜ":
   "뛕수",
"뛗ㅠ":
   "뛕슈",
"뛗ㅗ":
   "뛕소",
"뛗ㅛ":
   "뛕쇼",

"뛗ㅣ":
   "뛕시",
"뛗ㅡ":
   "뛕스",
"뛗ㅐ":
   "뛕새",
"뛗ㅒ":
   "뛕섀",
"뛗ㅔ":
   "뛕세",
"뛗ㅖ":
   "뛕셰",

"뛙ㅏ":
   "뛘자",
"뛙ㅓ":
   "뛘저",
"뛙ㅑ":
   "뛘쟈",
"뛙ㅕ":
   "뛘져",

"뛙ㅜ":
   "뛘주",
"뛙ㅠ":
   "뛘쥬",
"뛙ㅗ":
   "뛘조",
"뛙ㅛ":
   "뛘죠",

"뛙ㅣ":
   "뛘지",
"뛙ㅡ":
   "뛘즈",
"뛙ㅐ":
   "뛘재",
"뛙ㅒ":
   "뛘쟤",
"뛙ㅔ":
   "뛘제",
"뛙ㅖ":
   "뛘졔",

"뛚ㅏ":
   "뛘하",
"뛚ㅓ":
   "뛘허",
"뛚ㅑ":
   "뛘햐",
"뛚ㅕ":
   "뛘혀",

"뛚ㅜ":
   "뛘후",
"뛚ㅠ":
   "뛘휴",
"뛚ㅗ":
   "뛘호",
"뛚ㅛ":
   "뛘효",

"뛚ㅣ":
   "뛘히",
"뛚ㅡ":
   "뛘흐",
"뛚ㅐ":
   "뛘해",
"뛚ㅒ":
   "뛘햬",
"뛚ㅔ":
   "뛘헤",
"뛚ㅖ":
   "뛘혜",

"뛝ㅏ":
   "뛜가",
"뛝ㅓ":
   "뛜거",
"뛝ㅑ":
   "뛜갸",
"뛝ㅕ":
   "뛜겨",

"뛝ㅜ":
   "뛜구",
"뛝ㅠ":
   "뛜규",
"뛝ㅗ":
   "뛜고",
"뛝ㅛ":
   "뛜교",

"뛝ㅣ":
   "뛜기",
"뛝ㅡ":
   "뛜그",
"뛝ㅐ":
   "뛜개",
"뛝ㅒ":
   "뛜걔",
"뛝ㅔ":
   "뛜게",
"뛝ㅖ":
   "뛜계",


"뛞ㅏ":
   "뛜마",
"뛞ㅓ":
   "뛜머",
"뛞ㅑ":
   "뛜먀",
"뛞ㅕ":
   "뛜며",

"뛞ㅜ":
   "뛜무",
"뛞ㅠ":
   "뛜뮤",
"뛞ㅗ":
   "뛜모",
"뛞ㅛ":
   "뛜묘",

"뛞ㅣ":
   "뛜미",
"뛞ㅡ":
   "뛜므",
"뛞ㅐ":
   "뛜매",
"뛞ㅒ":
   "뛜먜",
"뛞ㅔ":
   "뛜메",
"뛞ㅖ":
   "뛜몌",

"뛟ㅏ":
   "뛜바",
"뛟ㅓ":
   "뛜버",
"뛟ㅑ":
   "뛜뱌",
"뛟ㅕ":
   "뛜벼",

"뛟ㅜ":
   "뛜부",
"뛟ㅠ":
   "뛜뷰",
"뛟ㅗ":
   "뛜보",
"뛟ㅛ":
   "뛜뵤",

"뛟ㅣ":
   "뛜비",
"뛟ㅡ":
   "뛜브",
"뛟ㅐ":
   "뛜배",
"뛟ㅒ":
   "뛜뱨",
"뛟ㅔ":
   "뛜베",
"뛟ㅖ":
   "뛜볘",

"뛠ㅏ":
   "뛜사",
"뛠ㅓ":
   "뛜서",
"뛠ㅑ":
   "뛜샤",
"뛠ㅕ":
   "뛜셔",

"뛠ㅜ":
   "뛜수",
"뛠ㅠ":
   "뛜슈",
"뛠ㅗ":
   "뛜소",
"뛠ㅛ":
   "뛜쇼",

"뛠ㅣ":
   "뛜시",
"뛠ㅡ":
   "뛜스",
"뛠ㅐ":
   "뛜새",
"뛠ㅒ":
   "뛜섀",
"뛠ㅔ":
   "뛜세",
"뛠ㅖ":
   "뛜셰",

"뛡ㅏ":
   "뛜타",
"뛡ㅓ":
   "뛜터",
"뛡ㅑ":
   "뛜탸",
"뛡ㅕ":
   "뛜텨",

"뛡ㅜ":
   "뛜투",
"뛡ㅠ":
   "뛜튜",
"뛡ㅗ":
   "뛜토",
"뛡ㅛ":
   "뛜툐",

"뛡ㅣ":
   "뛜티",
"뛡ㅡ":
   "뛜트",
"뛡ㅐ":
   "뛜태",
"뛡ㅒ":
   "뛜턔",
"뛡ㅔ":
   "뛜테",
"뛡ㅖ":
   "뛜톄",

"뛢ㅏ":
   "뛜파",
"뛢ㅓ":
   "뛜퍼",
"뛢ㅑ":
   "뛜퍄",
"뛢ㅕ":
   "뛜펴",

"뛢ㅜ":
   "뛜푸",
"뛢ㅠ":
   "뛜퓨",
"뛢ㅗ":
   "뛜포",
"뛢ㅛ":
   "뛜표",

"뛢ㅣ":
   "뛜피",
"뛢ㅡ":
   "뛜프",
"뛢ㅐ":
   "뛜패",
"뛢ㅒ":
   "뛜퍠",
"뛢ㅔ":
   "뛜페",
"뛢ㅖ":
   "뛜폐",

"뛣ㅏ":
   "뛜하",
"뛣ㅓ":
   "뛜허",
"뛣ㅑ":
   "뛜햐",
"뛣ㅕ":
   "뛜혀",

"뛣ㅜ":
   "뛜후",
"뛣ㅠ":
   "뛜휴",
"뛣ㅗ":
   "뛜호",
"뛣ㅛ":
   "뛜효",

"뛣ㅣ":
   "뛜히",
"뛣ㅡ":
   "뛜흐",
"뛣ㅐ":
   "뛜해",
"뛣ㅒ":
   "뛜햬",
"뛣ㅔ":
   "뛜헤",
"뛣ㅖ":
   "뛜혜",


"뛦ㅏ":
   "뛥사",
"뛦ㅓ":
   "뛥서",
"뛦ㅑ":
   "뛥샤",
"뛦ㅕ":
   "뛥셔",

"뛦ㅜ":
   "뛥수",
"뛦ㅠ":
   "뛥슈",
"뛦ㅗ":
   "뛥소",
"뛦ㅛ":
   "뛥쇼",

"뛦ㅣ":
   "뛥시",
"뛦ㅡ":
   "뛥스",
"뛦ㅐ":
   "뛥새",
"뛦ㅒ":
   "뛥섀",
"뛦ㅔ":
   "뛥세",
"뛦ㅖ":
   "뛥셰",


#
"뀁ㅏ":
   "꿰바",
"뀁ㅓ":
   "꿰버",
"뀁ㅑ":
   "꿰뱌",
"뀁ㅕ":
   "꿰벼",

"뀁ㅜ":
   "꿰부",
"뀁ㅠ":
   "꿰뷰",
"뀁ㅗ":
   "꿰보",
"뀁ㅛ":
   "꿰뵤",

"뀁ㅣ":
   "꿰비",
"뀁ㅡ":
   "꿰브",
"뀁ㅐ":
   "꿰배",
"뀁ㅒ":
   "꿰뱨",
"뀁ㅔ":
   "꿰베",
"뀁ㅖ":
   "꿰볘",


"뀆ㅏ":
   "꿰자",
"뀆ㅓ":
   "꿰저",
"뀆ㅑ":
   "꿰쟈",
"뀆ㅕ":
   "꿰져",

"뀆ㅜ":
   "꿰주",
"뀆ㅠ":
   "꿰쥬",
"뀆ㅗ":
   "꿰조",
"뀆ㅛ":
   "꿰죠",

"뀆ㅣ":
   "꿰지",
"뀆ㅡ":
   "꿰즈",
"뀆ㅐ":
   "꿰재",
"뀆ㅒ":
   "꿰쟤",
"뀆ㅔ":
   "꿰제",
"뀆ㅖ":
   "꿰졔",

"꿷ㅏ":
   "꿰다",
"꿷ㅓ":
   "꿰더",
"꿷ㅑ":
   "꿰댜",
"꿷ㅕ":
   "꿰뎌",

"꿷ㅜ":
   "꿰두",
"꿷ㅠ":
   "꿰듀",
"꿷ㅗ":
   "꿰도",
"꿷ㅛ":
   "꿰됴",

"꿷ㅣ":
   "꿰디",
"꿷ㅡ":
   "꿰드",
"꿷ㅐ":
   "꿰대",
"꿷ㅒ":
   "꿰댸",
"꿷ㅔ":
   "꿰데",
"꿷ㅖ":
   "꿰뎨",

"꿱ㅏ":
   "꿰가",
"꿱ㅓ":
   "꿰거",
"꿱ㅑ":
   "꿰갸",
"꿱ㅕ":
   "꿰겨",

"꿱ㅜ":
   "꿰구",
"꿱ㅠ":
   "꿰규",
"꿱ㅗ":
   "꿰고",
"꿱ㅛ":
   "꿰교",

"꿱ㅣ":
   "꿰기",
"꿱ㅡ":
   "꿰그",
"꿱ㅐ":
   "꿰개",
"꿱ㅒ":
   "꿰걔",
"꿱ㅔ":
   "꿰게",
"꿱ㅖ":
   "꿰계",

"뀃ㅏ":
   "꿰사",
"뀃ㅓ":
   "꿰서",
"뀃ㅑ":
   "꿰샤",
"뀃ㅕ":
   "꿰셔",

"뀃ㅜ":
   "꿰수",
"뀃ㅠ":
   "꿰슈",
"뀃ㅗ":
   "꿰소",
"뀃ㅛ":
   "꿰쇼",

"뀃ㅣ":
   "꿰시",
"뀃ㅡ":
   "꿰스",
"뀃ㅐ":
   "꿰새",
"뀃ㅒ":
   "꿰섀",
"뀃ㅔ":
   "꿰세",
"뀃ㅖ":
   "꿰셰",

"뀀ㅏ":
   "꿰마",
"뀀ㅓ":
   "꿰머",
"뀀ㅑ":
   "꿰먀",
"뀀ㅕ":
   "꿰며",

"뀀ㅜ":
   "꿰무",
"뀀ㅠ":
   "꿰뮤",
"뀀ㅗ":
   "꿰모",
"뀀ㅛ":
   "꿰묘",

"뀀ㅣ":
   "꿰미",
"뀀ㅡ":
   "꿰므",
"뀀ㅐ":
   "꿰매",
"뀀ㅒ":
   "꿰먜",
"뀀ㅔ":
   "꿰메",
"뀀ㅖ":
   "꿰몌",

"꿴ㅏ":
   "꿰나",
"꿴ㅓ":
   "꿰너",
"꿴ㅑ":
   "꿰냐",
"꿴ㅕ":
   "꿰녀",

"꿴ㅜ":
   "꿰누",
"꿴ㅠ":
   "꿰뉴",
"꿴ㅗ":
   "꿰노",
"꿴ㅛ":
   "꿰뇨",

"꿴ㅣ":
   "꿰니",
"꿴ㅡ":
   "꿰느",
"꿴ㅐ":
   "꿰내",
"꿴ㅒ":
   "꿰냬",
"꿴ㅔ":
   "꿰네",
"꿴ㅖ":
   "꿰녜",

"뀅ㅏ":
   "꿰아",
"뀅ㅓ":
   "꿰어",
"뀅ㅑ":
   "꿰야",
"뀅ㅕ":
   "꿰여",

"뀅ㅜ":
   "꿰우",
"뀅ㅠ":
   "꿰유",
"뀅ㅗ":
   "꿰오",
"뀅ㅛ":
   "꿰요",

"뀅ㅣ":
   "꿰이",
"뀅ㅡ":
   "꿰으",
"뀅ㅐ":
   "꿰애",
"뀅ㅒ":
   "꿰얘",
"뀅ㅔ":
   "꿰에",
"뀅ㅖ":
   "꿰예",


"꿸ㅏ":
   "꿰라",
"꿸ㅓ":
   "꿰러",
"꿸ㅑ":
   "꿰랴",
"꿸ㅕ":
   "꿰려",

"꿸ㅜ":
   "꿰루",
"꿸ㅠ":
   "꿰류",
"꿸ㅗ":
   "꿰로",
"꿸ㅛ":
   "꿰료",

"꿸ㅣ":
   "꿰리",
"꿸ㅡ":
   "꿰르",
"꿸ㅐ":
   "꿰래",
"꿸ㅒ":
   "꿰럐",
"꿸ㅔ":
   "꿰레",
"꿸ㅖ":
   "꿰례",



"뀋ㅏ":
   "꿰하",
"뀋ㅓ":
   "꿰허",
"뀋ㅑ":
   "꿰햐",
"뀋ㅕ":
   "꿰혀",

"뀋ㅜ":
   "꿰후",
"뀋ㅠ":
   "꿰휴",
"뀋ㅗ":
   "꿰호",
"뀋ㅛ":
   "꿰효",

"뀋ㅣ":
   "꿰히",
"뀋ㅡ":
   "꿰흐",
"뀋ㅐ":
   "꿰해",
"뀋ㅒ":
   "꿰햬",
"뀋ㅔ":
   "꿰헤",
"뀋ㅖ":
   "꿰혜",

"뀈ㅏ":
   "꿰카",
"뀈ㅓ":
   "꿰커",
"뀈ㅑ":
   "꿰캬",
"뀈ㅕ":
   "꿰켜",

"뀈ㅜ":
   "꿰쿠",
"뀈ㅠ":
   "꿰큐",
"뀈ㅗ":
   "꿰코",
"뀈ㅛ":
   "꿰쿄",

"뀈ㅣ":
   "꿰키",
"뀈ㅡ":
   "꿰크",
"뀈ㅐ":
   "꿰캐",
"뀈ㅒ":
   "꿰컈",
"뀈ㅔ":
   "꿰케",
"뀈ㅖ":
   "꿰켸", 


"뀉ㅏ":
   "꿰타",
"뀉ㅓ":
   "꿰터",
"뀉ㅑ":
   "꿰탸",
"뀉ㅕ":
   "꿰텨",

"뀉ㅜ":
   "꿰투",
"뀉ㅠ":
   "꿰튜",
"뀉ㅗ":
   "꿰토",
"뀉ㅛ":
   "꿰툐",

"뀉ㅣ":
   "꿰티",
"뀉ㅡ":
   "꿰트",
"뀉ㅐ":
   "꿰태",
"뀉ㅒ":
   "꿰턔",
"뀉ㅔ":
   "꿰테",
"뀉ㅖ":
   "꿰톄",

"뀇ㅏ":
   "꿰차",
"뀇ㅓ":
   "꿰처",
"뀇ㅑ":
   "꿰챠",
"뀇ㅕ":
   "꿰쳐",

"뀇ㅜ":
   "꿰추",
"뀇ㅠ":
   "꿰츄",
"뀇ㅗ":
   "꿰초",
"뀇ㅛ":
   "꿰쵸",

"뀇ㅣ":
   "꿰치",
"뀇ㅡ":
   "꿰츠",
"뀇ㅐ":
   "꿰채",
"뀇ㅒ":
   "꿰챼",
"뀇ㅔ":
   "꿰체",
"뀇ㅖ":
   "꿰쳬",




"뀊ㅏ":
   "꿰파",
"뀊ㅓ":
   "꿰퍼",
"뀊ㅑ":
   "꿰퍄",
"뀊ㅕ":
   "꿰펴",

"뀊ㅜ":
   "꿰푸",
"뀊ㅠ":
   "꿰퓨",
"뀊ㅗ":
   "꿰포",
"뀊ㅛ":
   "꿰표",

"뀊ㅣ":
   "꿰피",
"뀊ㅡ":
   "꿰프",
"뀊ㅐ":
   "꿰패",
"뀊ㅒ":
   "꿰퍠",
"뀊ㅔ":
   "꿰페",
"뀊ㅖ":
   "꿰폐",

"꿲ㅏ":
   "꿰까",
"꿲ㅓ":
   "꿰꺼",
"꿲ㅑ":
   "꿰꺄",
"꿲ㅕ":
   "꿰껴",

"꿲ㅜ":
   "꿰꾸",
"꿲ㅠ":
   "꿰뀨",
"꿲ㅗ":
   "꿰꼬",
"꿲ㅛ":
   "꿰꾜",

"꿲ㅣ":
   "꿰끼",
"꿲ㅡ":
   "꿰끄",
"꿲ㅐ":
   "꿰깨",
"꿲ㅒ":
   "꿰꺠",
"꿲ㅔ":
   "꿰께",
"꿲ㅖ":
   "꿰꼐",

"뀄ㅏ":
   "꿰싸",
"뀄ㅓ":
   "꿰써",
"뀄ㅑ":
   "꿰쌰",
"뀄ㅕ":
   "꿰쎠",

"뀄ㅜ":
   "꿰쑤",
"뀄ㅠ":
   "꿰쓔",
"뀄ㅗ":
   "꿰쏘",
"뀄ㅛ":
   "꿰쑈",

"뀄ㅣ":
   "꿰씨",
"뀄ㅡ":
   "꿰쓰",
"뀄ㅐ":
   "꿰쌔",
"뀄ㅒ":
   "꿰썌",
"뀄ㅔ":
   "꿰쎄",
"뀄ㅖ":
   "꿰쎼",


"꿳ㅏ":
   "꿱사",
"꿳ㅓ":
   "꿱서",
"꿳ㅑ":
   "꿱샤",
"꿳ㅕ":
   "꿱셔",

"꿳ㅜ":
   "꿱수",
"꿳ㅠ":
   "꿱슈",
"꿳ㅗ":
   "꿱소",
"꿳ㅛ":
   "꿱쇼",

"꿳ㅣ":
   "꿱시",
"꿳ㅡ":
   "꿱스",
"꿳ㅐ":
   "꿱새",
"꿳ㅒ":
   "꿱섀",
"꿳ㅔ":
   "꿱세",
"꿳ㅖ":
   "꿱셰",

"꿵ㅏ":
   "꿴자",
"꿵ㅓ":
   "꿴저",
"꿵ㅑ":
   "꿴쟈",
"꿵ㅕ":
   "꿴져",

"꿵ㅜ":
   "꿴주",
"꿵ㅠ":
   "꿴쥬",
"꿵ㅗ":
   "꿴조",
"꿵ㅛ":
   "꿴죠",

"꿵ㅣ":
   "꿴지",
"꿵ㅡ":
   "꿴즈",
"꿵ㅐ":
   "꿴재",
"꿵ㅒ":
   "꿴쟤",
"꿵ㅔ":
   "꿴제",
"꿵ㅖ":
   "꿴졔",


"꿶ㅏ":
   "꿴하",
"꿶ㅓ":
   "꿴허",
"꿶ㅑ":
   "꿴햐",
"꿶ㅕ":
   "꿴혀",

"꿶ㅜ":
   "꿴후",
"꿶ㅠ":
   "꿴휴",
"꿶ㅗ":
   "꿴호",
"꿶ㅛ":
   "꿴효",

"꿶ㅣ":
   "꿴히",
"꿶ㅡ":
   "꿴흐",
"꿶ㅐ":
   "꿴해",
"꿶ㅒ":
   "꿴햬",
"꿶ㅔ":
   "꿴헤",
"꿶ㅖ":
   "꿴혜",


"꿹ㅏ":
   "꿸가",
"꿹ㅓ":
   "꿸거",
"꿹ㅑ":
   "꿸갸",
"꿹ㅕ":
   "꿸겨",

"꿹ㅜ":
   "꿸구",
"꿹ㅠ":
   "꿸규",
"꿹ㅗ":
   "꿸고",
"꿹ㅛ":
   "꿸교",

"꿹ㅣ":
   "꿸기",
"꿹ㅡ":
   "꿸그",
"꿹ㅐ":
   "꿸개",
"꿹ㅒ":
   "꿸걔",
"꿹ㅔ":
   "꿸게",
"꿹ㅖ":
   "꿸계",



"꿺ㅏ":
   "꿸마",
"꿺ㅓ":
   "꿸머",
"꿺ㅑ":
   "꿸먀",
"꿺ㅕ":
   "꿸며",

"꿺ㅜ":
   "꿸무",
"꿺ㅠ":
   "꿸뮤",
"꿺ㅗ":
   "꿸모",
"꿺ㅛ":
   "꿸묘",

"꿺ㅣ":
   "꿸미",
"꿺ㅡ":
   "꿸므",
"꿺ㅐ":
   "꿸매",
"꿺ㅒ":
   "꿸먜",
"꿺ㅔ":
   "꿸메",
"꿺ㅖ":
   "꿸몌",



"꿻ㅏ":
   "꿸바",
"꿻ㅓ":
   "꿸버",
"꿻ㅑ":
   "꿸뱌",
"꿻ㅕ":
   "꿸벼",

"꿻ㅜ":
   "꿸부",
"꿻ㅠ":
   "꿸뷰",
"꿻ㅗ":
   "꿸보",
"꿻ㅛ":
   "꿸뵤",

"꿻ㅣ":
   "꿸비",
"꿻ㅡ":
   "꿸브",
"꿻ㅐ":
   "꿸배",
"꿻ㅒ":
   "꿸뱨",
"꿻ㅔ":
   "꿸베",
"꿻ㅖ":
   "꿸볘",


"꿼ㅏ":
   "꿸사",
"꿼ㅓ":
   "꿸서",
"꿼ㅑ":
   "꿸샤",
"꿼ㅕ":
   "꿸셔",

"꿼ㅜ":
   "꿸수",
"꿼ㅠ":
   "꿸슈",
"꿼ㅗ":
   "꿸소",
"꿼ㅛ":
   "꿸쇼",

"꿼ㅣ":
   "꿸시",
"꿼ㅡ":
   "꿸스",
"꿼ㅐ":
   "꿸새",
"꿼ㅒ":
   "꿸섀",
"꿼ㅔ":
   "꿸세",
"꿼ㅖ":
   "꿸셰",


"꿽ㅏ":
   "꿸타",
"꿽ㅓ":
   "꿸터",
"꿽ㅑ":
   "꿸탸",
"꿽ㅕ":
   "꿸텨",

"꿽ㅜ":
   "꿸투",
"꿽ㅠ":
   "꿸튜",
"꿽ㅗ":
   "꿸토",
"꿽ㅛ":
   "꿸툐",

"꿽ㅣ":
   "꿸티",
"꿽ㅡ":
   "꿸트",
"꿽ㅐ":
   "꿸태",
"꿽ㅒ":
   "꿸턔",
"꿽ㅔ":
   "꿸테",
"꿽ㅖ":
   "꿸톄",


"꿾ㅏ":
   "꿸파",
"꿾ㅓ":
   "꿸퍼",
"꿾ㅑ":
   "꿸퍄",
"꿾ㅕ":
   "꿸펴",

"꿾ㅜ":
   "꿸푸",
"꿾ㅠ":
   "꿸퓨",
"꿾ㅗ":
   "꿸포",
"꿾ㅛ":
   "꿸표",

"꿾ㅣ":
   "꿸피",
"꿾ㅡ":
   "꿸프",
"꿾ㅐ":
   "꿸패",
"꿾ㅒ":
   "꿸퍠",
"꿾ㅔ":
   "꿸페",
"꿾ㅖ":
   "꿸폐",



"꿿ㅏ":
   "꿸하",
"꿿ㅓ":
   "꿸허",
"꿿ㅑ":
   "꿸햐",
"꿿ㅕ":
   "꿸혀",

"꿿ㅜ":
   "꿸후",
"꿿ㅠ":
   "꿸휴",
"꿿ㅗ":
   "꿸호",
"꿿ㅛ":
   "꿸효",

"꿿ㅣ":
   "꿸히",
"꿿ㅡ":
   "꿸흐",
"꿿ㅐ":
   "꿸해",
"꿿ㅒ":
   "꿸햬",
"꿿ㅔ":
   "꿸헤",
"꿿ㅖ":
   "꿸혜",


"뀂ㅏ":
   "뀁사",
"뀂ㅓ":
   "뀁서",
"뀂ㅑ":
   "뀁샤",
"뀂ㅕ":
   "뀁셔",

"뀂ㅜ":
   "뀁수",
"뀂ㅠ":
   "뀁슈",
"뀂ㅗ":
   "뀁소",
"뀂ㅛ":
   "뀁쇼",

"뀂ㅣ":
   "뀁시",
"뀂ㅡ":
   "뀁스",
"뀂ㅐ":
   "뀁새",
"뀂ㅒ":
   "뀁섀",
"뀂ㅔ":
   "뀁세",
"뀂ㅖ":
   "뀁셰",



"쒭ㅏ":
   "쒜바",
"쒭ㅓ":
   "쒜버",
"쒭ㅑ":
   "쒜뱌",
"쒭ㅕ":
   "쒜벼",

"쒭ㅜ":
   "쒜부",
"쒭ㅠ":
   "쒜뷰",
"쒭ㅗ":
   "쒜보",
"쒭ㅛ":
   "쒜뵤",

"쒭ㅣ":
   "쒜비",
"쒭ㅡ":
   "쒜브",
"쒭ㅐ":
   "쒜배",
"쒭ㅒ":
   "쒜뱨",
"쒭ㅔ":
   "쒜베",
"쒭ㅖ":
   "쒜볘",


"쒲ㅏ":
   "쒜자",
"쒲ㅓ":
   "쒜저",
"쒲ㅑ":
   "쒜쟈",
"쒲ㅕ":
   "쒜져",

"쒲ㅜ":
   "쒜주",
"쒲ㅠ":
   "쒜쥬",
"쒲ㅗ":
   "쒜조",
"쒲ㅛ":
   "쒜죠",

"쒲ㅣ":
   "쒜지",
"쒲ㅡ":
   "쒜즈",
"쒲ㅐ":
   "쒜재",
"쒲ㅒ":
   "쒜쟤",
"쒲ㅔ":
   "쒜제",
"쒲ㅖ":
   "쒜졔",

"쒣ㅏ":
   "쒜다",
"쒣ㅓ":
   "쒜더",
"쒣ㅑ":
   "쒜댜",
"쒣ㅕ":
   "쒜뎌",

"쒣ㅜ":
   "쒜두",
"쒣ㅠ":
   "쒜듀",
"쒣ㅗ":
   "쒜도",
"쒣ㅛ":
   "쒜됴",

"쒣ㅣ":
   "쒜디",
"쒣ㅡ":
   "쒜드",
"쒣ㅐ":
   "쒜대",
"쒣ㅒ":
   "쒜댸",
"쒣ㅔ":
   "쒜데",
"쒣ㅖ":
   "쒜뎨",

"쒝ㅏ":
   "쒜가",
"쒝ㅓ":
   "쒜거",
"쒝ㅑ":
   "쒜갸",
"쒝ㅕ":
   "쒜겨",

"쒝ㅜ":
   "쒜구",
"쒝ㅠ":
   "쒜규",
"쒝ㅗ":
   "쒜고",
"쒝ㅛ":
   "쒜교",

"쒝ㅣ":
   "쒜기",
"쒝ㅡ":
   "쒜그",
"쒝ㅐ":
   "쒜개",
"쒝ㅒ":
   "쒜걔",
"쒝ㅔ":
   "쒜게",
"쒝ㅖ":
   "쒜계",



    
"쒯ㅏ":
   "쒜사",
"쒯ㅓ":
   "쒜서",
"쒯ㅑ":
   "쒜샤",
"쒯ㅕ":
   "쒜셔",

"쒯ㅜ":
   "쒜수",
"쒯ㅠ":
   "쒜슈",
"쒯ㅗ":
   "쒜소",
"쒯ㅛ":
   "쒜쇼",

"쒯ㅣ":
   "쒜시",
"쒯ㅡ":
   "쒜스",
"쒯ㅐ":
   "쒜새",
"쒯ㅒ":
   "쒜섀",
"쒯ㅔ":
   "쒜세",
"쒯ㅖ":
   "쒜셰",

"쒬ㅏ":
   "쒜마",
"쒬ㅓ":
   "쒜머",
"쒬ㅑ":
   "쒜먀",
"쒬ㅕ":
   "쒜며",

"쒬ㅜ":
   "쒜무",
"쒬ㅠ":
   "쒜뮤",
"쒬ㅗ":
   "쒜모",
"쒬ㅛ":
   "쒜묘",

"쒬ㅣ":
   "쒜미",
"쒬ㅡ":
   "쒜므",
"쒬ㅐ":
   "쒜매",
"쒬ㅒ":
   "쒜먜",
"쒬ㅔ":
   "쒜메",
"쒬ㅖ":
   "쒜몌",

"쒠ㅏ":
   "쒜나",
"쒠ㅓ":
   "쒜너",
"쒠ㅑ":
   "쒜냐",
"쒠ㅕ":
   "쒜녀",

"쒠ㅜ":
   "쒜누",
"쒠ㅠ":
   "쒜뉴",
"쒠ㅗ":
   "쒜노",
"쒠ㅛ":
   "쒜뇨",

"쒠ㅣ":
   "쒜니",
"쒠ㅡ":
   "쒜느",
"쒠ㅐ":
   "쒜내",
"쒠ㅒ":
   "쒜냬",
"쒠ㅔ":
   "쒜네",
"쒠ㅖ":
   "쒜녜",


"쒱ㅏ":
   "쒜아",
"쒱ㅓ":
   "쒜어",
"쒱ㅑ":
   "쒜야",
"쒱ㅕ":
   "쒜여",

"쒱ㅜ":
   "쒜우",
"쒱ㅠ":
   "쒜유",
"쒱ㅗ":
   "쒜오",
"쒱ㅛ":
   "쒜요",

"쒱ㅣ":
   "쒜이",
"쒱ㅡ":
   "쒜으",
"쒱ㅐ":
   "쒜애",
"쒱ㅒ":
   "쒜얘",
"쒱ㅔ":
   "쒜에",
"쒱ㅖ":
   "쒜예",

"쒤ㅏ":
   "쒜라",
"쒤ㅓ":
   "쒜러",
"쒤ㅑ":
   "쒜랴",
"쒤ㅕ":
   "쒜려",

"쒤ㅜ":
   "쒜루",
"쒤ㅠ":
   "쒜류",
"쒤ㅗ":
   "쒜로",
"쒤ㅛ":
   "쒜료",

"쒤ㅣ":
   "쒜리",
"쒤ㅡ":
   "쒜르",
"쒤ㅐ":
   "쒜래",
"쒤ㅒ":
   "쒜럐",
"쒤ㅔ":
   "쒜레",
"쒤ㅖ":
   "쒜례",

"쒷ㅏ":
   "쒜하",
"쒷ㅓ":
   "쒜허",
"쒷ㅑ":
   "쒜햐",
"쒷ㅕ":
   "쒜혀",

"쒷ㅜ":
   "쒜후",
"쒷ㅠ":
   "쒜휴",
"쒷ㅗ":
   "쒜호",
"쒷ㅛ":
   "쒜효",

"쒷ㅣ":
   "쒜히",
"쒷ㅡ":
   "쒜흐",
"쒷ㅐ":
   "쒜해",
"쒷ㅒ":
   "쒜햬",
"쒷ㅔ":
   "쒜헤",
"쒷ㅖ":
   "쒜혜",

    
"쒴ㅏ":
   "쒜카",
"쒴ㅓ":
   "쒜커",
"쒴ㅑ":
   "쒜캬",
"쒴ㅕ":
   "쒜켜",

"쒴ㅜ":
   "쒜쿠",
"쒴ㅠ":
   "쒜큐",
"쒴ㅗ":
   "쒜코",
"쒴ㅛ":
   "쒜쿄",

"쒴ㅣ":
   "쒜키",
"쒴ㅡ":
   "쒜크",
"쒴ㅐ":
   "쒜캐",
"쒴ㅒ":
   "쒜컈",
"쒴ㅔ":
   "쒜케",
"쒴ㅖ":
   "쒜켸",

"쒵ㅏ":
   "쒜타",
"쒵ㅓ":
   "쒜터",
"쒵ㅑ":
   "쒜탸",
"쒵ㅕ":
   "쒜텨",

"쒵ㅜ":
   "쒜투",
"쒵ㅠ":
   "쒜튜",
"쒵ㅗ":
   "쒜토",
"쒵ㅛ":
   "쒜툐",

"쒵ㅣ":
   "쒜티",
"쒵ㅡ":
   "쒜트",
"쒵ㅐ":
   "쒜태",
"쒵ㅒ":
   "쒜턔",
"쒵ㅔ":
   "쒜테",
"쒵ㅖ":
   "쒜톄",

"쒳ㅏ":
   "쒜차",
"쒳ㅓ":
   "쒜처",
"쒳ㅑ":
   "쒜챠",
"쒳ㅕ":
   "쒜쳐",

"쒳ㅜ":
   "쒜추",
"쒳ㅠ":
   "쒜츄",
"쒳ㅗ":
   "쒜초",
"쒳ㅛ":
   "쒜쵸",

"쒳ㅣ":
   "쒜치",
"쒳ㅡ":
   "쒜츠",
"쒳ㅐ":
   "쒜채",
"쒳ㅒ":
   "쒜챼",
"쒳ㅔ":
   "쒜체",
"쒳ㅖ":
   "쒜쳬",



"쒶ㅏ":
   "쒜파",
"쒶ㅓ":
   "쒜퍼",
"쒶ㅑ":
   "쒜퍄",
"쒶ㅕ":
   "쒜펴",

"쒶ㅜ":
   "쒜푸",
"쒶ㅠ":
   "쒜퓨",
"쒶ㅗ":
   "쒜포",
"쒶ㅛ":
   "쒜표",

"쒶ㅣ":
   "쒜피",
"쒶ㅡ":
   "쒜프",
"쒶ㅐ":
   "쒜패",
"쒶ㅒ":
   "쒜퍠",
"쒶ㅔ":
   "쒜페",
"쒶ㅖ":
   "쒜폐",


"쒞ㅏ":
   "쒜까",
"쒞ㅓ":
   "쒜꺼",
"쒞ㅑ":
   "쒜꺄",
"쒞ㅕ":
   "쒜껴",



"쒞ㅜ":
   "쒜꾸",
"쒞ㅠ":
   "쒜뀨",
"쒞ㅗ":
   "쒜꼬",
"쒞ㅛ":
   "쒜꾜",

"쒞ㅣ":
   "쒜끼",
"쒞ㅡ":
   "쒜끄",
"쒞ㅐ":
   "쒜깨",
"쒞ㅒ":
   "쒜꺠",
"쒞ㅔ":
   "쒜께",
"쒞ㅖ":
   "쒜꼐",

"쒰ㅏ":
   "쒜싸",
"쒰ㅓ":
   "쒜써",
"쒰ㅑ":
   "쒜쌰",
"쒰ㅕ":
   "쒜쎠",

"쒰ㅜ":
   "쒜쑤",
"쒰ㅠ":
   "쒜쓔",
"쒰ㅗ":
   "쒜쏘",
"쒰ㅛ":
   "쒜쑈",

"쒰ㅣ":
   "쒜씨",
"쒰ㅡ":
   "쒜쓰",
"쒰ㅐ":
   "쒜쌔",
"쒰ㅒ":
   "쒜썌",
"쒰ㅔ":
   "쒜쎄",
"쒰ㅖ":
   "쒜쎼",

"쒟ㅏ":
   "쒝사",
"쒟ㅓ":
   "쒝서",
"쒟ㅑ":
   "쒝샤",
"쒟ㅕ":
   "쒝셔",

"쒟ㅜ":
   "쒝수",
"쒟ㅠ":
   "쒝슈",
"쒟ㅗ":
   "쒝소",
"쒟ㅛ":
   "쒝쇼",

"쒟ㅣ":
   "쒝시",
"쒟ㅡ":
   "쒝스",
"쒟ㅐ":
   "쒝새",
"쒟ㅒ":
   "쒝섀",
"쒟ㅔ":
   "쒝세",
"쒟ㅖ":
   "쒝셰",

"쒡ㅏ":
   "쒠자",
"쒡ㅓ":
   "쒠저",
"쒡ㅑ":
   "쒠쟈",
"쒡ㅕ":
   "쒠져",

"쒡ㅜ":
   "쒠주",
"쒡ㅠ":
   "쒠쥬",
"쒡ㅗ":
   "쒠조",
"쒡ㅛ":
   "쒠죠",

"쒡ㅣ":
   "쒠지",
"쒡ㅡ":
   "쒠즈",
"쒡ㅐ":
   "쒠재",
"쒡ㅒ":
   "쒠쟤",
"쒡ㅔ":
   "쒠제",
"쒡ㅖ":
   "쒠졔",

"쒢ㅏ":
   "쒠하",
"쒢ㅓ":
   "쒠허",
"쒢ㅑ":
   "쒠햐",
"쒢ㅕ":
   "쒠혀",

"쒢ㅜ":
   "쒠후",
"쒢ㅠ":
   "쒠휴",
"쒢ㅗ":
   "쒠호",
"쒢ㅛ":
   "쒠효",

"쒢ㅣ":
   "쒠히",
"쒢ㅡ":
   "쒠흐",
"쒢ㅐ":
   "쒠해",
"쒢ㅒ":
   "쒠햬",
"쒢ㅔ":
   "쒠헤",
"쒢ㅖ":
   "쒠혜",

"쒥ㅏ":
   "쒤가",
"쒥ㅓ":
   "쒤거",
"쒥ㅑ":
   "쒤갸",
"쒥ㅕ":
   "쒤겨",

"쒥ㅜ":
   "쒤구",
"쒥ㅠ":
   "쒤규",
"쒥ㅗ":
   "쒤고",
"쒥ㅛ":
   "쒤교",

"쒥ㅣ":
   "쒤기",
"쒥ㅡ":
   "쒤그",
"쒥ㅐ":
   "쒤개",
"쒥ㅒ":
   "쒤걔",
"쒥ㅔ":
   "쒤게",
"쒥ㅖ":
   "쒤계",

"쒦ㅏ":
   "쒤마",
"쒦ㅓ":
   "쒤머",
"쒦ㅑ":
   "쒤먀",
"쒦ㅕ":
   "쒤며",

"쒦ㅜ":
   "쒤무",
"쒦ㅠ":
   "쒤뮤",
"쒦ㅗ":
   "쒤모",
"쒦ㅛ":
   "쒤묘",

"쒦ㅣ":
   "쒤미",
"쒦ㅡ":
   "쒤므",
"쒦ㅐ":
   "쒤매",
"쒦ㅒ":
   "쒤먜",
"쒦ㅔ":
   "쒤메",
"쒦ㅖ":
   "쒤몌",

"쒧ㅏ":
   "쒤바",
"쒧ㅓ":
   "쒤버",
"쒧ㅑ":
   "쒤뱌",
"쒧ㅕ":
   "쒤벼",

"쒧ㅜ":
   "쒤부",
"쒧ㅠ":
   "쒤뷰",
"쒧ㅗ":
   "쒤보",
"쒧ㅛ":
   "쒤뵤",

"쒧ㅣ":
   "쒤비",
"쒧ㅡ":
   "쒤브",
"쒧ㅐ":
   "쒤배",
"쒧ㅒ":
   "쒤뱨",
"쒧ㅔ":
   "쒤베",
"쒧ㅖ":
   "쒤볘",

"쒨ㅏ":
   "쒤사",
"쒨ㅓ":
   "쒤서",
"쒨ㅑ":
   "쒤샤",
"쒨ㅕ":
   "쒤셔",

"쒨ㅜ":
   "쒤수",
"쒨ㅠ":
   "쒤슈",
"쒨ㅗ":
   "쒤소",
"쒨ㅛ":
   "쒤쇼",

"쒨ㅣ":
   "쒤시",
"쒨ㅡ":
   "쒤스",
"쒨ㅐ":
   "쒤새",
"쒨ㅒ":
   "쒤섀",
"쒨ㅔ":
   "쒤세",
"쒨ㅖ":
   "쒤셰",


"쒩ㅏ":
   "쒤타",
"쒩ㅓ":
   "쒤터",
"쒩ㅑ":
   "쒤탸",
"쒩ㅕ":
   "쒤텨",

"쒩ㅜ":
   "쒤투",
"쒩ㅠ":
   "쒤튜",
"쒩ㅗ":
   "쒤토",
"쒩ㅛ":
   "쒤툐",

"쒩ㅣ":
   "쒤티",
"쒩ㅡ":
   "쒤트",
"쒩ㅐ":
   "쒤태",
"쒩ㅒ":
   "쒤턔",
"쒩ㅔ":
   "쒤테",
"쒩ㅖ":
   "쒤톄",

"쒪ㅏ":
   "쒤파",
"쒪ㅓ":
   "쒤퍼",
"쒪ㅑ":
   "쒤퍄",
"쒪ㅕ":
   "쒤펴",

"쒪ㅜ":
   "쒤푸",
"쒪ㅠ":
   "쒤퓨",
"쒪ㅗ":
   "쒤포",
"쒪ㅛ":
   "쒤표",

"쒪ㅣ":
   "쒤피",
"쒪ㅡ":
   "쒤프",
"쒪ㅐ":
   "쒤패",
"쒪ㅒ":
   "쒤퍠",
"쒪ㅔ":
   "쒤페",
"쒪ㅖ":
   "쒤폐",

"쒫ㅏ":
   "쒤하",
"쒫ㅓ":
   "쒤허",
"쒫ㅑ":
   "쒤햐",
"쒫ㅕ":
   "쒤혀",

"쒫ㅜ":
   "쒤후",
"쒫ㅠ":
   "쒤휴",
"쒫ㅗ":
   "쒤호",
"쒫ㅛ":
   "쒤효",

"쒫ㅣ":
   "쒤히",
"쒫ㅡ":
   "쒤흐",
"쒫ㅐ":
   "쒤해",
"쒫ㅒ":
   "쒤햬",
"쒫ㅔ":
   "쒤헤",
"쒫ㅖ":
   "쒤혜",

"쒮ㅏ":
   "쒭사",
"쒮ㅓ":
   "쒭서",
"쒮ㅑ":
   "쒭샤",
"쒮ㅕ":
   "쒭셔",

"쒮ㅜ":
   "쒭수",
"쒮ㅠ":
   "쒭슈",
"쒮ㅗ":
   "쒭소",
"쒮ㅛ":
   "쒭쇼",

"쒮ㅣ":
   "쒭시",
"쒮ㅡ":
   "쒭스",
"쒮ㅐ":
   "쒭새",
"쒮ㅒ":
   "쒭섀",
"쒮ㅔ":
   "쒭세",
"쒮ㅖ":
   "쒭셰"


    }
